#include "myPinyin.h"

#define g_length_lastNameTable 554
#define g_length_multiToneWordTable 708
#define g_length_hanziTables 411


/* 
0. ÐÕÊÏÌØÊâ¶ÁÒô(°üÀ¨£ºÌØÊâ¡¢·ÇÌØÊâ¡¢¸´ÐÕ¶ÁÒô)
1. ¿ÉÒÔ×Ô¼ºÌí¼Ó
3. À´Ô´ÓÚ¸÷ÖÖÍøÂçÊý¾ÝµÄÕûºÏ
*/
lastNameTableS lastNameTable[g_length_lastNameTable] =
{
	{ "ÕÔ" , "zhao" },
	{ "Ç®" , "qian" },
	{ "Ëï" , "sun" },
	{ "Àî" , "li" },
	{ "ÖÜ" , "zhou" },
	{ "Îâ" , "wu" },
	{ "Ö£" , "zheng" },
	{ "Íõ" , "wang" },
	{ "·ë" , "feng" },
	{ "³Â" , "chen" },
	{ "ñÒ" , "chu" },
	{ "ÎÀ" , "wei" },
	{ "½¯" , "jiang" },
	{ "Éò" , "shen" },
	{ "º«" , "han" },
	{ "Ñî" , "yang" },
	{ "Öì" , "zhu" },
	{ "ÇØ" , "qin" },
	{ "ÓÈ" , "you" },
	{ "Ðí" , "xu" },
	{ "ºÎ" , "he" },
	{ "ÂÀ" , "lv" },
	{ "Ê©" , "shi" },
	{ "ÕÅ" , "zhang" },
	{ "¿×" , "kong" },
	{ "²Ü" , "cao" },
	{ "ÑÏ" , "yan" },
	{ "»ª" , "hua" },
	{ "½ð" , "jin" },
	{ "Îº" , "wei" },
	{ "ÌÕ" , "tao" },
	{ "½ª" , "jiang" },
	{ "ÆÝ" , "qi" },
	{ "Ð»" , "xie" },
	{ "×Þ" , "zou" },
	{ "Ó÷" , "yu" },
	{ "°Ø" , "bai" },
	{ "Ë®" , "shui" },
	{ "ñ¼" , "dou" },
	{ "ÕÂ" , "zhang" },
	{ "ÔÆ" , "yun" },
	{ "ËÕ" , "su" },
	{ "ÅË" , "pan" },
	{ "¸ð" , "ge" },
	{ "ÞÉ" , "xi" },
	{ "·¶" , "fan" },
	{ "Åí" , "peng" },
	{ "ÀÉ" , "lang" },
	{ "Â³" , "lu" },
	{ "Î¤" , "wei" },
	{ "²ý" , "chang" },
	{ "Âí" , "ma" },
	{ "Ãç" , "miao" },
	{ "·ï" , "feng" },
	{ "»¨" , "hua" },
	{ "·½" , "fang" },
	{ "Óá" , "yu" },
	{ "ÈÎ" , "ren" },
	{ "Ô¬" , "yuan" },
	{ "Áø" , "liu" },
	{ "Ûº" , "feng" },
	{ "±«" , "bao" },
	{ "Ê·" , "shi" },
	{ "ÌÆ" , "tang" },
	{ "·Ñ" , "fei" },
	{ "Á®" , "lian" },
	{ "á¯" , "cen" },
	{ "Ñ¦" , "xue" },
	{ "À×" , "lei" },
	{ "ºØ" , "he" },
	{ "Äß" , "ni" },
	{ "ÌÀ" , "tang" },
	{ "ëø" , "teng" },
	{ "Òó" , "yin" },
	{ "ÂÞ" , "luo" },
	{ "±Ï" , "bi" },
	{ "ºÂ" , "hao" },
	{ "Úù" , "wu" },
	{ "°²" , "an" },
	{ "³£" , "chang" },
	{ "ÀÖ" , "yue" },
	{ "ÓÚ" , "yu" },
	{ "Ê±" , "shi" },
	{ "¸µ" , "fu" },
	{ "Æ¤" , "pi" },
	{ "±å" , "bian" },
	{ "Æë" , "qi" },
	{ "¿µ" , "kang" },
	{ "Îé" , "wu" },
	{ "Óà" , "yu" },
	{ "Ôª" , "yuan" },
	{ "²·" , "bu" },
	{ "¹Ë" , "gu" },
	{ "ÃÏ" , "meng" },
	{ "Æ½" , "ping" },
	{ "»Æ" , "huang" },
	{ "ºÍ" , "he" },
	{ "ÄÂ" , "mu" },
	{ "Ïô" , "xiao" },
	{ "Òü" , "yin" },
	{ "Ò¦" , "yao" },
	{ "ÉÛ" , "shao" },
	{ "Õ¿" , "zhan" },
	{ "Íô" , "wang" },
	{ "Æî" , "qi" },
	{ "Ã«" , "mao" },
	{ "Óí" , "yu" },
	{ "µÒ" , "di" },
	{ "Ã×" , "mi" },
	{ "±´" , "bei" },
	{ "Ã÷" , "ming" },
	{ "ê°" , "zang" },
	{ "¼Æ" , "ji" },
	{ "·ü" , "fu" },
	{ "³É" , "cheng" },
	{ "´÷" , "dai" },
	{ "Ì¸" , "tan" },
	{ "ËÎ" , "song" },
	{ "Ã©" , "mao" },
	{ "ÅÓ" , "pang" },
	{ "ÐÜ" , "xiong" },
	{ "¼Í" , "ji" },
	{ "Êæ" , "shu" },
	{ "Çü" , "qu" },
	{ "Ïî" , "xiang" },
	{ "×£" , "zhu" },
	{ "¶­" , "dong" },
	{ "Áº" , "liang" },
	{ "¶Å" , "du" },
	{ "Èî" , "ruan" },
	{ "À¶" , "lan" },
	{ "ãÉ" , "min" },
	{ "Ï¯" , "xi" },
	{ "¼¾" , "ji" },
	{ "Âé" , "ma" },
	{ "Ç¿" , "qiang" },
	{ "¼Ö" , "jia" },
	{ "Â·" , "lu" },
	{ "Â¦" , "lou" },
	{ "Î£" , "wei" },
	{ "½­" , "jiang" },
	{ "Í¯" , "tong" },
	{ "ÑÕ" , "yan" },
	{ "¹ù" , "guo" },
	{ "Ã·" , "mei" },
	{ "Ê¢" , "sheng" },
	{ "ÁÖ" , "lin" },
	{ "µó" , "diao" },
	{ "ÖÓ" , "zhong" },
	{ "Ðì" , "xu" },
	{ "Çñ" , "qiu" },
	{ "Âæ" , "luo" },
	{ "¸ß" , "gao" },
	{ "ÏÄ" , "xia" },
	{ "²Ì" , "cai" },
	{ "Ìï" , "tian" },
	{ "·®" , "fan" },
	{ "ºú" , "hu" },
	{ "Áè" , "ling" },
	{ "»ô" , "huo" },
	{ "ÓÝ" , "yu" },
	{ "Íò" , "wan" },
	{ "Ö§" , "zhi" },
	{ "¿Â" , "ke" },
	{ "êÃ" , "zan" },
	{ "¹Ü" , "guan" },
	{ "Â¬" , "lu" },
	{ "Äª" , "mo" },
	{ "¾­" , "jing" },
	{ "·¿" , "fang" },
	{ "ôÃ" , "qiu" },
	{ "çÑ" , "miao" },
	{ "¸É" , "gan" },
	{ "½â" , "xie" },
	{ "Ó¦" , "ying" },
	{ "×Ú" , "zong" },
	{ "¶¡" , "ding" },
	{ "Ðû" , "xuan" },
	{ "êÚ" , "ben" },
	{ "µË" , "deng" },
	{ "Óô" , "yu" },
	{ "µ¥" , "shan" },
	{ "º¼" , "hang" },
	{ "ºé" , "hong" },
	{ "°ü" , "bao" },
	{ "Öî" , "zhu" },
	{ "×ó" , "zuo" },
	{ "Ê¯" , "shi" },
	{ "´Þ" , "cui" },
	{ "¼ª" , "ji" },
	{ "Å¥" , "niu" },
	{ "¹¨" , "gong" },
	{ "³Ì" , "cheng" },
	{ "ïú" , "ji" },
	{ "ÐÏ" , "xing" },
	{ "»¬" , "hua" },
	{ "Åá" , "pei" },
	{ "Â½" , "lu" },
	{ "ÈÙ" , "rong" },
	{ "ÎÌ" , "weng" },
	{ "Ü÷" , "xun" },
	{ "Ñò" , "yang" },
	{ "ì¶" , "yu" },
	{ "»Ý" , "hui" },
	{ "Õç" , "zhen" },
	{ "Çú" , "qu" },
	{ "¼Ò" , "jia" },
	{ "·â" , "feng" },
	{ "ÜÇ" , "rui" },
	{ "ôà" , "yi" },
	{ "´¢" , "chu" },
	{ "½ù" , "jin" },
	{ "¼³" , "ji" },
	{ "Úû" , "bing" },
	{ "ÃÓ" , "mi" },
	{ "ËÉ" , "song" },
	{ "¾®" , "jing" },
	{ "¶Î" , "duan" },
	{ "¸»" , "fu" },
	{ "Î×" , "wu" },
	{ "ÎÚ" , "wu" },
	{ "½¹" , "jiao" },
	{ "°Í" , "ba" },
	{ "¹­" , "gong" },
	{ "ÄÁ" , "mu" },
	{ "Úó" , "kui" },
	{ "É½" , "shan" },
	{ "¹È" , "gu" },
	{ "³µ" , "che" },
	{ "ºî" , "hou" },
	{ "åµ" , "mi" },
	{ "Åî" , "peng" },
	{ "È«" , "quan" },
	{ "Û­" , "xi" },
	{ "°à" , "ban" },
	{ "Ñö" , "yang" },
	{ "Çï" , "qiu" },
	{ "ÖÙ" , "zhong" },
	{ "ÒÁ" , "yi" },
	{ "¹¬" , "gong" },
	{ "Äþ" , "ning" },
	{ "³ð" , "qiu" },
	{ "èï" , "luan" },
	{ "±©" , "bao" },
	{ "¸Ê" , "gan" },
	{ "î×" , "tou" },
	{ "À÷" , "li" },
	{ "ÈÖ" , "rong" },
	{ "×æ" , "zu" },
	{ "Îä" , "wu" },
	{ "·û" , "fu" },
	{ "Áõ" , "liu" },
	{ "¾°" , "jing" },
	{ "Õ²" , "zhan" },
	{ "Êø" , "shu" },
	{ "Áú" , "long" },
	{ "Ò¶" , "ye" },
	{ "ÐÒ" , "xing" },
	{ "Ë¾" , "si" },
	{ "ÉØ" , "shao" },
	{ "Û¬" , "gao" },
	{ "Àè" , "li" },
	{ "¼»" , "ji" },
	{ "±¡" , "bo" },
	{ "Ó¡" , "yin" },
	{ "ËÞ" , "su" },
	{ "°×" , "bai" },
	{ "»³" , "huai" },
	{ "ÆÑ" , "pu" },
	{ "Û¢" , "tai" },
	{ "´Ó" , "cong" },
	{ "¶õ" , "e" },
	{ "Ë÷" , "suo" },
	{ "ÏÌ" , "xian" },
	{ "¼®" , "ji" },
	{ "Àµ" , "lai" },
	{ "×¿" , "zhuo" },
	{ "Ýþ" , "lin" },
	{ "ÍÀ" , "tu" },
	{ "ÃÉ" , "meng" },
	{ "³Ø" , "chi" },
	{ "ÇÇ" , "qiao" },
	{ "Òõ" , "yin" },
	{ "Óô" , "yu" },
	{ "ñã" , "xu" },
	{ "ÄÜ" , "nai" },
	{ "²Ô" , "cang" },
	{ "Ë«" , "shuang" },
	{ "ÎÅ" , "wen" },
	{ "Ý·" , "shen" },
	{ "µ³" , "dang" },
	{ "µÔ" , "zhai" },
	{ "Ì·" , "tan" },
	{ "¹±" , "gong" },
	{ "ÀÍ" , "lao" },
	{ "åÌ" , "pang" },
	{ "¼§" , "ji" },
	{ "Éê" , "shen" },
	{ "·ö" , "fu" },
	{ "¶Â" , "du" },
	{ "È½" , "ran" },
	{ "Ô×" , "zai" },
	{ "Ûª" , "li" },
	{ "Óº" , "yong" },
	{ "àS" , "xi" },
	{ "è³" , "qu" },
	{ "É£" , "sang" },
	{ "¹ð" , "gui" },
	{ "å§" , "pu" },
	{ "Å£" , "niu" },
	{ "ÊÙ" , "shou" },
	{ "Í¨" , "tong" },
	{ "±ß" , "bian" },
	{ "ìè" , "hu" },
	{ "Ñà" , "yan" },
	{ "¼½" , "ji" },
	{ "Û£" , "jia" },
	{ "ÆÖ" , "pu" },
	{ "ÉÐ" , "shang" },
	{ "Å©" , "nong" },
	{ "ÎÂ" , "wen" },
	{ "±ð" , "bie" },
	{ "×¯" , "zhuang" },
	{ "êÌ" , "yan" },
	{ "²ñ" , "chai" },
	{ "öÄ" , "qu" },
	{ "ÑÖ" , "yan" },
	{ "³ä" , "chong" },
	{ "Ä½" , "mu" },
	{ "Á¬" , "lian" },
	{ "Èã" , "ru" },
	{ "Ï°" , "xi" },
	{ "»Â" , "huan" },
	{ "°¬" , "ai" },
	{ "Óã" , "yu" },
	{ "ÈÝ" , "rong" },
	{ "Ïò" , "xiang" },
	{ "¹Å" , "gu" },
	{ "Ò×" , "yi" },
	{ "É÷" , "shen" },
	{ "¸ê" , "ge" },
	{ "ÁÎ" , "liao" },
	{ "â×" , "yu" },
	{ "ÖÕ" , "zhong" },
	{ "ôß" , "ji" },
	{ "¾Ó" , "ju" },
	{ "ºâ" , "heng" },
	{ "²½" , "bu" },
	{ "¶¼" , "du" },
	{ "¹¢" , "geng" },
	{ "Âú" , "man" },
	{ "ºë" , "hong" },
	{ "¿ï" , "kuang" },
	{ "¹ú" , "guo" },
	{ "ÎÄ" , "wen" },
	{ "¿Ü" , "kou" },
	{ "¹ã" , "guang" },
	{ "Â»" , "lu" },
	{ "ãÚ" , "que" },
	{ "¶«" , "dong" },
	{ "Å·" , "ou" },
	{ "ì¯" , "shu" },
	{ "ÎÖ" , "wo" },
	{ "Àû" , "li" },
	{ "Îµ" , "wei" },
	{ "Ô½" , "yue" },
	{ "Ùç" , "kui" },
	{ "Â¡" , "long" },
	{ "Ê¦" , "shi" },
	{ "¹®" , "gong" },
	{ "ØÇ" , "she" },
	{ "Äô" , "nie" },
	{ "êË" , "chao" },
	{ "¹´" , "gou" },
	{ "¾ä" , "gou" },
	{ "°½" , "ao" },
	{ "ÈÚ" , "rong" },
	{ "Àä" , "leng" },
	{ "ö¤" , "zi" },
	{ "ÐÁ" , "xin" },
	{ "ãÛ" , "kan" },
	{ "ÄÇ" , "na" },
	{ "¼ò" , "jian" },
	{ "ÈÄ" , "rao" },
	{ "¿Õ" , "kong" },
	{ "Ôø" , "zeng" },
	{ "Ä¸" , "mu" },
	{ "É³" , "sha" },
	{ "Ø¿" , "nie" },
	{ "Ñø" , "yang" },
	{ "¾Ï" , "ju" },
	{ "Ðë" , "xu" },
	{ "·á" , "feng" },
	{ "³²" , "chao" },
	{ "¹Ø" , "guan" },
	{ "Øá" , "kuai" },
	{ "Ïà" , "xiang" },
	{ "²é" , "zha" },
	{ "ºó" , "hou" },
	{ "¾£" , "jing" },
	{ "ºì" , "hong" },
	{ "ÓÎ" , "you" },
	{ "óÃ" , "zhu" },
	{ "È¨" , "quan" },
	{ "åÖ" , "lu" },
	{ "¸Ç" , "gai" },
	{ "Òæ" , "yi" },
	{ "»¸" , "huan" },
	{ "¹«" , "gong" },
	{ "ÍòÙ¹" , "moqi" },
	{ "Ë¾Âí" , "sima" },
	{ "ÉÏ¹Ù" , "shangguan" },
	{ "Å·Ñô" , "ouyang" },
	{ "ÏÄºî" , "xiahou" },
	{ "Öî¸ð" , "zhuge" },
	{ "ÎÅÈË" , "wenren" },
	{ "¶«·½" , "dongfang" },
	{ "ºÕÁ¬" , "helian" },
	{ "»Ê¸¦" , "huangpu" },
	{ "Î¾³Ù" , "yuchi" },
	{ "¹«Ñò" , "gongyang" },
	{ "å£Ì¨" , "tantai" },
	{ "¹«Ò±" , "gongye" },
	{ "×ÚÕþ" , "zongzheng" },
	{ "å§Ñô" , "puyang" },
	{ "´¾ÓÚ" , "chunyu" },
	{ "µ¥ÓÚ" , "chanyu" },
	{ "Ì«Êå" , "taishu" },
	{ "ÉêÍÀ" , "shentu" },
	{ "¹«Ëï" , "gongsun" },
	{ "ÖÙËï" , "zhongsun" },
	{ "ÐùÔ¯" , "xuanyuan" },
	{ "Áîºü" , "linghu" },
	{ "ÖÓÀë" , "zhongli" },
	{ "ÓîÎÄ" , "yuwen" },
	{ "³¤Ëï" , "zhangsun" },
	{ "Ä½ÈÝ" , "murong" },
	{ "ÏÊÓÚ" , "xianyu" },
	{ "ãÌÇð" , "luqiu" },
	{ "Ë¾Í½" , "situ" },
	{ "Ë¾¿Õ" , "sikong" },
	{ "ØÁ¹Ù" , "qiguan" },
	{ "Ë¾¿Ü" , "sikou" },
	{ "Øë¶½" , "zhangdu" },
	{ "×Ó³µ" , "ziju" },
	{ "ò§Ëï" , "zhuansun" },
	{ "¶ËÄ¾" , "duanmu" },
	{ "Î×Âí" , "wuma" },
	{ "¹«Î÷" , "gongxi" },
	{ "Æáµñ" , "qidiao" },
	{ "ÀÖÕý" , "yuezheng" },
	{ "ÈÀæá" , "rangsi" },
	{ "¹«Á¼" , "gongliang" },
	{ "ÍØ°Ï" , "tuoba" },
	{ "¼Ð¹È" , "jiagu" },
	{ "Ô×¸¸" , "zaifu" },
	{ "˜bÁº" , "guliang" },
	{ "½ú" , "jin" },
	{ "³þ" , "chu" },
	{ "ãÆ" , "yan" },
	{ "·¨" , "fa" },
	{ "Èê" , "ru" },
	{ "Û³" , "yan" },
	{ "Í¿" , "tu" },
	{ "ÇÕ" , "qin" },
	{ "¶Î¸É" , "duangan" },
	{ "°ÙÀï" , "baili" },
	{ "¶«¹ù" , "dongguo" },
	{ "ÄÏÃÅ" , "nanmen" },
	{ "ºôÑÓ" , "huyan" },
	{ "¹é" , "gui" },
	{ "º£" , "hai" },
	{ "ÑòÉà" , "yangshe" },
	{ "Î¢" , "wei" },
	{ "Éú" , "sheng" },
	{ "ÔÀ" , "yue" },
	{ "Ë§" , "shuai" },
	{ "çÃ" , "gou" },
	{ "¿º" , "kang" },
	{ "¿ö" , "kuang" },
	{ "ºó" , "hou" },
	{ "ÓÐ" , "you" },
	{ "ÇÙ" , "qin" },
	{ "ÁºÇð" , "liangqiu" },
	{ "×óÇð" , "zuoqiu" },
	{ "¶«ÃÅ" , "dongmen" },
	{ "Î÷ÃÅ" , "ximen" },
	{ "ÉÌ" , "shang" },
	{ "Ä²" , "mou" },
	{ "ÙÜ" , "she" },
	{ "Ù¦" , "nai" },
	{ "²®" , "bo" },
	{ "ÉÍ" , "shang" },
	{ "ÄÏ¹¬" , "nangong" },
	{ "Ä«" , "mo" },
	{ "¹þ" , "ha" },
	{ "ÚÛ" , "qiao" },
	{ "óÎ" , "da" },
	{ "Äê" , "nian" },
	{ "°®" , "ai" },
	{ "Ñô" , "yang" },
	{ "Ù¡" , "tong" },
	{ "µÚÎå" , "diwu" },
	{ "ÑÔ" , "yan" },
	{ "¸£" , "fu" },
	{ "ºÚ" , "he" },
	{ "Çø" , "ou" },
	{ "ÆÓ" , "piao" },
	{ "·±" , "po" },
	{ "Ô±" , "yun" },
	{ "Þ¬" , "pi" },
	{ "ÖÖ" , "chong" },
	{ "ÃØ" , "bi" },
	{ "ÚÈ" , "chen" },
	{ "à¨" , "chuai" },
	{ "Û¡" , "di" },
	{ "ÜÞ" , "fu" },
	{ "¸¦" , "fu" },
	{ "ê½" , "gao" },
	{ "ôÞ" , "gen" },
	{ "¹Ú" , "guan" },
	{ "æ£" , "gui" },
	{ "¹ý" , "guo" },
	{ "êÉ" , "cheng" },
	{ "öÁ" , "juan" },
	{ "·ê" , "pang" },
	{ "Úü" , "pi" },
	{ "ÆÎ" , "pu" },
	{ "äß" , "pu" },
	{ "ØÁ" , "qi" },
	{ "ÉÙ" , "shao" },
	{ "ÕÙ" , "shao" },
	{ "ÕÛ" , "she" },
	{ "Í®" , "tong" },
	{ "âÕ" , "tuo" },
	{ "Íð" , "wan" },
	{ "Î¾" , "wei" },
	{ "Ùþ" , "xian" },
	{ "Ï´" , "xian" },
	{ "Û¨" , "xun" },
	{ "çÛ" , "yao" },
	{ "ÔÇ" , "yun" },
	{ "ã¢" , "yun" },
	{ "Û©" , "yun" },
	{ "Ñò½Ç" , "yangjue" },
	{ "Šu" , "yun" },
	{ "¼À" , "zhai" },
	{ "íÎ" , "zhai" },
	{ "Õ¼" , "zhan" },
	{ "Øë" , "zhang" },
	{ "ÖÐÐÐ" , "zhonghang" },
	{ "ìú" , "zhuo" },
	{ "åÅ" , "ze" },
	{ "ñû" , "qin" },
};


/*
0. ¶àÒô×Ö±í 
1. ºóÃæµÄ×¢ÊÍ±íÊ¾µÄÊÇ£ºÕâ¸ö×ÖÊ£ÓàµÄÆäËû¶ÁÒô £¨ÈÕ¡¢º«·Ö±ð±íÊ¾ºº×ÖÊÇÈÕÓï»òº«Óï£©
2. À´Ô´ÓÚ hanziTables[]£¬£¨±éÀúµÄËùÓÐ£¬Ã»ÓÐÒÅÂ©£©
3. ¶àÒô×ÖÑ¡ÖÐ¶ÁÒô¹æÔò£º
   a. Ñ¡Ôñ³£ÓÃ¶ÁÒô £º
		{ "ºì" , "hong" },      // gong  
		{ "±¡" , "bo" },        // bao
		{ "²ð" , "chai" },      // ca
   b. Ñ¡Ôñ¸ù¾ÝÆ´Òô¿ÉÒÔ²Â³öºº×ÖµÄ¶ÁÒô¡£ÕâÖÖ×Ö´ó¼ÒÖªµÀÊÇ¶àÒô×Ö£¬Èç¹ûÎÒÊä³ö'ju'Äã»ù±¾¿ÉÒÔ²Âµ½ºº×Ö'¾ä'£¬µ«ÊÇÎÒÊä³ö'gou'Äã»¹ÄÜ²Âµ½ºº×ÖÊÇ'¾ä'¾Í...
		{ "¾ä" , "ju" },        // gou
		{ "ÅÔ" , "pang" },      // bang
		{ "¸ø" , "gei" },       // ji
		{ "°¬" , "ai" },        // yi
		{ "´ó" , "da" },        // dai
		{ "ÅÚ" , "pao" },       // bao
   c. Ñ¡ÖÐ·ÇÐÕÊÏ¶ÁÒô
		{ "³ð" , "chou" },      // qiu £¬³ð£º×÷ÐÕÊÏÊ±¶Áqi¨²
		{ "½â" , "jie" },       // xie £¬½â£º×÷ÐÕÊÏÊ±¶Áxi¨¨
		{ "Ôø" , "ceng" },      // zeng£¬Ôø£º×÷ÐÕÊÏÊ±¶Áz¨¥ng
   d. Ñ¡ÖÐÐÕÃûÖÐ±È½Ï¿ÉÄÜ³öÏÖµÄ×Ö,ÏÂÃæµÄÀý×Ó¿ÉÄÜÇ¡ºÃ·ûºÏÆäËûµÄ¹æÔò£¬µ«ÊÇÔÚÎÒÊÖ¶¯É¸Ñ¡¶àÒô×ÖÊ±È·Êµ¿¼ÂÇµ½Õâ·½ÃæµÄÇé¿ö£¬ÒòÎªÓÐÐ©¶àÒô×ÖµÄÆäÖÐÒ»Ð©¶ÁÒô´ú±íµÄÒâÒåÃ÷ÏÔ²»¿ÉÄÜ±»µ±Ãû×ÖÀ´Ê¹ÓÃ£¬ÒòÎªÉ¸Ñ¡Ê±Ã»¼ÇÂ¼£¬ÏÂÃæµÄÀý×Ó¿ÉÄÜ²»ÌùÇÐ
		{ "Ê¢" , "sheng" },     // cheng £¬ Ã¯Ê¢£¨maoSheng£©£¬Ê¢·¹(chengFan)
		{ "Ê¯" , "shi" },       // dan    £¬ ÅËÊ¯ÒÙ
		{ "ñæ" , "jin" },       // qin guan
		{ "Ç¿" , "qiang" },     // jiang , ¼áÇ¿£¨qiang£©£¬¾óÇ¿£¨jiang£©
   e. ÐèÒªÉÏÏÂÎÄÁªÏµµÄ£¬ÕâÖÖ×ÖÃ»·¨ÁË£¬Ö»ÄÜ²é±í£¬ÕâÀïµÄÊä³öÔ­Ôò×ñÑ­£¨abcd£©
		{ "ÆÁ" , "ping" },      // bing £¬ ÆÁÄ»¡¢ÆÁÆú
		{ "²·" , "bu" },        // bo £¬   Õ¼²·¡¢ÂÜ²·
*/
multiToneWordTableS multiToneWordTable[g_length_multiToneWordTable] =
{
	{ "…" , "e" },         // si a
	{ "ß¹" , "ya" },        // a
	{ "°¢" , "a" },         // e
	{ "ºÇ" , "he" },        // ha ke a
	{ "ëç" , "yan" },       // a
	{ "àÄ" , "sha" },       // a
	{ "é^" , "ci" },        // ka lu ai
	{ "ôƒ" , "li" },        // ai
	{ "÷_" , "ai" },        // suo 
	{ "ŠÖ" , "xi" },        // ai
	{ "Ì" , "yi" },        // ai
	{ "šG" , "ei" },        // ai
	{ "°¬" , "ai" },        // yi 
	{ "àÉ" , "yi" },        // ai
	{ "àæ" , "yi" },        // ai
	{ "ðg" , "ai" },        // he 
	{ "³§" , "chang" },     // an
	{ "¹ã" , "guang" },     // an
	{ "••" , "yan" },       // an
	{ "áí" , "han" },       // an
	{ "°·" , "an" },        // e 
	{ "°¹" , "ang" },       // hang 
	{ "…n" , "yang" },      // ang
	{ "Ñö" , "yang" },      // ang
	{ "°¼" , "ao" },        // wa 
	{ "Ïù" , "xiao" },      // ao
	{ "Ø²" , "ao" },        // yao 
	{ "ÞÖ" , "ao" },        // niu 
	{ "æŽ" , "ha" },        // ba
	{ "õ•" , "li" },        // si xi ba
	{ "°È" , "ba" },        // pa 
	{ "æŽ" , "ba" },        // pa
	{ "²®" , "bo" },        // bai  ba
	{ "èË" , "pa" },        // ba
	{ "°È" , "ba" },        // pa
	{ "°Ò" , "pa" },        // ba
	{ "®B" , "bai" },       // wa 
	{ "ƒÄ" , "bai" },       // ke 
	{ "Ä°" , "mo" },        // bai
	{ "°Ø" , "bai" },       // bo 
	{ "°é" , "ban" },       // pan 
	{ "°è" , "ban" },       // pan 
	{ "ˆm" , "pan" },       // ban
	{ "–®" , "pan" },       // ban
	{ "°ò" , "bang" },      // pang 
	{ "ÅÔ" , "pang" },      // bang
	{ "°ö" , "bang" },      // beng 
	{ "—”" , "bang" },      // bei 
	{ "“s" , "bang" },      // peng 
	{ "°õ" , "bang" },      // pang 
	{ "ÅÚ" , "pao" },       // bao
	{ "–¢" , "bao" },       // fu 
	{ "±¡" , "bo" },        // bao
	{ "±¤" , "bao" },       // bu pu 
	{ "ÅÙ" , "pao" },       // bao
	{ "Ðˆ" , "pao" },       // bao
	{ "±©" , "bao" },       // pu 
	{ "ÆÙ" , "pu" },        // bao
	{ "ÆØ" , "bao" },       // pu 
	{ "Úé" , "bei" },       // pi po 
	{ "—À" , "bei" },       // pi 
	{ "ØÃ" , "bei" },       // bo 
	{ "±»" , "bei" },       // pi 
	{ "êÚ" , "ben" },       // bi 
	{ "º»" , "hang" },      // ben
	{ "ÈZ" , "ta" },        // ku lai bi
	{ "ÍŒ" , "bi" },        // e 
	{ "æq" , "bi" },        // pi 
	{ "ßÁ" , "pi" },        // bi
	{ "¹u" , "pai" },       // bi
	{ "ÜÅ" , "bi" },        // pi 
	{ "ÃÚ" , "mi" },        // bi
	{ "ÃØ" , "mi" },        // bi
	{ "ñÔ" , "bi" },        // pi 
	{ "±Ù" , "pi" },        // bi
	{ "î¢" , "pi" },        // bi
	{ "±â" , "bian" },      // pian 
	{ "ñÛ" , "bian" },      // pian 
	{ "±ã" , "bian" },      // pian 
	{ "çÂ" , "bian" },      // pian 
	{ "è¼" , "shao" },      // biao
	{ "æô" , "biao" },      // piao 
	{ "û" , "pao" },       // biao
	{ "çã" , "fen" },       // bin
	{ "éÄ" , "bing" },      // bin
	{ "ÆÁ" , "ping" },      // bing
	{ "ç®" , "geng" },      // bing
	{ "²·" , "bu" },        // bo
	{ "®z" , "da" },        // bo
	{ "²´" , "po" },        // bo
	{ "ÆÇ" , "po" },        // tuo bo
	{ "ÆÒ" , "pu" },        // bu
	{ "²ð" , "chai" },      // ca
	{ "àê" , "ca" },        // cha 
	{ "‚Æ" , "si" },        // cai
	{ "²Î" , "can" },       // cen san shen 
	{ "ºd" , "can" },       // zan 
	{ "²ô" , "chan" },      // shan can
	{ "åî" , "chan" },      // can
	{ "ê°" , "zang" },      // cang
	{ "²Ø" , "cang" },      // zang 
	{ "ªe" , "o" },         // ce
	{ "³€" , "ce" },        // ke o 
	{ "²à" , "ce" },        // ze zhai 
	{ "¹k" , "ce" },        // jia 
	{ "àá" , "cheng" },     // ceng
	{ "Ôø" , "ceng" },      // zeng 
	{ "²î" , "cha" },       // chai ci 
	{ "Ôû" , "zha" },       // cha
	{ "²é" , "cha" },       // zha 
	{ "âª" , "cha" },       // zha 
	{ "é«" , "zha" },       // cha
	{ "é¶" , "cha" },       // zha 
	{ "É²" , "sha" },       // cha
	{ "ßå" , "zha" },       // cha
	{ "²ñ" , "chai" },      // zhai 
	{ "Æ" , "chai" },      // zhi 
	{ "ðû" , "cuo" },       // chai
	{ "µ¥" , "dan" },       // shan chan
	{ "ìø" , "chan" },      // shan 
	{ "³¤" , "chang" },     // zhang 
	{ "ÌÈ" , "tang" },      // chang
	{ "ã®" , "chang" },     // tang 
	{ "´Â" , "chuo" },      // chao
	{ "ìÌ" , "chao" },      // zhuo 
	{ "½Ë" , "chao" },      // jiao 
	{ "³¯" , "chao" },      // zhao 
	{ "ü…" , "zhao" },      // chao
	{ "³°" , "chao" },      // zhao 
	{ "³µ" , "che" },       // ju 
	{ "³ß" , "chi" },       // che
	{ "àÁ" , "chen" },      // tian 
	{ "³Æ" , "cheng" },     // chen
	{ "îõ" , "dang" },      // cheng
	{ "éÌ" , "tang" },      // cheng
	{ "³Ë" , "cheng" },     // sheng 
	{ "Ê¢" , "sheng" },     // cheng
	{ "³Î" , "cheng" },     // deng 
	{ "Ûæ" , "di" },        // chi
	{ "¯€" , "zhi" },       // chi
	{ "Ó¿" , "yong" },      // chong
	{ "³æ" , "chong" },     // hui 
	{ "ÖÖ" , "zhong" },     // chong
	{ "ÖØ" , "zhong" },     // chong
	{ "³ð" , "chou" },      // qiu 
	{ "àü" , "chou" },      // dao 
	{ "–ƒ" , "niu" },       // chou
	{ "³ô" , "chou" },      // xiu 
	{ "Öú" , "zhu" },       // chu
	{ "ñÒ" , "zhu" },       // chuzhe 
	{ "Ðó" , "chu" },       // xu 
	{ "‚m" , "chu" },       // ti 
	{ "œä" , "chu" },       // xu 
	{ "šH" , "xu" },        // chua
	{ "à¨" , "chuo" },      // chuai
	{ "´«" , "chuan" },     // zhuan 
	{ "´®" , "chuan" },     // guan 
	{ "´±" , "zhuang" },    // chuang
	{ "×µ" , "zhui" },      // chui
	{ "åT" , "dchun" },     // ui 
	{ "‹S" , "ruo" },       // chuo
	{ "Üë" , "zi" },        // ci
	{ "×È" , "zi" },        // ci
	{ "ËÅ" , "si" },        // ci
	{ "èÈ" , "cong" },      // zong 
	{ "˜B" , "song" },      // cong
	{ "×ä" , "zu" },        // cu
	{ "È¤" , "qu" },        // cu
	{ "Çˆ" , "zou" },       // cuan
	{ "ÔÜ" , "zan" },       // cuan
	{ "´â" , "cui" },       // sui 
	{ "¶×" , "dun" },       // cun
	{ "àŸ" , "zan" },       // cuo
	{ "ùŒ" , "ku" },        // ta yi da
	{ "àª" , "da" },        // ta 
	{ "í³" , "ta" },        // da
	{ "µ¬" , "dan" },       // da
	{ "´ó" , "da" },        // dai 
	{ "šù" , "tai" },       // da
	{ "ß¾" , "dai" },       // tai 
	{ "ææ" , "dai" },       // tai 
	{ "µ§" , "dan" },       // shan 
	{ "ür" , "dan" },       // zhan 
	{ "Ê¯" , "shi" },       // dan
	{ "µ¯" , "tan" },       // dan
	{ "å£" , "dan" },       // tan 
	{ "h" , "dao" },       // ri 
	{ "ß¶" , "dao" },       // tao 
	{ "ìâ" , "dao" },       // tao 
	{ "µÄ" , "de" },        // di 
	{ "µØ" , "di" },        // de
	{ "µ×" , "di" },        // de
	{ "µÃ" , "de" },        // dei 
	{ "‡N" , "de" },        // dei 
	{ "‡Ã" , "di" },        // mi 
	{ "Ìá" , "ti" },        // di
	{ "µÔ" , "di" },        // zhai 
	{ "Û—" , "di" },        // zhi 
	{ "–m" , "di" },        // duo 
	{ "“W" , "ti" },        // di
	{ "Úç" , "dian" },      // yan 
	{ "µè" , "dian" },      // tian 
	{ "îä" , "dian" },      // tian 
	{ "Äñ" , "niao" },      // diao
	{ "µ÷" , "tiao" },      // zhou diao
	{ "ï¢" , "diao" },      // yao 
	{ "†A" , "die" },       // xi 
	{ "•i" , "die" },       // yi 
	{ "à©" , "die" },       // zha 
	{ "Þé" , "die" },       // she 
	{ "ÏH" , "zhi" },       // die
	{ "¶¡" , "ding" },      // zheng 
	{ "î®" , "ding" },      // ting 
	{ "îú" , "ting" },      // ding
	{ "¶±" , "tong" },      // dong
	{ "Ûí" , "dong" },      // tong 
	{ "¶²" , "dong" },      // tong 
	{ "á¼" , "tong" },      // dong
	{ "¶¼" , "dou" },       // du 
	{ "¶Á" , "du" },        // dou
	{ "äÂ" , "du" },        // dou
	{ "…¶" , "du" },        // ge 
	{ "ê^" , "du" },        // she 
	{ "¶È" , "duo" },       // du
	{ "”¾" , "yi" },        // du
	{ "¶Ø" , "dun" },       // dui
	{ "ïæ" , "dui" },       // dun 
	{ "ãç" , "dun" },       // zhuan 
	{ "¶Ú" , "tun" },       // dun
	{ "˜J" , "dun" },       // shun 
	{ "öV" , "wu" },        // ya duo ji 
	{ "ÍÔ" , "tuo" },       // duo
	{ "¶é" , "duo" },       // hui 
	{ "˜" , "o" },         // e
	{ "”ñ" , "o" },         // si e
	{ "Òk" , "e" },         // ta
	{ "™ë" , "mi" },        // e
	{ "¶ñ" , "e" },         // wu 
	{ "Å¶" , "o" },         // e
	{ "¶ê" , "e" },         // yi 
	{ "ãÕ" , "e" },         // yan 
	{ "—Ò" , "mi" },        // eng
	{ "Äž" , "nao" },       // er
	{ "Ù¦" , "er" },        // nai 
	{ "·¢" , "fa" },        // fei 
	{ "áN" , "fa" },        // po 
	{ "·¬" , "fan" },       // pan 
	{ "ñÈ" , "pan" },       // fan
	{ "·±" , "fan" },       // po 
	{ "·Â" , "fang" },      // pang 
	{ "áÝ" , "pang" },      // fang
	{ "ÜÀ" , "fu" },        // fei
	{ "âö" , "fu" },        // fei
	{ "å" , "fen" },       // pen 
	{ "·ë" , "feng" },      // ping 
	{ "·ð" , "fo" },        // fu 
	{ "·ñ" , "fou" },       // pi 
	{ "Ý³" , "fu" },        // piao 
	{ "‚a" , "mian" },      // fu
	{ "¸¬" , "pu" },        // fu
	{ "f" , "ga" },        // ri 
	{ "„L" , "xi" },        // la  ga
	{ "Ü…" , "ya" },        // ga
	{ "¼Ð" , "jia" },       // ga
	{ "Ù¤" , "ga" },        // jia qie 
	{ "ßÈ" , "xia" },       // ga
	{ "¿§" , "ka" },        // ga
	{ "Ôþ" , "zha" },       // ya  ga
	{ "½æ" , "jie" },       // gai
	{ "¸Ç" , "gai" },       // ge 
	{ "¼é" , "jian" },      // gan
	{ "¸Ð" , "gan" },       // han 
	{ "¸Ó" , "gan" },       // gong 
	{ "¿¸" , "kang" },      // gang
	{ "í°" , "gang" },      // zhuang 
	{ "¸Þ" , "gao" },       // hao 
	{ "Áo" , "mei" },       // gao
	{ "¸ä" , "gao" },       // hao 
	{ "g" , "ge" },        // ri 
	{ "Ž|" , "xi" },        // ge
	{ "†{" , "ge" },        // xi 
	{ "Øî" , "yi" },        // ge
	{ "æü" , "ge" },        // he 
	{ "¿©" , "ge" },        // ka luo 
	{ "¸ï" , "ge" },        // ji 
	{ "Øª" , "ge" },        // li 
	{ "¸ò" , "ge" },        // ha 
	{ "ºÏ" , "he" },        // ge
	{ "íÑ" , "luo" },       // ge
	{ "¸ø" , "gei" },       // ji 
	{ "ßç" , "gen" },       // hen 
	{ "ºì" , "hong" },      // gong
	{ "†y" , "gong" },      // hong 
	{ "¾ä" , "ju" },        // gou
	{ "èÛ" , "gou" },       // ju 
	{ "ßÉ" , "gua" },       // gu
	{ "¼Ò" , "jia" },       // gu
	{ "÷½" , "gu" },        // hu 
	{ "ãé" , "gu" },        // yu 
	{ "¹È" , "gu" },        // yu 
	{ "¿à" , "ku" },        // gu
	{ "¼Ö" , "jia" },       // gu
	{ "ðÀ" , "gu" },        // he hu 
	{ "ØÅ" , "gu" },        // jia 
	{ "¹Í" , "gu" },        // hu 
	{ "èé" , "gua" },       // kuo 
	{ "ÂÚ" , "lun" },       // guan
	{ "ñæ" , "jin" },       // qin guan
	{ "Ý¸" , "guan" },      // wan 
	{ "¹é" , "gui" },       // kui 
	{ "¹ê" , "gui" },       // jun qiu 
	{ "@" , "gui" },       // hui wei 
	{ "öÙ" , "gui" },       // hua xie 
	{ "šð" , "jiu" },       // gui
	{ "êÁ" , "jiong" },     // gui
	{ "È²" , "que" },       // gui
	{ "¹ñ" , "gui" },       // ju 
	{ "èí" , "hui" },       // gui 
	{ "÷¬" , "gui" },       // jue 
	{ "ÎÐ" , "wo" },        // guo
	{ "a" , "ha" },        // ri 
	{ "’C" , "ru" },        // me  ha
	{ "œÂ" , "tu" },        // ha
	{ "‡" , "xi" },        // ha na 
	{ "÷m" , "ta" },        // ha
	{ "Ïº" , "xia" },       // ha
	{ "¿È" , "ke" },        // hai
	{ "àË" , "hai" },       // hei 
	{ "»¹" , "huan" },      // hai
	{ "º¦" , "hai" },       // he 
	{ "¿»" , "kang" },      // hang
	{ "ÐÐ" , "xing" },      // hang heng
	{ "¿Ô" , "keng" },      // hang
	{ "Ïï" , "xiang" },     // hang
	{ "ºÑ" , "he" },        // hao
	{ "ßj" , "he" },        // wo 
	{ "ºÍ" , "he" },        // hu huo 
	{ "ºË" , "he" },        // hu 
	{ "ÏÅ" , "xia" },       // he
	{ "ªn" , "xie" },       // he
	{ "ŸÀ" , "he" },        // kao 
	{ "ºÙ" , "hei" },       // mo 
	{ "Ï·" , "xi" },        // hu hui 
	{ "ÜÌ" , "wu" },        // hu
	{ "ä°" , "hu" },        // xu 
	{ "»£" , "hu" },        // xia 
	{ "—ü" , "ku" },        // hu
	{ "í¹" , "xu" },        // hua
	{ "Û¨" , "xun" },       // huan
	{ "à÷" , "yuan" },      // huan
	{ "‹Ö" , "huan" },      // qiong xuan 
	{ "Ñ£" , "xuan" },      // huan
	{ "ì¿" , "wei" },       // hui
	{ "çõ" , "hun" },       // hui
	{ "î¡" , "hui" },       // sui 
	{ "»á" , "hui" },       // kuai 
	{ "ä«" , "hui" },       // kuai 
	{ "ßÜ" , "yue" },       // hui
	{ "»ç" , "hun" },       // xun 
	{ "Ææ" , "qi" },        // ji
	{ "Æä" , "qi" },        // ji
	{ "¼©" , "ji" },        // qi 
	{ "»ü" , "ji" },        // qi 
	{ "Ø½" , "ji" },        // qi 
	{ "½å" , "ji" },        // jie 
	{ "Æë" , "qi" },        // ji
	{ "Ïµ" , "xi" },        // ji
	{ "Üù" , "ji" },        // qi 
	{ "¼À" , "ji" },        // zhai 
	{ "ÙÊ" , "jie" },       // ji
	{ "†í" , "jia" },       // lun 
	{ "ÇÑ" , "qie" },       // jia
	{ "Ýç" , "jia" },       // xia 
	{ "¼Ù" , "jia" },       // xia 
	{ "¼Û" , "jia" },       // jie 
	{ "Ç³" , "qian" },      // jian
	{ "êù" , "jian" },      // qian 
	{ "àî" , "jian" },      // nan 
	{ "¼û" , "jian" },      // xian 
	{ "¼÷" , "kan" },       // jian
	{ "½«" , "jiang" },     // qiang 
	{ "½µ" , "jiang" },     // xiang 
	{ "Ç¿" , "qiang" },     // jiang
	{ "½¶" , "jiao" },      // qiao 
	{ "áè" , "jiao" },      // yao 
	{ "½À" , "jiao" },      // jue 
	{ "½Ç" , "jiao" },      // jue 
	{ "½Ä" , "jiao" },      // yao 
	{ "½Å" , "jiao" },      // jue 
	{ "äÐ" , "jiu" },       // qiu jiao
	{ "½É" , "jiao" },      // zhuo 
	{ "á½" , "qiao" },      // jiao
	{ "¾õ" , "jiao" },      // jue 
	{ "Ð£" , "xiao" },      // jiao
	{ "¿¬" , "kai" },       // jie
	{ "½Û" , "jie" },       // ju 
	{ "½e" , "xie" },       // jie
	{ "½â" , "jie" },       // xie 
	{ "âÛ" , "jin" },       // qin 
	{ "¾¢" , "jing" },      // jin
	{ "‚Š" , "liang" },     // jing
	{ "ö¦" , "liang" },     // jing
	{ "ÇÒ" , "qie" },       // ju
	{ "ÜÚ" , "ju" },        // zu 
	{ "Çù" , "qu" },        // ju
	{ "ôò" , "qie" },       // ju
	{ "¾×" , "ju" },        // zui 
	{ "»c" , "qu" },        // ju
	{ "ÜÄ" , "ju" },        // qu 
	{ "È¦" , "quan" },      // juan
	{ "¾í" , "juan" },      // quan 
	{ "Ûm" , "quan" },      // juan
	{ "öÁ" , "jun" },       // juan
	{ "ãÚ" , "que" },       // jue
	{ "àå" , "xue" },       // jue
	{ "óÞ" , "jun" },       // yun 
	{ "÷å" , "qun" },       // jun
	{ "¿£" , "jun" },       // xun 
	{ "Ÿa" , "jun" },       // qu 
	{ "„J" , "ka" },        // yi 
	{ "ÑQ" , "ka" },        // mi mo xi ÈÕ
	{ "Âˆ" , "li" },        // xi ka
	{ "õ–" , "ke" },        // nou zi ka
	{ "ù‹" , "si" },        // yi ka
	{ "¿¨" , "ka" },        // qia 
	{ "…ž" , "mu" },        // wu ke
	{ "Þ‘" , "o" },         // pi ke
	{ "·i" , "o" },         // ke
	{ "¿Ç" , "ke" },        // qiao 
	{ "Úó" , "wei" },       // kui
	{ "õu" , "luo" },       // la
	{ "Âä" , "luo" },       // lao  la
	{ "À°" , "la" },        // xi 
	{ "À¯" , "la" },        // zha 
	{ "ñ®" , "lai" },       // la
	{ "Ý¹" , "liang" },     // lang
	{ "ÁÊ" , "liao" },      // lao
	{ "ÀÑ" , "lao" },       // mu 
	{ "â²" , "liao" },      // lao
	{ "Âç" , "luo" },       // lao
	{ "ÀÓ" , "lao" },       // luo 
	{ "–Y" , "te" },        // wu le
	{ "˜V" , "mu" },        // le
	{ "Àß" , "lei" },       // le
	{ "ÀÖ" , "yue" },       // le
	{ "ÀÕ" , "lei" },       // le
	{ "äð" , "luo" },       // ta lei
	{ "Àâ" , "leng" },      // ling 
	{ "®M" , "li" },        // wa 
	{ "ó»" , "li" },        // luo 
	{ "èÝ" , "li" },        // yue 
	{ "õÈ" , "li" },        // luo 
	{ "Á©" , "liang" },     // lia
	{ "ïf" , "liu" },       // liao
	{ "Þ¤" , "liao" },      // lu 
	{ "’£" , "lie" },       // ri 
	{ "Áù" , "liu" },       // lu 
	{ "Â½" , "lu" },        // liu
	{ "Âµ" , "lu" },        // liu
	{ "ãñ" , "long" },      // shuang 
	{ "Åª" , "nong" },      // long
	{ "ÙÍ" , "lou" },       // lv 
	{ "Â¶" , "lu" },        // lou
	{ "ÂÌ" , "lv" },        // lu 
	{ "ÞÛ" , "luo" },       // lv
	{ "ÂÊ" , "shuai" },     // lv
	{ "…Þ" , "m" },         // mou 
	{ "Ä·" , "mu" },        // m
	{ "†x" , "si" },        // ma
	{ "ô" , "na" },        // zi ma ÈÕ
	{ "ŒI" , "zi" },        // ma
	{ "Ä¨" , "mo" },        // ma
	{ "Ä¦" , "mo" },        // ma
	{ "Âñ" , "mai" },       // man 
	{ "Âö" , "mai" },       // mo 
	{ "Âû" , "wan" },       // man
	{ "Œ´" , "meng" },      // mang
	{ "Ã¥" , "mang" },      // meng 
	{ "Ã°" , "mao" },       // mo 
	{ "W" , "shi" },       // me ÈÕ
	{ "„õ" , "mo" },        // ne me ÈÕ
	{ "Ã»" , "mei" },       // mo 
	{ "ÃÓ" , "mi" },        // mei
	{ "ÃÕ" , "mi" },        // mei
	{ "ãë" , "wen" },       // men
	{ "" , "wei" },       // men
	{ "ö¼" , "min" },       // meng
	{ "ü“" , "ne" },        // zu mi ÈÕ
	{ "Éq" , "ming" },      // mi
	{ "Ãâ" , "mian" },      // wen 
	{ "äÅ" , "mian" },      // sheng 
	{ "çÑ" , "miu" },       // mou miao
	{ "Ø¿" , "mie" },       // nie 
	{ "C" , "ne" },        // o ye mo
	{ "i" , "ri" },        // mo º«
	{ "ÎÞ" , "wu" },        // mo
	{ "Ä£" , "mo" },        // mu 
	{ "Íò" , "wan" },       // mo
	{ "Äª" , "mo" },        // mu 
	{ "Íà" , "wa" },        // mo
	{ "Ä²" , "mou" },       // mu 
	{ "ÄÇ" , "na" },        // ne nei nuo 
	{ "ÄÏ" , "nan" },       // na
	{ "ÄÄ" , "na" },        // nai ne nei 
	{ "ÄÚ" , "nei" },       // na
	{ "ÄÅ" , "na" },        // ne 
	{ "ÄÈ" , "na" },        // nuo 
	{ "Üµ" , "nai" },       // reng 
	{ "ßÎ" , "nao" },       // nu 
	{ "¿L" , "o" },         // se ne
	{ "ßí" , "wu" },        // ng
	{ "†R" , "po" },        // pu ni
	{ "øM" , "o" },         // ni ÈÕ
	{ "Äç" , "ni" },        // niao 
	{ "áÚ" , "yi" },        // ni 
	{ "Õ³" , "zhan" },      // nian
	{ "Äí" , "nian" },      // nie 
	{ "Õ·" , "zhan" },      // nian
	{ "Äò" , "niao" },      // sui 
	{ "Äþ" , "ning" },      // zhu 
	{ "Ç‚" , "xi" },        // nu º«
	{ "ßö" , "nuo" },       // re 
	{ "Å±" , "nve" },       // yao 
	{ "Çø" , "qu" },        // ou 
	{ "Ž‡" , "xi" },        // pa º«
	{ "ÅÉ" , "pai" },       // pa
	{ "êC" , "ying" },      // pai º«
	{ "ÆÈ" , "po" },        // pai
	{ "ÅÖ" , "pang" },      // pan
	{ "ÞÕ" , "pin" },       // pan
	{ "†Ô" , "xi" },        // pao º«
	{ "ÆÓ" , "pu" },        // po  piao
	{ "æ³" , "pin" },       // ping 
	{ "n" , "po" },        // ri º« 
	{ "ÆÜ" , "qi" },        // xi 
	{ "Ûp" , "qi" },        // yi 
	{ "õè" , "qi" },        // xi 
	{ "Ûß" , "qi" },        // yin 
	{ "Ù¹" , "si" },        // qi
	{ "ôì" , "qing" },      // qi
	{ "Æõ" , "qi" },        // xie 
	{ "Æö" , "qie" },       // qi
	{ "Ç¦" , "qian" },      // yan 
	{ "†é" , "xian" },      // qian
	{ "Ý¡" , "qian" },      // xun 
	{ "Á{" , "xian" },      // qian
	{ "ÏË" , "xian" },      // qian
	{ "Üç" , "xi" },        // qian
	{ "Ù»" , "qian" },      // qing 
	{ "ã»" , "qie" },       // qian
	{ "È¸" , "que" },       // qiao
	{ "ÇÊ" , "qiao" },      // shao 
	{ "Ç×" , "qin" },       // qing 
	{ "ñû" , "tan" },       // qin
	{ "äÚ" , "qin" },       // zhen 
	{ "öë" , "qing" },      // zheng 
	{ "òø" , "qiu" },       // you 
	{ "È¯" , "quan" },      // xuan 
	{ "ÉÖ" , "shao" },      // que
	{ "Üé" , "yao" },       // rao
	{ "Èô" , "ruo" },       // re
	{ "ÝØ" , "shen" },      // ren
	{ "u" , "za" },        // ri º«
	{ "t" , "zu" },        // ri º«
	{ "r" , "sao" },       // ri º«
	{ "èc" , "ya" },        // ri ÈÕ
	{ "Ìƒ" , "sa" },        // ri º«
	{ "’P" , "te" },        // sa ÈÕ
	{ "Æj" , "su" },        // sa ÈÕ
	{ "–Ó" , "ying" },      // sa º«
	{ "“—" , "sa" },        // sha 
	{ "Ë¼" , "si" },        // sai
	{ "Èû" , "sai" },       // se 
	{ "ôÖ" , "shen" },      // san
	{ "Ôï" , "zao" },       // sao
	{ "É«" , "se" },        // shai 
	{ "É¼" , "shan" },      // sha
	{ "É¯" , "sha" },       // suo 
	{ "êý" , "sha" },       // suo 
	{ "Ò­" , "ye" },        // sha
	{ "ÉÝ" , "she" },       // sha
	{ "†—" , "ti" },        // sha
	{ "ÏÃ" , "xia" },       // sha
	{ "õ§" , "shi" },       // shai
	{ "Õ¤" , "shan" },      // zha 
	{ "Øß" , "yan" },       // shan
	{ "ÌÀ" , "tang" },      // shang
	{ "òÙ" , "xiao" },      // shao
	{ "Üæ" , "shao" },      // tiao 
	{ "®Œ" , "she" },       // yu 
	{ "ÕÛ" , "zhe" },       // she
	{ "Éß" , "she" },       // yi 
	{ "Ò¶" , "ye" },        // xie she
	{ "Ê°" , "shi" },       // she
	{ "ì¨" , "she" },       // xi 
	{ "Ë­" , "shui" },      // shei
	{ "»]" , "shi" },       // shen ÈÕ
	{ "Ý·" , "shen" },      // xin 
	{ "Ê²" , "shen" },      // shi 
	{ "é©" , "shen" },      // zhen 
	{ " õ" , "sheng" },     // xing 
	{ "Ê¡" , "sheng" },     // xing 
	{ "Ðê" , "xu" },        // shi
	{ "Ê¶" , "shi" },       // zhi 
	{ "Ê³" , "shi" },       // si yi 
	{ "ÊÏ" , "shi" },       // zhi 
	{ "ËÆ" , "si" },        // shi
	{ "ÖÅ" , "zhi" },       // shi
	{ "ó§" , "shi" },       // zhe 
	{ "Êì" , "shu" },       // shou
	{ "Ý±" , "tu" },        // shu
	{ "Êô" , "shu" },       // zhu 
	{ "Êõ" , "shu" },       // zhu 
	{ "Êü" , "shu" },       // zhu 
	{ "Ëµ" , "shuo" },      // tuo yue shui
	{ "âì" , "song" },      // zhong 
	{ "ËÞ" , "su" },        // xiu 
	{ "Ëõ" , "suo" },       // su
	{ " [" , "tui" },       // ta ÈÕ
	{ "ÍØ" , "tuo" },       // ta
	{ "Ì¶" , "tan" },       // xun 
	{ "ÌÕ" , "tao" },       // yao 
	{ "À’" , "yo" },        // zhao te ÈÕ
	{ "ß¯" , "tui" },       // te
	{ "”`" , "ti" },        // zhi 
	{ "Üè" , "yi" },        // ti
	{ "ñÓ" , "xi" },        // ti
	{ "Ù×" , "tong" },      // zhuang 
	{ "‚M" , "tuo" },       // tui
	{ "ÍÊ" , "tui" },       // tun 
	{ "ÍÍ" , "tun" },       // zhun 
	{ "áË" , "wei" },       // wai
	{ "ÝÒ" , "wan" },       // yu 
	{ "ÞÌ" , "you" },       // wang
	{ "Íö" , "wang" },      // wu 
	{ "Û×" , "wei" },       // xu 
	{ "Î²" , "wei" },       // yi 
	{ "Î¾" , "wei" },       // yu 
	{ "ÒÅ" , "yi" },        // wei
	{ "Îµ" , "wei" },       // yu 
	{ "ÎÎ" , "wo" },        // zhua 
	{ "›ð" , "wan" },       // yuan wo 
	{ "ì¶" , "yu" },        // wu
	{ "èž" , "wu" },        // yu 
	{ "‰ñ" , "yi" },        // xi º«
	{ "³’" , "ze" },        // xi º«
	{ "ñÞ" , "zhe" },       // xi
	{ "Ï´" , "xi" },        // xian 
	{ "Ï³" , "xi" },        // xian 
	{ "ÏØ" , "xian" },      // xuan 
	{ "Ï÷" , "xiao" },      // xue 
	{ "Ð°" , "xie" },        // ye 
	{ "Üþ" , "ying" },       // xing
	{ "Ñ„" , "you" },        // xiu
	{ "Óõ" , "yu" },         // xu 
	{ "Æ^" , "zhu" },        // xu
	{ "ñ¿" , "yin" },        // xun
	{ "Ñá" , "yan" },        // ya
	{ "ÑÊ" , "yan" },        // ye 
	{ "Òó" , "yin" },        // yan
	{ "Ü¾" , "yuan" },       // yan
	{ "Ô¼" , "yue" },        // yao
	{ "ôí" , "yao" },        // you zhou 
	{ "Ô¿" , "yao" },        // yue 
	{ "×§" , "zhuai" },      // ye
	{ "Óý" , "yu" },         // yo
	{ "à¯" , "yong" },       // yu 
	{ "èÖ" , "you" },        // zhu 
	{ "Öà" , "zhou" },       // yu
	{ "ìÙ" , "yun" },        // yu
	{ "Ô±" , "yuan" },       // yun 
	{ "Ôú" , "zha" },        // za
	{ "ÞÙ" , "zan" },        // za
	{ "‡Ô" , "za" },         // zan 
	{ "Õ¦" , "za" },         // ze zha 
	{ "çÞ" , "zai" },        // zi 
	{ "×Ð" , "zi" },         // zai
	{ "ÞÊ" , "zang" },       // zhuang 
	{ "Ôð" , "ze" },         // zhai 
	{ "Ôñ" , "ze" },         // zhai 
	{ "×Û" , "zong" },       // zeng
	{ "×Å" , "zhuo" },       // zhao
	{ "ßú" , "zhou" },       // zhao
	{ "×¦" , "zhua" },       // zhao
	{ "Õâ" , "zhe" },        // zhei 
	{ "Ö¨" , "zhi" },        // zi 
	{ "×£" , "zhu" },        // zhou
	{ "õî" , "zhuo" },       // zhu
	{ "×ª" , "zhuan" },      // zhuai
	{ "×¬" , "zhuan" },      // zuan 
	{ "ºe" , "zuan" },       // zhuan
	{ "õþ" , "zui" },        // zi

	{ "öÑ","ba" },           // bo 
	{ "þx","pa" },           // ba
	{ "°â","ban" },          // pan 
	{ "°ã","ban" },          // bo pan 
	{ "°þ","bao" },          // bo 
	{ "õÀ","bao" },          // bo 
	{ "Þ¬","fan" },          // bo
	{ "þA","gu" },           // hu 
	{ "èì","heng" },         // hang
	{ "çñ","heng" },         // hang
	{ "ÑÀ","ya" },           // he
	{ "þe","song" },         // yu 
	{ "àÜ","zuo" },          // chuai
	{ "´é","cuo" },          // zuo 
	{ "óÐ","zuo" },          // ze
	{ "×Á","zhuo" },         // zuo 
};


/*
0. ºº×ÖÆ´Òô±í£¬À´Ô´ÓÚ http://xh.5156edu.com/pinyi.html £¨ÐèÒª×Ô¼º»ñÈ¡Êý¾Ý£©
1. ÔÚ'bo'Ìí¼Ó'²·' ; 'de'Ìí¼Ó'µÄ' ; 'wan'Ìí¼Ó'›ð' £¨»ñÈ¡µ½µÄÊý¾ÝÓÐÈ±Ê§£¬ÊÇÍøÕ¾µÄÎÊÌâ£¬ÕâÀïÖ±½Ó²¹È«£©
2. ¨¹ ÓÃ v ´úÌæ
*/
hanziTableS hanziTables[g_length_hanziTables] =
{
{ "a","a","ß¹°¢ºÇ°¡ëçï¹åHàÄ…" },
{ "a","ao","°¼–À—`ÝE°¾ n°½…ëJÊTåÛâÚà»†õª‡åEéá“³­H´xòüñú°¿ÂKÖ’Ö“÷¡ÂOÏù÷éúqö—üÜ³Ø²Æb’jÞÖ°ÀéOæÁ‹‹Ò\á®CˆÛê°ÁŠS°ÂŠWæñ‹®‘R°Ã‰¥°ÄŽS“ýöËòˆÁ÷`" },
{ "a","ang","°¹óa…nÑöŒì°º•n–‹°»ál" },
{ "a","ai","°¥°§ÚÀ°¦ŠÖ°¤°£œâàÈïÍæXÞß°¨†ƒùœÜ”±”²‡B°}°©òIÌš±•lšGŠâ°«°ªÜt‡†žGÌ@×cö°ì\°¬êi´°®íÁ³v°¯àÉæÈ‰a°­Û…¥êÓè¨ƒvàæ‰¹‘°‹ÜËBøðg­a•á‘¹°Š²}ñLµK×rèPìaé^ôƒþH÷_÷o" },
{ "a","an","³§¹ã°²ó^èñ°±âÖ‚¹ÚÏÈCÈsÈ€‹jÄW¯uðÆÕYÉŽ°°ì”ÖO±QñKõc±Vùgù“í«q†±ëˆƒ‡ˆ°³††Ûûï§••ÞîÁOä@Œßáí°¶°´›¡ÇI°·Øt°¸‹Fë@ˆÝ°µØåBéœ÷ö" },

{ "b","bai","’“êþ°× Û°Ù²®°ÛÄ°°Ø–àÞã½]°Ú”[ÒoŽßßÂ’…°Ü°Ý”¡ªW°Þ»ŸËbÙ”ív®B¸q»“ƒÄ" },
{ "b","ba","R°Ë”°Í°È–[«X°Éá±’U°ÅŠB°Ì–ÂášÍMôÎ°Ê°Æ†^ÁjØ^÷„…©ÜØŠ‚°ÎžßÃ_°jÝÃÝRÔy°ÏïT÷Éü–°ÑîÙâZ°Ð²®y°Ó°ÖèËˆ¢°Õ°ÒÚ•öÑÁTõEþxÒ†³Fþw°Ô‰Îå±™ñ’iæŽõ•" },
{ "b","ban","°âÃR”‘°à°ã°ä°ß”Ê°áîCøXñ£ÎŒÑ—ñ­ÞnÚæŒêÛà°å°æ•L­šîÓ»{ô²âkÎZô‘é›°ì°ë°é°ç°èŠ”°íˆmE–®¶t½Oœ°ã[ì‡Þk°êÎ†" },
{ "b","bang","°î°ïˆ °ð’Êäºß™Ž°ŽÀ¿RŽÍíD°ó½‰°ñ ¥°ò«g’²ÅÔ°ö°ô—”°ø°ùÝò“s‰Y¶œÎM°÷°õÅÖræ^" },
{ "b","bao","Ùè°ü°úæßÅÚ–¢°û°þ„ƒ¸öµìÒÑf°ýÊ}ÒJé–ý_·‘±¢±¡±¦±¥Að±±£Œp«’Ýá±¤ˆç‹~Œ‡ï–ï’ñÙñhøRød¾‹Ù…Œ—Œšìd„ôÅÙ±¨±§è˜±ªõÀÍdÇ˜ÐˆˆóãE±«óbóŽ±©Ì™õU•Þƒ˜ÆÙ±¬ ÝÆØÞètÜË" },
{ "b","ben","±¼›yêÚ Äï¼åQ±¾±½ŠMÛÎÁ—ñº»ÛÐ‚–ßG—L±¿’Ùœ`“à" },
{ "b","bei","Úé±°±­–È±³° —G—À“d±¯ðÇ±®Ëùl±±ãm±´±·ØÃÚýØ ´•KÆp±¸àT±µ±»±¶‚pªNã£—f‚³‚Ëàf¬D¬i±¹ÝK‚äƒF—”±²±ºÝíÍ“íÕÊ¶F ÍñØÕRì‹ócä^Ý…¼L‘v÷¹öÍ†h" },
{ "b","beng","ÈµpŠR±À±Áéa½l¯nÐàÔ¾X¿‡±Â®gˆ©ˆÈÈE¬e¬aìž±Å±Ã°ößJ“g‰lê´éG±Äça" },
{ "b","bi","°nŒÂ‚¿±ÆšÈ—é˜[ØPùSÎ“÷”æqösÝ©±ÇØ°±È–a‰ýßÁåþ›aÓ¯H±Ëš·–©ïõ±Ê»zô°ÙÂ†ž¹P±É¹uÂØ„±Ò±Ø±Ï±Õ±ÓØ×ÜÅß›ÞˆfPWÆƒŠŒ…ñÃÚî¯®nßÙÜê±ÝêÚ±Ñ–Ä«¯RÃØîé±Ðáù®…Ð‹»¸“é]é[æ¾âØÝÉÈ]—a±ÖÚPˆãÏã¹°zµ–åöŒœ ÔvóÙÙSÙCÍšñÔ±ÙõÏésïãGääœü†ô’±ÍÉœÄbî¢²D±Ô¯wŸ•ŸÎ±Ì±Î±×àŠªŒŽÅ¾aóë¹vñEóñƒÒKŽÆ§ÁXª‹±ÚYæÔ±ÜÞµó÷º`¿oÓvõIÛ‹÷Âå¨”À±ÛŠ`ç@ð{àˆèµÀVÒgôÅíSôxí{ÜLÜKòúzèEÚF–Cú‡ü„ÈZÍŒ‹ï" },
{ "b","bian","±ßž×í¾óÖÈq±àªpìÔ ¤®K¹òù¼D¾Žì™æQöýª ß„ß…±Þöcöb»e±á±âñ¹ØÒÙHÆñÛ·HíÜøuËx±åÛÍ’\›MãêÜÐáŠâí«f±ä‰ä•c±ãÒŒÌ±éçÂ“OérÞgÕ—¾œÅŒ±æ±çÞl±èÞpÞq×ƒO" },
{ "b","biao","è¼±êì©óT÷Ô±ëœWªYÃ ïRœý“¿æôÊEŽ¼‰wû˜ËŸÏ±ìïÚñ¦´‚ì­ì®ƒšï[Ö€Ë‘žd gçSÙ™ÅA·…ïðïjïkïlïnèsóQ‹›±íæ»ñÑÕ•ålÒF™~‚l÷§ä‰" },
{ "b","bie","±ï±ñÏh±î°T÷Mü‚Ì‹ý–±ð„eÇaÍrÖÒXõ¿•" },
{ "b","bin","ß“çã±ö±ò—€—ÃÙÏ±ó±õçÍÙeÙfØhéÄ¬žïÙƒ†±ôîláÙžIžMÌž­p™‰žlìEÀ_Ï™è\î ±÷éëë÷ó‰ó”Pš›Äœ÷Æ÷ÞóxôW" },
{ "b","bing","Ùû•šê²¢±ù±øÆÁ–Þ’òéÄ±ûÚûêvÆuT’m±ü•\•m±þ±ú±ýç®±}Ís‚§Œ}—ŠâÙ÷·AãuïžðVí@ŽÕKãŽð‚v–â¸p²¡·’‚ìÞðÕ@õmìhˆ—ì" },
{ "b","bo","²·°h°i²¨²¦²£âÄ²§±C³j†\°þ°ãõÀÀ¼žÑC²¤à£œÀ´Bã\öÑƒ`Þ¬ó²¥“ÜðGµRÜ@ò’÷Q²®²µØÃÃJ­“²´ þ²¯àR²ª‚NÃ`°ØÑB­”¶zîà²¬›Â’©ÙñÈ`œ_²±ÑJ²°ð¾²³È•²©ªtñAö²«â“ãK÷ˆÆÇñCñgÅ‡²­ ¦Ÿ¹²²ƒkéDõÛäcñFñ•õN±¡ÖcÒUº~ðoùPæn‡¥‘Åómóp¼\Òq™Øíçè}õËô¤ŒXéÞë¢×LÌY®zÊN" },
{ "b","bu","åÍŽïmîßêÎâ˜ÕcðJåqøGÞKõ³²·ß²²¹²¸²¶±¤ÑaùLûQ²»²¼…ÄÑ²½šhši²À…ùîÐ–¿‹²¿„Ï’ÃÆÒˆ¶Ç[²ºê³âbÉžEÛYà^ðXº^²¾Ž~" },

{ "c","ca","²ð²Á”càêíåµgßnk" },
{ "c","cai","‚Æ²Â²Å²Æ²ÄØ”²ÃÀuš¶²É‚š†’ŒuŠé²Ê’ñˆÆ—²ÇÛP¾Z²ÈŒq²Ë²Ì¿n" },
{ "c","can","²Î…¢…£æîï{œ’…¤†Ð‚ð‹Û²Íò‰²Ð²Ï²Ñšˆ‘MÎ]‘LÐTÐQ²Ò•ü‘Kþp‘”·_ºd÷õüo²Ó²ôåîôÓËLÓ Nè²Öƒ… |" },
{ "c","cang","þX²Ö¨Ø÷²Ô²×û]²Õ‚}‚áƒûœæÉnªÈÏ@Å“úIê°²Øè†Ù‰žP" },
{ "c","cao","“Ù²Ù²Ú•ù²ÜÉ˜àÐæäî‘F²ÛÒGó©ô½ç[ÆH²Ýó‘¨òxÃHà“Ò_ü" },
{ "c","ce","‰÷²áƒÔ²à²ÞÇR’‘²ââü”˜»¸žÈY…‹‚ÈÈm²ßœyŽúÅ¹k¹ZÉƒ¹‹‘Šºuªe³€" },
{ "c","cen","²Îßá¯ä¹ˆ¨¸’—q" },
{ "c","ceng","àá²ãÔøŒÓò¸}òš²ä" },
{ "c","cha","²æ’Q’Kè¾Åa²î’·‚²âÇ²å“c†âÔûïÊ²êã˜Å‘®›àêåšðl²ç²èˆ“²é–Ë¶gâª¿²ëìxÔˆé«é¶²ìéßñÃÛ‚ïïèdŠgãâ²íÉ²÷²ï„xæ±ßå¼pÔŒ" },
{ "c","chai","ÆOÃPîÎ²ð²îâO åÙ­²ñ²òµ}†¶ƒŠÆò²ÓÐƒðûÏŠ‡Ð" },
{ "c","chan","Þ{êè—{²ô²óÒ—Ñg“½äiŽÊÒb”vÆgµ¥²÷æ¿²öœµåî—ìøŸž²ø²õª†ƒ]ÕSäaƒ{âÜ‹Èäý¨¿Cå¤´vàšÏMš´Ïsžeàžƒ§ó¸„­‰Ê‡ÁžŽf™ÙÀpÀsõðéKÆB×‹èð’²ú„i•CP”â›º„}ÚÆ²û²ù®a®bÝÛ„•“˜IÊrŽÂÕ~éˆæöŸíºoÙæápÀAçPÖêU‡Ïž¬×€âã³ƒ“·‘Ï²ü‘Ôåñí]î" },
{ "c","chang","Øö²ý³«‚tÝÅãÑæ½²þœC¬dè Ñmå_é‹öðöKü³¤Ÿ ³¡ƒ¸³¦ÜÉéMéL³¢ÌÈ³¥ÈOáä³£®DˆöÄc®^ÉÑ‰jæÏ‡LÄq¬ ‡Ÿƒ”÷•÷l³§êÆã®³¨…”ƒYSë©äâê«`³©ÛË³ªŸ…•³®˜Õkío—ÇÏ^" },
{ "c","che","³µ¼Ü‡‚eíºÇp†q³ŒÍ’³ß³¶‚®“Ýåø³¹ÞŠÛåŸEÂs³³¸îJ³·³ºØ²u„ï …" },
{ "c","chao","³³³­€â÷™ù³®´ÂÔN³¬ânìÌ½Ë¸S ŸêË³²Žz³¯ü…à}R³±˜È³°¸JÁVü{ÞCÖš³´±|ŸqŸ·ûžŽlž£ñéÓe" },
{ "c","chen","ÞÓ³»’×—²è¡àÁ¾DÙoÕ€²_Ön³¾³¼³½³À³Á³ÂÞÆÇ_Çkå·ê–×—FÚÈÔHÜ•”³¿â\×Ÿ‹Êc˜¹‰m”´¯„ëÖRÏIËlû‰•æúmÚ’³•í×‰}‰öÛ{´~åŒÙ•³Ä¯M³Æö³³ÃÚfé´ýYýZƒ¡Úß‡¸™ÂÒr×ŸG" },
{ "c","cheng","êp›„ èß—¢³Æ³Ó›Õ¬b‚ îõ³òÉ•˜ ªÚWìl‘r·Q“£³Å“ÎàáéÌ¿BîdÚXîª˜û™f¸VÀ˜Ï|·çpç•ð‰Ø©³É–b³ÊàJ³ÏèÇ³ÐÇ^ŒkŠ¿w›“³Ç\³ËÛô’¬¬A«ž·œ’ÞÃ”îñÊ¢³Ì“ZˆáñÎ½†¹f³Í—¼—–Õ\ëó‰SœËõ¨ä…®—³Î¯‘~³È™ržj‘Íòr‚D»³Ñ³Ò‘Žñ±òGõ“" },
{ "c","chi","³ÔŠw«ßêÃqð·ò¿»Œó×í÷®E†ËÔW½‚àÍæÊ“¤³Õ²lš“‡iÕvó¤ø|ùA÷Î°Výc”~¯ü[³Ú³Û³Ø³ÙÞ‹ÜÝÛæ¸‡ÇK³Ö³×ÍhÚdÙPßW¹MßgñY¹}Ü¯kßtõØóøå~Ös³ß…µÀ…ÕÃL³Ý³Þ…qˆ‰ÃnÍN³ÜuôùÑEšnšIÑDÑlãrýXñÝáÜß³³â–o³àâÁžÃ’xø„Èp³ã„Ð³áÁ‹ë·ŸUœ‰à´ï†ë†ÙÑÄS¯vãMã‰Â@¯€ßo‘yñ¡‘JÂBŸëÚ†‘´ùúuüJ" },
{ "c","chong","³å³ä›_âçÜûÓ¿›Ò«–Áˆô©†ü“›ã¿Ðn‘oÁZô¾ÛŒ³æÖÖÖØê™³çƒrÑ~Îu¾…Ïx ‚³èˆÃŒ™ï¥“_ã|" },
{ "c","chou","³éþr¼—“oºNñ¬ ß â³ðÙ±àü–äÇ“³ñã°½[—¹³ë³î°{³í³ïÔ—³êáOÑn³ì¾Iëlƒ‰Ëg‘ÀŽÎ‹á™„ böÅ® »Iá~ÜP×‡×‰ë|³óE…Á–ƒ–„‚¸³òáh²ƒô{³ôÅWßcšŽõ\" },
{ "c","chua","šH" },
{ "c","chu","³öŒç³õ“¹éËØŒýiÛ»´¦Öú³ýÆc³øÉZØa³ü³ú³ûãIÚnÉe‹ƒòÜÂa ËäzºXN³÷™ŸŽÐ³ùërõé™»úRÜXèÆ´¡ÌŽ—Æèú´¢µ—³þñÒéƒ¦™sµAýsýƒØ¡„I¸aØXç©âð›{¸e™úÐó‚m”™ˆÇ½I¬G‚âàsœä´¤´¥ézÕ‘ƒ‡bãÀ”ß÷íÄ•šbÓ|´£˜Z­lÏ{" },
{ "c","chuan","çÝ´¨ë°´©¬´«ô­Åx´¬„”å×´ª‚÷•Äº@ÝŽâ¶ÇF´­šNƒbÛwšö«[´®îËâAªkÙiúE" },
{ "c","chuang","„V´´´¯·™´° ¡“œ §¯¸R´² —´±‡l´³‚ü´}êJâë„k„y„€„“í" },
{ "c","chuai","´§ÞõÄuþŽà¨àÜþŒëúõß" },
{ "c","chui","´µ´¶ý—´¹ˆ§Úï‚…–ûÇ”´·“€é¢×µ‡ùÄD´¸é³¹ŠåNæmîq" },
{ "c","chun","•I–~´ºÈN‹a‰@´»˜‡•«¬tòí¹—Ý˜êþ”™šùœöj´¿êÝ»´½›Ì¼ƒÃ‹´¾œ· ÆðÈœ÷ÉOÉ”_´¼ácåTù‡õž‚¤ÈoÃ²QÙƒ´À" },
{ "c","cong","´ÒÜÊ´Ñ‡èòÆ‰èÈS•—Œ´Ð˜BÊ[Éæõ^Â‡´ÏÂŒŸÐœ˜º˜Ú•¾­Bè®²jÏZÂ”ºbæCÀSçWçEò^ò‹´Ó´Ô¿¾ÄÀŠæäÈ›ŒQçý|YÙzÙ{ÕpåS˜âËq…²žš™ß ß‘mÖ" },
{ "c","ci","´Ì²îßÚ«u´ÃÚe‚½Úód¿WóqÏ…ý€´Ê«yÜë´Äˆˆ–²ìô×È´ÉÞeÔ~´Ç´È®NðË´Å´Æð@ï“ôÙÞiËF‹ãžBøyµQÞoú]ú\´ËÕ›°rõJ–c´ÎËÅè„pŽãÆ˜–æÇ„´ÍÍy½aÙnÎˆé^" },
{ "c","chuo","ßOÚ}õÖ´Á¿žåÁÞu†dŠÆŠÅ‹S‹Cà¨›í´Â·ê¡áQÛU¾bÝzöº“óðU´‡šf‡Çýpèq" },
{ "c","cu","I´ÖÓcû€û‚™[û›áÞéã×ä´ÙÃâ§õ¡‹{¯|ÝýÚuÕK´×‘–È¤Ûq‡m¯•Û€¿q´Øüyõ¾õíÜAî•" },
{ "c","cou","´Õœê£é¨ëíÝ" },
{ "c","cun","ß—´åñåÛZ´‰–¸€Ä~´æü’Ž¶×„Yââ´ç»v" },
{ "c","cuan","Ùàß¥ïé´Ú”xÜfè‰ÇˆÔÜ™«Žm™ç·‰´Üš–Ÿä´Ûºx¸Zìà" },
{ "c","cui","´ÞÃœÅƒþ´ßÀŠ‰…‘NéÁª‰´Ý˜§´…¿\çJyè­Ú~°„ºõ¯Q´àÃy‚y»‚¼ÁŒÝÍßý†Ÿ´ãã²Ÿnë¥¬X´á´ä¾\´âÄ‹Äƒ¸WÒPûîxÄ›" },
{ "c","cuo","´êßu¬›´è´éáiõãæ\Ì‘áÏÕ±‘ðîÉcïóÊPðûõºàŸûzëâ„v„zÇsÇuØÈ´ì‰è´ëßHï±´íÉxäSåe" },

{ "d","da","…ößÕÞÇ¸—´ðàª´îñ×“Ò‰¡‡}æpæ]´ò´ïÞ…Þ‡Þ‰âò…ìæ§í³ÇQÇEžØÁe®}®†µ¬…A„‘ßQóÎÔzß_ÛQ÷°´ñËR÷²ÏƒèNí^ý‘ý“´ó‡šùˆ™±o®zÀJÜJùŒ" },
{ "d","dang","µ±«šñÉîõ¹Y®”ƒ}‡ŽÇ­cÒdÏ}Å™ºšèKêWµ²µ³ÚÔ“õ×[üh”†žª™é×•šëÛÊˆWå´í¸µ´ˆ›µµÝÐ‹PßTÕ®Gë‹É‹´X²^ÚÊŽ‰³™n­T±UµDº‚Ìo" },
{ "d","dan","µ¤Šlµ£µ¥…gíñ³Nµ¢Ânµ¦ñõÜláG†Îéé‹[ð÷…SàîFÑóì„éÙÙš—“ú®XÒRº„Â›„[·’b­«mµ¨Ðy¼ðãµ§êæñd“Û“ÚÙyü^Ä‘ülürµ©Ê¯Žµ«µ® ý››X–½†m¯Dµ°µ¯µ¬à¢†›µ­ÝÌ†²ŽµªÍžÄEÓgÕQ·žÉ…ƒd‡nó‡‡d—‘„‘ž¶Vå£ñšø}ðZ°D°QÀWÙœ‡·ð…ìK" },
{ "d","dai","´ôß¾´ýªy‘·´õšx´þ´ö´ó´úÞaß°þåÊŽ‘ææá·çªˆ‚´û´øçé´ù–±µ¡ÜØ–Ž¡Ž§Ü¤Íf½HÜ–´üÝDÙJ¬xÛFK…¦•ÎÎ}¿Døl÷ìÅ•´÷º‰žŽìOünÒyì^" },
{ "d","de","µÄ‡NzµÃ›ú—‘¿œï½ÔµÂåuµØµ×" },
{ "d","dao","µ¶ØÖß¶âá–]ë®Åsá’÷ô€ÏC’Òµ¼µºê‰uµ·µ¹µ»µ”“vëIëìŒ§ëZŽW”F‰»µ¸¶\Þxµ½àüµ¿ìâÈKµÁ±IµÀÁŸ·Rµ¾‡‹ÅÐmÐp™| cÂRÜ„­ôîhþO—Í˜˜" },
{ "d","dei","‡NµÃ" },
{ "d","deng","µÆµÇØOƒ\àâ‹¿Ÿô­O¸~ô£µÅµÈê­µËà‡ëQµÊáØ³Î‰œïëµÉíã™žÓRç‹Å˜" },
{ "d","den","’O’Y" },
{ "d","dia","àÇ" },
{ "d","di","ØµªµÍµŠDI¶~Ð”êôÆˆ¹†¬µÌÌáÚhµÎàÖïá´”íLfµÒÆmµÏµÄÙá†vÝ¶µÓµÐ—b†µÑì{êëœìóƒñVîEµÔµÕÊHÊL˜µ”³Ë‹‡”ØpÛ—çCÓ]¼eûM…}Û¡êsÚ®ˆkÛæ~µ×…àµÖ’†èÜ ¹íÆ’ãÇœÝBÓhÔg÷¾Â‚öWµØˆh–m•AµÜ«ZÆl–šKˆªµÛ‚dæ·µÝÞžˆ¯ŸbÚÐ—\µÇ…‚±±ƒ«ŸµÚâKíû“W‹XµÙé¦µÞ˜N¶EßfƒCÄVãdíÚÎ[“ŸßrÊO‰—‰„®SÎy¾†‘dÖBÛyŽRÏE‡Ã" },
{ "d","die","µùµøÒBÆ|µü†AU’¡À„Ûìg•iÃ]ð¬±yÂWµý±‚‘ä½xÅ\éPÔeÚgÛ@®’à©ñóÂÜ¦ÞéšŠµþ˜G šëºÛLµúÑÎHÞµûÅŽÕ™õÞø‡®ÏHöøÛ•è¯Aöl¯BšÛ†OŽ²" },
{ "d","diao","µóµðšô„aÍ@µò¬ŠP‡Íqõõ¬høJµïõM²fåcöôµñºyü—õ ùmÄñ’FŒÅtµõ®µö±@·–ÓŽµ÷îöï¢µôážây¸uÉ‰äHã“ëô†Õ{¸L¯šä”ËyèS" },
{ "d","dian","”“µà…Ž‚ÙÑµá˜ˆ˜•¯’µßÛ†îîŒáÛñ²Žo”„Žp°dý‚µäŠHµã‹L”¥µâÉ_ÊsõÚücµçµéÚçµèµêÛãµæ‘úçèîäµëŠûµí¬UµìµîâšÍŸëŠ‰|‰«Õ˜ëµå´ñ°ô¡ò›—Ï" },
{ "d","diu","¶ªGîûïMäA" },
{ "d","ding","¶¡ØêŽŠ¶£çà¶¤¶¢ðÛî®ÍBñôôúá”ìwÆJŠc¶¥í”¶¦ü‡àìËYç–¶©ð—â³G¶¨Ó†ï}îúÈbà¤—Åëë¶§íÖ´OåVîr´" },
{ "d","du","… „†¶¼ê^¶½à½á`êA¶À¶¾¶ÁäÂë¹èü¶¿ÑtÕiåLªš„E…X‹óž^šœ Ù™³ ©­{°òy÷ò÷Çí~×xÚGØKèoíbíüt×˜¶ÇóÆ¶Â¶Ä¬o¶ÃÙ€ÓGºVÜ¶¶Å¶ÊŠ¶ÈÇT¶Šì|¶É¶ÆÎ–åƒš˜”¾ÐCó¼…¶ª–" },
{ "d","dou","…Ê„r¶¼†t¶µƒÃÝú™Xóû†z¶·êh¶¶–’î×¶¸ò½â^…¼¶¹àK¶ÁÇW¶ºð›ÃôYäÂáHšÃ—uÃ–¶»ékñ¼ôZðL”ÔêL¸]ô^ô`ôac" },
{ "d","dong","¶«¶¬–|ßËÆ{á´•kë±ð´‚”Ç‡ž–›òˆÄŠà¸•šæÎXõ[üŠöCù…¶­Ê‹Ù¶®¹šÕ‰¶¯¶³¶±Ûí¶²¶°ëËÞ“ŠŸá¼’œ¶´ƒöëØ‘ã„ÓíÏœ§ÄL—ƒPñŽëšúH" },
{ "d","dui","ˆŒ¶Ñ‰[¯y´qø‹çŽç…îX¶Ó¶Ôƒµƒ¶Œ¶Òµqí¡êŒê ¶ØíÔ½˜Œ¦‘‡í­åTïæËcžA‘»ž}×B×mÞV" },
{ "d","duan","ÂZ‚Ç‹e¶ËÑƒæH¶Ì¶Î¶ÏÈ˜¶Ð‰FìÑ¬‡Äaé²¶Í´V¾„š¬óýå‘”àÜY»f" },
{ "d","duo","¶à‰ïßÍ¶ß„„¶ÞšÇ”¦”­ñÖ‡š¶á¶Èîì”£”Ÿ„‹†Æ¯kŠZ„AÉõâèIÍÔ¶ä–\–mð™¶çãõßá’—–Ã–ª¶âˆ‘ˆÊç¶¶æ“¶è‹s—Ù¶ãÜoÚr¶å¾EôDÜ€‡¾Šb„mêwêy’–Œ¹–ú¶éÛGï˜‰™‘†‰šùzþKâ‡öV" },
{ "d","dun","¶Öª¶ØÎP“æ¶Õ‰•‡“Ç Ôïæíâ¶×ÜHò—íïõ»ÜO¯ŽÝãç¶ÚìÀÞš¶Û¶Üí»¶Ùâg¶ÝîD˜Jßq—ŸõÛv´]‰Ý" },

{ "e","e","°¢ŠŠŠŽŠãæ¹åí¶ïÞˆ…Å‡ê¶íS¶ëk›á¶ñ¶ðÝ­Å¶«Óžâe°xï°±“¶ì¶êÕM´d‡fä~îPô‰¶îî~ùZù[×F¶òêqÜÃßÀ¶óéî–•ÛÑ³b¶ö°·ãÕ¶õÚÌÝàß]¶ô¬ãµíëñïÉðÊîOð_Ø¬öùòF‘öŒï…Ù³X³S†H†@Š´„þÍLÜ—³r™…v‚­ˆ×ˆìˆñœŠºÝQØ`â…¬cŽþ“~“ƒiÎYÊ‚ß{ðIò¦é‘”AÖ@ÓFåŠî€šdµJ™Äù˜ötöýL×†ý|èy÷{˜…ÍŒ”ñùEÒk™ë" },
{ "e","en","ŠC¶÷ÝìŸ¸WÞô" },
{ "e","ei","šGÕO" },
{ "e","eng","íE—Ò" },
{ "e","er","s¶ù¶øƒ¹êzõÇHÂYX›˜–éÃs†„ð¹ÑLÂxÝ[öÜó’ëXøõbÄžÞW¶ûŒ©Œª¶úåÇ¶ü¶ýš¾–êçíîïãsðD –ñ“Ënßƒ¶þprÙ¦„n…þ·¡Ù@ÙEÐ^Ô ó“˜Þ»•Ú" },

{ "f","fa","·¢ƒì›o°k°láN‘·¦·¥Š‘ˆzÛÒÆž·§¯V·£–ì¸Ÿ·¤‚ë²XÁPéyÁU‰˜ìËtá·¨cíÀžž·©¬móŠóŒÊ†›¹åz" },
{ "f","fang","ØÎ·½Úú·¼›P·»èÊ °îÕÍKœEÚ“â[åpøh·À·Á·¿·¾öÐô™·Ã·ÂáÝ·Ä•P•X­œ±f¼ô³”ë‚ÔLó„úJ·ÅˆÚ" },
{ "f","fan","·«é®‰·¬„åÞ¬á¦‡h‹Ì‘Œ”ó”õ¿œ·­·ªÞNïcïx»O÷Y·²„G„F…K–i–¯·°·¯»oÅtÅwñÈ·³¹BâC—¡Ÿ©¾u‰“·®­[Ä‡ËXìÜÒT·±Á€õìçxµ\ÞÀž’Ï›ú‹þP·´’B¢·µ˜õ·¸šïšøŠi·¹·º···¶î²ÜÓŒØœ¹D±FèóÝGïˆï‰J‹Ë¹ Ý™ž~" },
{ "f","feng","·á·ç„K§„NŠ~ãã„O·ã±`·èí¿·âïL·åo‚ª—Q·éˆýÝ×¥œtªh·æ È—÷·ä´^¯‚ºAƒtà•äh™lØSæ‘çQÛºÌtŒ›ž–ÐIìbïpüK·ë‰â›h›Í·êœ½ˆùñTÅ‚m·ì“ž½ ¿p·íÒƒßôÖS·ï·îÙºœ˜ŸuŸ‘ÚRøLøPøiÙˆ¬S" },
{ "f","fen","·Ö·ÒŽŒ·Ô·×·Õ•SçãÐv¼ŠÁ‰ÜmÓŸ·Ó—±—râpëƒñBði–BðŠ}Œð·Ú·ØžÇ–D–ŒÁiÍ_Í`·ÙèûÉkëVôšÊˆŽËªŠ‰žåŸøŸþ™JØk÷÷Á‚ü‹ØrÞMèMñOüR·Ûüv·Ýkˆe·Þ·Ü¶lÙÇ·à·ßƒf‘ÄŠ^¼Sö÷å¯÷a¸j²b" },
{ "f","fei","þT·Éåú·Çïw·Æ·ÈŠóŠôœdç³ìéªU•›ìqÑqòã¾pöîö­ñIð[òWòaöEïy·ÊäÇëèÎN–FÃd·Ë·ÌŠOã­—’ì³ôäé¼Ê„Õuóõ·¢ÜÀ·Íáô·Ðâö–{·Ï·ÎÃ^•h·Ñ…Š„|êŠ‚n¯XÈQŒÐŽüÙMðòïÐU•Õ°Cü”ÏnžO™¶çšì]" },
{ "f","fou","¼€ó¾·ñŠvÀÀŒë€š†ø]" },
{ "f","fo","–·ðˆu—‚" },
{ "f","fu","·ò¸ß‘æÚß»ŠmŠ•«c·ôÃi³QÐuN–´ÇCÇXŒ ŠÂ”êôïõÃ¼”õÆâaïû½š¹[à~·õ»™ÄwøWûŸ·óüA¼JüF‘ÊTŽˆ¸¥Ùì·ü®i·ð„_ÜÀÜ½Æ]·ö·÷›Š@ç¦ç¨…òŽ“ÜÞÆ…–Žâö·þí‚·úìð«s–¢–ÁžÞ®w®tî·ÜòÛ®øI·ýˆŽ›š¸¡†bÝ³ò¶Ð“–óíÉÁèõŸJ¬M¸¤Ì’åõ¼›½E·û¹AÝÊÙë¸¢·ùÈƒ½nÁJ—­øDÅ€ãRãVïO·ø¸£òÝ½•¹…·J˜_íhØfó‘øqòðá¥ºÝ—Û~õHÖDíêÒL¯žõvÒiùfù›Úâ¸¸¸¦¸§ÞÔ}¸®¸«àM‚a‚Y¸©¸ªáœ’Ñ¸¬¸¨¸­±GŸrÍ—äæ¸¯Ýoî\‡`“áôfº…öUíë¸¼¸¶¸¾¸º¸½·¸Àæâˆ}¸c¸·Ó‡Ø“¸°¸´µyTÐ•ÍbÍk¸±‹DŠïƒå‚¾¸µÍÈi‹c¸»¸³Í|¶Ò„ÔcöÖ¸¹—Ú¸¿êçÑ}Ñ‡òóÎl¾”ÊÙxñ€õVÝ•‹Ñ¿`ÙŽöûå‡å˜ð¥¸²öváKþE—Ó¶O" },

{ "g","ga","¼Ðê¸Ù¤ßÈ¿§¸Â‡QÔþîÅáæÙ¸Áåm«VæØÞÎôpf„LÜ…" },
{ "g","gai","ì¸ÃÚëà@ÇDŠ¡YÛòêà•|µ‹®„½wëBÙWÙ^ØdÔ“ã¸Ä½iØ¤_„÷„ø½æ¸Æ¸Çâ}“©¸ÈÈ‘Éwê®¸Å˜¢[˜£­y" },
{ "g","gang","¸Ôƒé¸Õ¿¸¸Ù¸Ú¸Ü¸Øþbþh¯I³M ±Œù¸Ö¸×î¸„‚ˆÕ’ââG Â—ž“•ˆþÀ“¾Vä“æs¸ÛŸ€Ÿƒóà˜í°‘Þ‘ß" },
{ "g","gan","¸É¸ÊÞ|¼éå¸Ë”«\¸ÎŠ›ãïÜÕÛáí·¸Í¸Ìôûðá»ˆ„QÞÏŒ¼¹møNlŒ¿ŒÀôvœÆQ°‘Ðr¸Ñ¸Ï¹C—U¸Ò¶’¸Ðä÷ÚséÏÚß¦º•÷ ÷h›Nêº±Yç¤ƒ÷‚‰äÆ½CÔló_ŽÖ˜o™gÚC¸ÓÚMž¸" },
{ "g","gao","¸á¸Þ¸ßÁoó{°wÅV¸àØºéÀ˜°™R¸â¸Ýðpíz™²üŽúkú‰ùê½Ç¶Ž¸ãçÉéÂ˜‚•±¸å·X¸ä¿cÞ»Ë›™æ€¸æÛ¬„ÆÚ¾zµ†µ‡ï¯¹lÕa¶Jä†…Ì" },
{ "g","gei","¸ø½o" },
{ "g","ge","¸êØî ç’MæüÛÙ‘áÃI ³¸íð›¿©¸ç¸ì¸ñ¸ëñË¸é¸îœð¸è‘ëøwøÖg”RæŠ…Ï„ýàÆŒ¸ó’š¸ïØª”š¸ð¸ôÑ\¸òÍxÅZÍÓkàÃœèÜªë¡˜†ëõéxéwì‘÷ÀíkïÓª˜ÖYÝ‘õsækíuòZíRÞP¸öºÏ¸÷ÛÁ¸Çô´†ñò´‚€¸õíÑ¹wãtgŽ|…¶†{™ " },
{ "g","geng","¸ü„j¸ý®u¸û›ÊÈ@âÙŸ‰½cûf¿K¾ÙsÁ}ùˆ¸þàQÇcßìy’ªç®¹¡¹¢¾±¹£½Žöáóiõ†ˆí•œ—Ô" },
{ "g","gen","¸ù¸úßçôÞØ¨ƒÝ¢“^“j" },
{ "g","gu","¹À–q¹Ã¹Á›}¹ÂÆ‚¹¾ßÉéï–¾¹Çð³ÁB†f†g¼ÒÝÔ¹½òÁ¸šÝLÝMõý¹¼ôþÉuâì±¶™¹¿¹‡ºH‹²™OøõY÷½‰à¹ÅÚ¬ãé¹È¹É¿àêôÁl¼ÖîÜî¹¹Æ†˜›üëŒ½ÔbðÀð â’˜€þA¹Äü‰˜bØÅ°–·Y¿S¼MË[žJëû°›ðkÝž±Wî­žkúXÐM¹Ì¹Ê¹ËƒóêöèôáÄˆØ—›¹ÍµïÀðóƒlådöñöAî™ßEÃ™‚ï" },
{ "g","gou","¹´¾ä¹µØþèÛ¹³¯YÐâhçÃã^œÏÑ¾—óôº÷¸íxÆa¹¶¹·á¸ÂTÂV«vÍmóÑÂUØxÚ¸ˆx¹º¹¹Š¥¹¸ƒÚ¹»‰ò†ŽÔ_ÔëgåÜì°æÅ“kŸµêí˜‹“ÂÙÓM" },
{ "g","gong","¹¤¹­¹«…šþ^¹¦¹²ºì–r¹¥¹©ïëÅ¼k¼n¹¬Œm¹§ò¼¹ª¹¨…@Ž³ã‰bö¡Üp‘E…C´bó•ÓyýŠýÞÃ¹®¹¯¹°–í’çîÝ\ì–þg¹±†yØ•†ßŸË¸Ó" },
{ "g","guai","¹Ô“…¨¹Õ–Ê–¡ÁL¹y‰ø¹Ös" },
{ "g","gua","¹Ï¹ÎßÉëÒèé—Ið»šOŸ°Úo„œ¾ Û|ïWøŽòmƒÖ…³¹Ð„Ž¹ÑØÔÚ´ˆq¹Ò’ì†§ÁG½\ÔŸ¹ÓïN" },
{ "g","guan","¹Ø¹ÛÂÚ¹Ù¹ÚñæÒ‹ÙÄÝ¸ÉF¹×¸Aév¯°HÓQêK÷¤êPöŠ÷bÓ^¹Ý¬g¹`¯p¹ÜÝ„å]ð^­eÅoøA…jš¯O´®¹á›ŒÞèäÊ¹ß¡Øž µ‘T‚“¥ßk˜ÀîÂÀ•ëqÜIæš¹à­ ƒ²•ðÙµe¹Þè…ûX÷}™õ" },
{ "g","gui","¹é¹çæ£¹êßž¹æÆ—¹ëð§Ãv«•Ž¢w¹èÑOÒŽ@—Ë‹‚àF¹å“±é|öÙ‹¥‹¾˜²˜³ý”­Y²nõqšwëvôhŽQòo­„ôkÌlå³šð¹ìâÑØÐê{æ¹îŠ¹ˆ’i”‹¹ïÜ‰¹íµƒŽë…QêÐœˆÍŠÓmÔŽ…‘óþÏj”Š•QØÛ¹ôêÁÈ²¹ñ¹ó¹ðèí—Îªg¹KÙF¹òÉ}²ZÎš“Ê„¥„£˜­˜æ™u¶W²z°IÒ^™™çq÷¬íWè^÷Z÷i™Í" },
{ "g","guang","þ]¹âž»žÓžÕžÖÆšßÛŠ­›²ˆŸDèæ«‡ë×Ý_ƒZã üU¹ãŽÚáîV«EÅS‚U¹äÅQ" },
{ "g","gun","Ø­ÙòÐ–çµ¨¹õ¹÷É€¹öLÊF¾i¾ÝöçíÞõPõ…±šÖ" },
{ "g","guo","¹ýßÃ†FÎÐÛö¹ùˆå†©â£áÆ¹ø—ëñøâu¯†‰ãòå˜‡HåœÏX‘²‡ë¹ú‡î‡ñ‡ó‡øàþÞâÄNXÂƒŽ½Êb‘Ië½ÄsÙåºl¹ûÇ‘ðŸ›ý«Ñxé¤˜¡òä¼@¾[¹üÝ{ðRß^ÄBèJ" },

{ "h","han","áíÎñü†còÀº¨í™ØE‹©º©ñHõA÷ýÚõº¹ºªº¬º¯„TÍH†iŠÎ›¿‡öìÊ—cêÏ¬Hº­—²º®º«®]¹bÎKäw¶ínþsº±›Èº°ÊGþ\ØJþ[…{ººŒå’Iê\ºµˆ¥º·ªRÇtº´›ÛÝÕº¸•~âFé\°y±ŽÍ”‚þñU¸Ðò¥hÞþÎLŸßäIäd•Âîhº¶Î‘º²º³îuòAënÖ›å«ú[ƒË ’" },
{ "h","hai","…õ¿ÈàË»¹º¢º¡º£ëÜŸQáVõ°º¥Šoº§º¦º¤ï™†ãñ”ñ›ðŽ‰h" },
{ "h","ha","ºÇ¹þ¼“îþãxÏº¸òŠUa’CœÂ‡æŽ÷m" },
{ "h","hao","Æ’ÝïÞ¶Ë^àã]šµ¸ÞòººÁ—·àÆª|ºÑºÀªˆ‡s‡_ª‚ƒŸå©º¾º¿Ï–»D×qºÃºÂºÅê»•a‚G¶mˆºÄ†SºÆh•‰œB‚Ûð©àzÂ|Ì–œé•µ•¼°‚°€»¸äËA°…•Ø°ˆò«î—ö‚å°ž®¸h" },
{ "h","hang","º»¿»ÐÐÆfÞ†¿Ô”ãº¼°¹ç¬èìçñÍaº½¸‘ñþØ˜ÑR½W¹Vî@ôŒãìÏïˆœ" },
{ "h","hen","’‹ºÛì•äºÜßçºÝÔ‹ºÞ" },
{ "h","hei","ü\ºÚàËºÙ¦" },
{ "h","he","Ú­ºÇ’ušBÑÀºÏÔXºÈàÀÏšºÌæüºÎºÍ…ôàAÛÀŠºÓ±A–­ªCPðšºÒêÂ»t¼vá—ºÉºË”—îÁ±Bº¦ºÔœzºÐºÊÈM† ý†ÔZò¢²—æ¼šÎãØ÷…Ô†ºÑØ€ãFéuïûŸ¿ûiîMôŸÎ˜ôçºKðgíHý[êH´Ò‡ùŸ°èYý˜ÏÅÞºØˆ††YÐŽŒyŸZðÀªnÙR´E†ÛŸŒŸÀºÖºÕº×ÂG°FÖyÛÖ‡˜ _ eúQúKûSìe»—ßjìfìg" },
{ "h","hong","…·…Ë…Ôž¿ºäºåÙêºæÜŸŸp³…“Eœ‚ØFÞ°Ý“å‡«ÞZ›ºëŠkŒâºìÀ€«Y›K…ÆãÈºêŒfÆyãü«aˆ˜›`ºç¼tºéŠ¼Ý¦Á‡ÁŠ›Ä¼‡Âo¸fºè³{¼˜ØAâvéb»Ž¸sœ|ÈˆÈ‡½“ØDÁãpìô„~äfºCÙäë”šÞ®ëŸø™üZ†y•{Ú§Óé{äU“Ð¹é—ô\é•" },
{ "h","heng","ºàºß›êÃ†ÐÐºãaŠ¬çñÃtžîèìûa“Ñºá™Mºâø’Þ¿èUùC†‘" },
{ "h","hu","ºõ…IÏ·ò®ÜÌÆ~ºô›~ˆ~•Uºö•÷mìÃéõ…Oßüã±œXÌÜ ëŒëiäï‡FŒŒŽÄºýšXÄŠÖ—’_àñºü»¡ºÍ®@ºúºËºøëa‰ÖõúŸWðÀ½`‰Øâ©“‡ºþ†¼ºù‹|ìÎ—ýº÷÷½ðÉÊS‡Pºû¹”éÎô–Ðkîgõ­Î™¿eæLðbì²ù]ôEž€ù–úCö{[›R»¢ä°‚sÈL»£Ì•çúGåt»¥u»§‘ô‘õÙüÆS»¤»¦›ZŽìæá²âï–•OìïHóËð­ìèŠý—ü¹Í½œþA†Øà‚‹¬‹­Êdœû“ª˜«ŸÚøUåØmºn‡©ð××o÷Ÿí’ûI÷s»‡" },
{ "h","hua","»¯»ª»¨»©í¹åkÌf»®…ØæèŠ£ÈAîüâEâD»«»¬‡W“Š“ç„´höÙÎ”änÊyÖœçfò‘ú†‰þ»°––˜»­èë†‹O®‹®“‹ÃÓiÔ’“®˜å˜¥±‹½Õ–Õ üXÅpÀE×f‹Nˆµ—É³“ÉI¼AÕj" },
{ "h","huan","»¶ íªBšZøbùJà ‡ÈŒAâµ‘×šg×’ØŽóO»¹Û¨»·ÇB`ä¡»¸ÝÈÈPŒ~ˆâëf½b½ŒØ}ªxÁvïÌà÷×çÙå¾‹Öß€êaæD­hØoéIûq¼]ÀQÞSèGêX÷ß­’»º±¾»ÃÃKÛ¼ŠJ»Â»½»»»Áä½Ñ£žð»À—håÕ»¼´†¿†¾œo“QÑ»¾»¿¬~Ÿ¨¯ˆäñöé˜¬Èß§ËõŒ”köZöd" },
{ "h","huai","»³»²»´»±Ñ‘õ×Ñœ‘¯‘Ñžx™ÆÂjÌx»µ‰²‰ÄÌ|" },
{ "h","hou","ýJºî³@àjÈ‰Ž«ºíºï²Tðúãóó÷¿ô×ÂFÂJæAðfö\ºð êºóàCºñÆ™ááåË›•ˆ‹ºòÜ©Ø_ö×÷õ`÷c" },
{ "h","hun","»è•e»çãÔ»é›÷¸š‰—•È²E²JÊMé’ÞFù»ëçõ»ìâÆœ†»ê¬qðQý@Ú»‚[‡õäãù‚“‹G’äŸk²OÓoŒ±ÕŸ" },
{ "h","huang","ŽxëÁ»ÄÐYŒr–M‰E»Å»ÊÚò»Ë‚µ»ÆüSÈáååØ†Å‹h¢“NäÒˆð»Ì»Í˜R¬‰éB‰ŸäêªŸì»Èè«ÅŠóòÖW·kñ¥»Çó¨»Éðcöüå–í‹Ú‡òbçuöm÷UúŠU»Ðžê»Î•s»ÑŠN»ÏÔ…Ÿº¿mÖeƒÆ™¤œêé˜n•Í°æw°Œ" },
{ "h","huo","…¿¶…ñëïÁØå‡—»íòdß«åºÍ»î¶¶„ìá»ðß˜»ïîØâ€Ÿ´tâ·›[»õ»ò…ü‚i»ñ’»±néXØ›’î»ö†¸„Šœ­µœ»ó”üÉ^· åx»ôžC«@Š_”N™ŠëoÖf·‚ïì²ˆ¦žmàëÞ½ó¶ÂhÅŸ‡É•ëÅG²‘°\èZí_ì[§" },
{ "h","hui","Ï·»Òž¾ì¿Ú¶ßÔ»Ó’’›‘»ÖÐ„ò³çõŸFêÍØY¶éŠî‹^“]ëD»ÔÁš•Ÿµ˜î¡Ÿ—òÔœ²NÑ‹Ž¹‡j‡v“ÖÂEÝx÷â»ÕãÄž`Ìsö™‡ß»Ø‡éÝhjÜîÞ’oä§ÍYŸCßD¯`»×ÍzÍ õt³æ»Ú»Ùš§š« S™m×e»ÜŒàŒá»ã»ä»á›xä«»æßÜ»åÜöÆU»ß»âèíí£{»Þåç»à½}Á™@»Ýà¹çÀê_œ“œó…R•þ¢¡ÙVÔþiÕd¯ƒa‡GÊ]Þ¥ŒŒ“ˆH‘}˜ž•Á»Û™BÖM‹Ïª›èËCËDÚî_ðdË™º_™b Z­gÀD·x²~ó³‡¤‘ÎÀLÂP×M™®çiƒªêTìuçž×wîœïH­_" },

{ "j","ji","¼¸¼¥ß´»÷„W¼¢»ø»ú„ZØÀÜ¸çá¼¡¼¦í¶ÆæÆä–ˆßÒßóØÞ¼§åì»ý®‚óÇï|»ùŽó†Àïú³Ž×êåê÷¹U¼©–O¶»û†æõÒøKã‚ƒ_¾N¾f»þš©»üûnÓsÜuÕƒ¾ƒçÜ‡\˜œì´åZ™C¶SÛÔ¼¤ëYÒH·e­^´‰î¿ÙŠºs“ô™›Âfëuí‡ù×I×^çˆð‡ÜQúaíZôy°^ÁaÌ~èWèiýWÒˆÁbûAÒ‰‘’¼°³²¼ª¼³á§¼¶î¼«¼´Ø½àBÙ¥…uŠ …¯¼±°u¼‰óÅ¸ïÓf“V¼²ˆô—ùŸd‚Â…hØC¼¯éêê«¼¬˜Oœ–‰JáÕé®¼­êÝð¼µÎaÚlãšÂcÄl˜ŠŽNçÞªÊmñ¤¹œÛaÛeÝ‹ÎŽ™v½å´’ÒQÛˆå‰Å¼®çgìPÞUúWýVÜeë}¼ºMŠj ä¼Í›‹ò±¼Ã¸ø¼·¼¹Þá÷‚êª÷äô‡“Ø™W·m”DÏlŸ¼Æ”ú¼Ç¼¿ÆëÏµ¼Éˆj¼ÊÜÁ¼Ë¼¼¼Á¼¾¼£ˆ…¼È¼oÜùÆ–Æˆä©ßâÓ‹Ó›„ˆ¼êé¼Ì¼¨¼Â—m”û¼ÀÙÊÂ¼Ä¼ÅœgÈ—ÊD¯ÅUÛEônô‚Ñ_¯s¾@¼»ëHƒÎ„ÞTP¶I·b·IôßôŠöÝö«õÕÕHÕ‚öê•¸ð¢·]•Ì¼½„©ËE÷ÙÓJËj‡ú™o¿ƒÁY¿Ž­u™‹Û”ùHöaýTõŸ‘Õ°U·}æ÷ÌRÌnž†À^÷Dö›÷CúnìVÌz÷qóKþL˜Û“ÄöV^" },
{ "j","jiang","½­Üü½«½ª½¬®{ôøŒ¢Èw®–“°Áž½©Î…{ËKçÖ‰¬š™™^ÏQ÷šíä®Ÿ½®ÀPí\÷F½²½±½°½¯‚×‰DŠXŠ\ÊY˜ªª„ÄvñðÖvîŽ…G½³x‰á½µä®ç­‰Ç¿½{½´„ß@Ú“Àêñ¼TánáuôÝÖ˜™º" },
{ "j","jie","½Ú½×ðÜ½Ô½áëA½Ó’÷½Õ¯^½Ö½Òàµà®†Ö‹m‹‘ˆê—¸œœÃ¿¬Ÿ®·MìŒÎf“øÖŠ°Xù™Úà…mæÝŒ¨Ú¦„g½ÙŒî„f–t•M½Ü¯CÐw„Â„oÚµªE½àÞ×Þ—½ÛèîÓ“Ç}‚ŒÙÊ‚ÍÇæ¼›½Ý’ùÑKÍ„½e½Y‹}‚Üò¡ã]Ë“ƒœï¹½ÞÔ‘Í˜H˜P˜m½ØöÚíÙ½ßÉ•éQì“îRÕmÛdôÉŽÑŽY”Oõ^µ@æOŽ^ÏÏ˜ÐVš²½ã‹d½âÓnï™wN½é¼Û½æŒôŽà…Ã½ä½ìŒÃ«d½ê³V½ç®vÐ|½ë½èò»…È†‡ˆû—ô¬p÷ºÍŽÕ] ÏÑ›ôæY½å—A" },
{ "j","jiao","Ü´½»½¼ÜúÆ›½¾½¿æ¯j½½½º½Ìþ™½¹½·òÔõÓÌ—öÞÙÕ½¶²‘xõŽB‹ÉÄzÄ‰áèõo·pðÔ½¸øŸºŠÞBÏtç€òœú„úŒ½Ã½ÀÅT½Ç½ÄÙ®½Æ½ÈÞØ½Êžì•w’¹¸‹ð¨½Å½Â½ÁäÐ½g¹RÙ]„à½ËÄ_ë¸Ÿ”•¯ƒe“¼Û]ãqïœ“×“èƒ‚Ù„¤”º½É‘¢”¼³C•Ý­dÏf°‰ÀU×K‹ùž«”‡÷Rý™½Ð…Ó’›á½¾õÓŠ«„Ð£½Î½Ï”œ·•½ÑÝ^œò]†ý†û‡U”Ò½ÍþàÝ‰‹Ðª—‡„ËŠÞIõ´ÚŠ×_°á†" },
{ "j","jian","ê§¼âŽÔ¼é¼ä¼ß¼áÇ³‘âƒï«l¼ç¼èŠ¦Š§¼æ¼à¼ãØ]ÝÑÈGª\½½¥ˆÔ¼ê½¦äÕÈ‚égëeêù  ¬{—ß—ä²R´DÝóÞöçÌ¼åÊ`¹{öä¾}ðÏ˜ÙÊzÊ—ŸÒøZŸæ¿Vä’ðeñJíKÆD÷µ÷œžhùNùpšµMžŒöxöúYšž™Ò×tí[µföž‡ØÌ‚ídè~•©àîèÅ¼ð¼ó¼ë¼íóÈ‚›¼ñ’³œ—Ž¥¼õ¼ô¼ì—gõÂÔd—Êïµíú¼ïñÐ‰Aœp“B’þÚÙ¬‚½€¹a¼òê¯‘ì¼îƒ€ôåº]“ìËuÒMÒO™zåÀå¿Öˆº†ÀO´š²€ôCûxörÏ•ç™ç‰žû{×v»WÒ}û|¼û¼þÒŠ½¨½¤¼ú›–¼ö½£êð«…½¢„‡½¡‚k½§–ç„ÚÉÉÑIë¦Å[ëì¼ùÚ™Œ{é¥”ðÙ`¼ø¼ü±O¼÷˜cuÙÔ„§„¦¾¼ý¼GÕÙvõÝÛ`Ú{ðTÖGæIË]„ª„«æG²{´´–¿ žR™‘”Wžˆ×UçZÓSÓVÅžÞYèBèaèbè{èƒØb”‰¤û…" },
{ "j","jia","¼Ó¼ÐŠAÙ¤’z’~›v¼ÑÇÑåÈçìä¤š¹¼Ï›Ñ¼ÒðèÂ_óÕôÂ—kÝç‚íõÊªoÄ`¹kãe Ç¼ÎïØØjØ†ømæ‰û“¼×’Sˆ]ðÛ£àP¼ÔÇv†kí¢Ãîòê©‘æÑWòÌ¼ÕÍÛOî]äeîaø”ùGáµ…­«wëÎ¼Ø¼Ö”Ï¼Ù‹TË”Ð—ÝÙZâ›˜–˜\ØÅðý™x¼Û¼Ý¼Ü¼ÞŽ·˜kƒrñ{¼Ú†í¼O" },
{ "j","jiu","L„ó¾À–` ¬ð¯¾¿¼j¼môñãÎÈ\à±¾¾“AäÐøF“[“š˜Í÷Ýôb¾Å¾ÃX`šð›CŠe¾Ä¾ÁÅi¾Â¼‘éN¾Æíƒ…E¾É¾Ê¾Î¾ÌèÑ–Íèê‚w…B¾Ç¾È¾ÍŽýH¾ËGÙÖ‘Wš”ÅfðÕöJû…Yýnú–w™ã" },
{ "j","ju","³µ„HÇÒ’]¾Ð›t„û¾ÑŒþÜÚ¾Ô¾ÓêšÁ’º’±±r¾Ò³^ÁD—xÇùÞä¾Ý›ô‡ŠÛ‹JšÆôòÚ ÛBé§è¢ÄKï¸ñÕöÂÎAÅ‰ÜvÕ‡Ûgä|ñxø~õL¾Ï™h÷¶ù‰¾Ö›†‚I ó½Ûà`Ÿh¾Õ†¯ŠèœHœ¦—»Ý] Êþœé…ÛR»ÚzéÙñùV¿›ùqÛžúGüŸŽeÌ^ýAóMl¾×¾Ú¹ñèÛ¾ÙÜì¾Ø’¤—º¹_ö´é·é°ÉXÂ‹Åeõá”H™Îýe™ÛÒz»c¾Þ¾äÚªÜÄßšŠŒø¾Ü›®þ¾æšj’‡¾ß•Z¶€îÒ¾ç¾ãÙÆ‚˜ÐÍiÂ`»‰Ôn¾àˆ¿ˆÏ¾åêøâ ì«Ì˜Øe¾âñÀŒŠ¾ÛìñuõX¾áåð„¡„èåá“þÞ‘§¸M‰±äïZŒÕØ‹º–õ¶ÜMèL‘ÖþF" },
{ "j","jiong","ØçƒÕˆsìçˆ·ñoñ’ÌSÌW‡åƒ×åÄ›sêÁ¾¼Þ›‚C›ÓŸK½NïGŸ ¾½½ŸƒTŸ¡ŸâÑ•°îy E" },
{ "j","jing","Žyˆiˆlãþ¾¥¾©¾¶¾­Š¾£ÇG¶p›ÜŠùªS¾ªìº”ìÝ¼½U¶“È…¾§ëæ¾¦½›¾¬þ›¾«¾HÂ€¾¤¾¨ûù‚ù~öLü ó@û—¾®SÚåØÙŒc›Gˆg›HëÂ·„qš€¾°ÙÓîKŽÁµã½­E­Z­`‘ •ÇîiÏ‚¾¯¾¢ŠnåÉåò¾»›·‚\ŠøëÖÇo†ÞŸ‚Š½ƒô¾º¾·¾¹¸xœQ—J—}æºÃ„ö¦¾´¸t¯d‚ý¾¸¾²â°ÕeÛV¾³ìnìo¾µ•ßžsùXçR¸‚¸„™Y" },
{ "j","jin","½í½ñ—½ïîÄ½ðáŽÓbñæñÆÇM½ò«ƒ¼Ž²›¬Q®âYˆü½î½û­\üTûv½ó½ö¾¡Úá‚BŽ„½ôÝÀÇž…½÷ƒH½õ‹¦âËWÉ“âÛ¾oéÈèªƒå\Ö”ð~µ„³æ¡¾¢½ø½ü–‡›»„ÅÝ£½þêá½ý½ú•xµ‰ßM†‚Ÿ¥çÆœÃŒƒ“|½ù±M‰ƒ¬’šVš„Bƒqêî¿NÙàääø‡žË|‹â a­nÓPÚBý„ƒ»³\¬n‰½" },
{ "j","jun","¾ü¾ý›J¾ù¹êÐ‚ÜŠŠ®¾ûÇqÍS—T¾úñäâx´AóÞÒŸã—°—°˜ãz÷îf÷åå‹õzûŠûŽ…Í¿¤ê}¿¡¿¥¾þðžÞÜ¿£ˆ­öÁŸa•€¬BÈš¿¢®—œëhÎD¹„¹‰ÙbƒyŒ”‘®ðKŸóòEžFùQùRùU”h”|" },
{ "j","juan","Š¤¾ê¾èä¸È¦Ÿ]–K¾éÑZ„æïÔägæŒçîÃ…Û¾íŽ™ˆ±Çš’ÔïÃÛmäŸÄ–ŠF„»Ž†áú„Ì¾ëèð¾î€öÁ¾ìÛ²›û®CÄC±’ÁI½v½²C‘gÊ^ðCª™Á\×z" },
{ "j","jue","àÙ¾ï“ÞŒÖŒØ|æÞŒH¾ö„]¾÷šÜ½ÇÆ`{›Q¾ñ›‰«i«kçå¾õ¯N³OÍD¾ø’¢’Á¾óÍX™þ½Åèö”ÇÒõûÔEÚb¾òáÈÚ‘âfŸ}‚àØÊÚkÒ™½~½^ãÚØãÚÜ¬œñiø`ø_¯‹ “Ótâ±‡oÞ§Ê…ŸØ‘•Ž@ŽDàå‘‰éÓ™@ïãÄ”¾ô™ÃÏqÏp×H uõêÜFÜBç~çÛÇ÷¬½À…ZÓXÓìßžŸ‘Ý¾ð«Pžú€þ‹²ŸØÜjè‘" },

{ "k","ka","¿§ßÇ¿¦¿¨Øû¿©ëÌãl„Jˆš–þÑQé^¾BÂˆõ–ù‹" },
{ "k","kai","¿ªŠKé_¿«ï´ç˜¿­ØÜê]âýÛîîø¿®„’ÝÜ„P†þÌð¿¬‰NÝaïÇ•°å|æzêGïaâéžÍžý™ü„Ñ÷æb" },
{ "k","ken","ÃG¿ÏÃ\¿Ñ¿Ò¿ÐØcØ~åo‰¨‘©’õ³wñÌÑy" },
{ "k","kao","åêÏó}@¿¼”Ž¿½›Ÿ¿¾èàîíŸÀêûäD÷Š¿¿õwõ‘W" },
{ "k","kan","¿¯¿´–Ýíè¿±®¿°ê¬ýÛÉƒÝ¿²Ù©¿³Ý¨‚°§šKšM¼÷Ý|îƒÞR¸ƒþaÐb€‰{ãÛ´|î«êRô_²™" },
{ "k","ke","…\¿Á¿ÀºÇ · ˜çæ¿Æéð¿ÂîÝðâ³`ÚòÂ¯zÝVò¤¿ÃÈdïý É“tâŽñ½¿ÅËP˜}˜ÊîWî§òò¿Äîw÷ÁáfµL¿Ç¿Èš£š¤Á˜“U¿Éá³žÜœf¿Ê”¨ºŽP¿Ë¿Ì„Ä„Ë¿ÍQã¡ŠÄ¿Îæìë´ˆÑÐ_Ùç¼äÛÚï¾à¾´R¾~Å‹Õnä˜òS´ž…žÞ‘³€ÁƒÄ·iõ–" },
{ "k","kang","ý³T»~¿µé`‹¢Üo¿¶˜±·^¿·Ü{ç_÷K¿¸¿º…Hß’ØøãÊ è¿¹‡ã¿»îÖâ‚" },
{ "k","kua","¿ä†EŠ¯ÕFÙ¨¿åã’¿æ¿èÚ¿çógÅ~" },
{ "k","ku","ØÚß ³L¿Ý–ö¿ÞÜ¥‡ýÚœ¿ß÷¼õp¿àª@—ü¿âç«‚V¶sŽìŸ\ÑF¿ã½fà·¯‰¿áÑ‡¿ÈZùŒ" },
{ "k","kou","ÜÒ¿Ùíî„›“¸“²g¿Ú„¼ßµ¿ÛD””Œtƒã¿Üâ@·óØÞ¢ÊfA²]ºpúd" },
{ "k","kong","¿ÕÙÅáÇ›ïˆÂ£³œóíÜwåIùy¿×¿Ö¿Øì" },
{ "k","keng","êl„´¿ÔŠs¿Ó’®³n ¾ï¬³³™ÕU“¾äLå”çH" },
{ "k","kuan","¿íŒˆŒ’ÅC÷Åóy—pšE¿îšL¸T¸Uèw" },
{ "k","kuai","þcØá“ùŽw„S»á¿é¿ì¿ëÛ¦ä«ßàáöëÚšC‰K¿ê÷Ž‰‘à”ƒ~XÒªœ‡ˆÄ’¼[”÷÷dˆQ" },
{ "k","kui","¿÷¿ù„lã¦¿ø¿úÂ¸QÌîêNŽh¿ü•uÚóàkåÓØ¸Þñ¿ûà­óYêÒ‘è—ó—õ¿ýî¥òñî`åžæK™œËwòjÙçÌwÌ€Žu áÜi¿þŸõÍíŸ´jÛ“þ|¹éŒºØÑÝÞà°‹À¡À£ã´À¢…TÊ‰‹Å‡]‘|¢ñùÂ‘þ}óñÖdš•Ä„ðrºˆÂ˜»Að" },
{ "k","kuang","¿ïß„ÁÚ²ßÑ›¬b…N³q¿ð¹nÝHÕE¿ñ ï’[ûÚ¿Ü’ÜœÕNù\ÞÅƒ—‘ÈÚ÷æþÛÛ¿ö¿õD›r¿ó•pêÜ±q³m¿ò½T¿ô½_ÙLÝAãkäqà—‰¿üY p•ç‘Ç·ƒ²ŽµVÀkèk" },
{ "k","kun","À¤À¥•‚ÑTˆÒÇª^‹ŠŸjçûó‚÷Õï¿ûdÑhÑ‚ÎJóˆõ«­@ŸãåKöïòOù{öHúAÀ¦ã§ãÍ‰×—yµŒ¶‘³ÑX½™¶Ÿ‰Úé€éÀ§›Ù±—ˆÜ„" },
{ "k","kuo","À©’ˆÀ¨’•èéòÒ¹QÈuÈvÀ«ÀªîSó–ípíAéŸ”UžNìHíTôU" },

{ "l","lan","À¼á°À¹À¸°À·¹À»ÈŸÀ¶À¾À½ñÜìµƒ‹Àºïçê@Ë{Ò[‘¾ ] L­sÒhŽÓ×EÀa»@ÌmÌkž‘ž™”r™Ú”ÌÒwž±‡Û»_×ŽÜ_™íÒ€è|íeÀÀ›ÇÀ¿ÀÂé­äíî½áYÓE‰°ÀÁ”G‘Ð‹ö‹ûÓ[ŒG”ˆ Š™ìïCÀ|ÀÃÀÄ AžE‡• f €­Šž° ˆ¼hè”" },
{ "l","la","À­À¬–¬Ç‰À²À®“yååê¹ØÝíÇ“X´r‡ÄËˆÁÂäÀ°—ï“YÀ¯Î`À±ÞhðøÎ|Ä—ñ®ôFÅD”j m­†™ÊéJö_Ïžèn„Lœ¼íBõu" },
{ "l","lai","À´‚gÀ³áâáÁäµ—…ïªí‚|à[ÆßFŽò†‹‹@ª[ˆœZÈRêã—®¬[íù¹XÀµ¹sånäþñ®òQüHù„öDô¥Òs²AÙ}ÙlÙ‡îmîsù`ÌDž|ž°]»[ÈZ" },
{ "l","lang","à¥„ÉÀÉàOýœšDÝ¹ÀÇ—OÉvÀÈ‹™ÀÅ”Éïüï¶³„¬˜ÀÆÍ™Å…¹^àHÜqòë˜¸äZæƒÀÊ–JŸRÉ‡‰iÕL–TãÏ~ÀËˆ°Ýõé" },
{ "l","lao","ÀÌ“ÆÀÍ„ºÀÎ·ÀÔ›Ðßë†[áÀ„Úï©ðìƒX÷ÁÊ‘Ž°A´‹ÏoºŒõ²ç„î‘ó€ÂSÀÏÀÐÇN†KÀÑªJ`èá«™îîã™â²ÞLÂçÀÓéjÂä†ëÀÒñì‹ª‡Z³‘Üx™QÂgÜ~³z»”–U" },
{ "l","leng","Àâ†}Ü¨Àã¶ ´GËJÀä‚’ˆÙã¶±œÛk" },
{ "l","le","ÀßàÏØìêbàÆIß·’AšíÀÖ«Wãî¸…³iÀÕ˜SðEí‰˜·º{÷¦ö˜÷w–Y˜V" },
{ "l","li","Á¨„^ÀöÀåæê„{ÇVÀêÀëÀæ—~Àç¬P“Ç—à¬ À—ˆð¿çÊòÛÅƒ¹]ÀìÝñ„˜æËŒV˜»Á§±LØ‚ä‚öâÀèÑŸ ÓÊk¿rÀéî¾äœÖ‚árÏ[áëxÞ¼‡­ß†”Á­€ç\ùvöPÏ~÷óó»ÐGž¦‡ÎÌyŒCc„°èg»h·ˆÀ{óP÷~ûZÀñþGÀïÀîÙµbhqåÎæ²Àíï®ÑeýŸÑYØNä‡Àðå¢¶YõŽõ·÷¯ßŠ÷k÷u™ðÁ¦ÀúÀ÷ŒÞÁ¢–^Àôß¿ÀøÀû…«ÜÂÛÞÁ¤›lŒüèÀÆnÀýìåðÝÁ¥ðß³PÚ\Ù³ÀþÀóÆÛªèÝ–Ðéöáû—«†Àõ–Û›ã›ËÀòÝ°ŠÚíÂÀù¶wØªòÃÍjôÏÁ£óÒ‹Kà¦ÃšŸ—˜Àüƒú…õÈîºÍÁ¡ö¨øE±ŸãW…“ÉWÉT“…äà‰Wü•·šs¬—…–¾FÎGÎ€óöøtë_„îšv•ÑŽ_žW™‚ë`óœ´•°O Ø iÏ‹™ª•å¶]”^ƒ¢‡³”iËž­|™µžr‰ÈµZûµ[Ï  s¼c±X™À­‰°áBƒ«°[µ`û•úbÞ]Ó€ÜV‡Ñ”ƒ™æ×Þ^ìZ­–”‰ìc†o®M²@»šôƒÂˆ¸{¼Hõ”õ•" },
{ "l","lei","ÀÕÀÛ‚ñÀ×É çÐæÐ®š˜ÃÀÞÀÜ¿w”bÀØ´ ™§­zÙúµWÀœÀnÌrèDÞ[èhìYÌ…™ïÀ}ýF…ŸñçÚ³›¤ÀÝ½t‰CÕCäðÊuÀÚ´ÀÙË‰‰¾°N™¦µXÏœž˜Ì{×|ƒ±‰ÍèˆûPÀßÀáÀà›æœIõªãîLî[åGéÛïKîÀhÌq¶a²" },
{ "l","lia","Á©" },
{ "l","lian","Á¬ÞÆÁ¯Á±Á°ßBÁ«—†ñÍÁªÁ®‘XÉŽiœÇ†ö…UŠY˜ŸÈÒœöãÂŽÂ´nÑž‘z…V„ ‡t‹¼å¥ïËOÎ‹Â’¿€ÂIÂ“Ö‹Ûš R™¹ì¡Á­æ`ºŸó¹žƒôHö–ç »^»dÁ²çöÁ³ñÏ“¢­IÝü‹Õà˜”¿šaÄ˜ÒcÁ„Ì`Ì_Á·Á¶ÁµéçˆäƒIÈj‹tœ‹Á´Ÿ’é¬¬…äò¾šÔåbå€ššæœönž‡‘ÙÀ~" },
{ "l","liang","Á¼‚ZÝ¹Á¹ýÁº›öé£ÞcÁ¿Á¸Á»õÔÜ®˜ÅÝˆò@¼ZIÁ½ƒÉÁ©‚z†|†¤’ëÃžÑoÎW¾n÷ËôuÁÁÁÂ†]”‚ŠÁ¾ÁÀ†Èœ´ö¦ÝgÕÝvåy" },
{ "l","liao","ÁÃÜGÁÉÁÆÁÄŒ®‘lÄkÁÅÁÈÛxÁÊçÔàÚùúå¼‹»â²ß|”¶•Å­VÄ‚ÁÇ˜÷¯ŸðÓ¸XÏi¿ºƒÙ’ØIÛŽ\Ë€Œ× r vïfósïmúÁËîÉá‘à€Þ¤‘’²téRÞÍŒ³žÒÁÏÁÎÁÌ¸NÁÍç‚" },
{ "l","lie","ÁÑÁÐÁÓ„ÃÙý’žÆ”Þ˜ßÖŠ²ä£›¼Ûøˆ´ÁÒ†`ŸI–ïÞæþšÁÔªdÍ}Â~ôóŸ­Ž{ïVø•õhƒ•«C”Y ÚõñôQ÷à÷v’£" },
{ "l","lin","Áà…›ÁÚêtÁÖÁÙƒäßø…ÁÜ•—»‘ÁÕ´@ôÔ¹ƒàëOý åà«á×ª•Éê¥Ÿû”Ý­UÁØî¬Á×®žÅR¿šÂLû‹ÞOçlÁÛžŠ‰Éò•÷ë÷[ÈHzƒjÁÝ„C“ÔÅãÁ‘¬âÞ[éÝ™_°R°SÁßt‡ÁÞŸiÙUÝþ˜ð®Vì¢éŠÜCÌAõïÜ\ÜkÞ`" },
{ "l","liu","ÁïìÖ¸Û‰Áõ®qä¯”åÁ÷ÁôÁð”é®‘Ñ^ÁòåÞì¼É]Ésæò‹ˆÍÁóïvÁñ¬ŠïÖÁö¬–„¢´eñ‡ûm˜ñ®œéH­]°@ÏYñœûˆöÌæy‡®žg‘ËË˜çBïdòtçsïiúVö†ò˜Áø–Î—B«€—Pç¸ï³¾^äÁSŸÞ™PÁ[‹ôÁùÂ½Á’A‰gÂµðÒ´zðsìCëwïfôjúw" },
{ "l","ling","ÁîÁæ„cÁéˆ{àò‰çÜß¶ßÊŠ– ÷ãöèÚ–E•`ê²Áá°s¶{Áå¸nû_³gÁêÁgÁèÁâœR’’èŠêèù¬OòÈñö½@ÐeôáÅz¸ ç±ÁçÔfÝCÚšµ’ÀâÑkÉˆÁäâéqÁã¾cÊCÝsë‘ñ|ûwøoõCë™öìä™Ê™Î UëëžýhöNÛ¹‹øýg™Ðáû™™ô ‹ý’ÁëHÐ‡ÁìîIŽXÁížâÌhì`" },
{ "l","long","ÁúÜ×ÁüãñèÐ•oççëÊ¸o±€íÃÁûÁýÂ¡œ¬œöV˜™ðÁþº\ýˆñªçXìNŽaŽbž{‡µÌd z™É­‡•îÒt–V²”µaµbýýŽ»\ØLÜ[Ã@ÐFÐHì_èxóGûTÂ¤Â£Â¢ÛâºTë]ƒ¥‰Å‰Æ”n¸_Åª†U—YÜÚL" },
{ "l","lou","Â§²kÂ¦ŠäÙÍÝäœ¾à¶Â¥U‘fÊVßsI‡DŸÓ˜Çò÷ñïÂeÅ”ÏNÜ}ÖŒ÷ÃótíVúyáÐâ“§‰v®RÂ¨ºtÂªŒÍÂ©ïÎðü¯›¯œçUÂ¶þo" },
{ "l","lu","ààß£Ö}”]‡£Â¬Â«Â®ãòÛäÂ¯–›èÓëÍðµÅyôµ«SÂ­öÔñeô—±R­o‰ÀžoÌJ]‡´«G”m t™¾•ì­ˆÅF²’ÆA»VÐBÀžÀrèzózïB÷|ûRüuÂ±Â²Â°ûuÂ³³”Ì”ÉF‰oÂ˜Äô”´{éÖ“ï·tïåžZšÚ™©Å›æ”çœÆ@èuÁùˆP®fÂ½ôÂ¼ ˆvVÂ¸éûê‘„ÎŠáåÖÇŠäËœGœO³tÂÌÂ¹—¶Â»µ“¬f„ÛƒJ„—¶˜±J²FÂµÙTÝ`Â·»œ¹‚Þ¤ÊILäõ“¦‰nê¤Â¾ŸÑ˜ÌÄrÛjáXÚ€åhä›åj·cÂºÊ€è´óüÏFøšÛòJÞAº˜ðØºŽº—çGùcùnÂ´öIòƒçeÂ¶»Uú˜ÌéñŸfé^â„ëªÞ_" },
{ "l","lv","Â¿ãÌéµé‚Ä|šÑ™°ËƒóHÂÀ…ÎàLÂÂ‚H’ ’ÇÞÛÂÃ—oµ~ÙÍÂÁïù½…ÂÅÂÆƒEŒÒëöñÚäXÂÄÒ@Äo¿|ƒ–·„ÂÉˆ‡ÂÇÂÌÂÊÂÈÈ„¯ÂË¾G¾v‘]Äy¹˜¿†„ížV l™¬èr" },
{ "l","luan","æ®ÂÍÂÏèïÂÎÃ‡ð½ÙõÂÐöÇùFŽnŒDŠaŒ\ˆJ”ž¤™è•ðÁcÅLˆKÌ‰ž´èŽ°f°gû[ÂÑÂÒá›y" },
{ "l","lue","Œœ®ˆ·Däsäx" },
{ "l","lve","ÂÓÂÔï²ˆG" },
{ "l","lun","ÂÕ’àÂØÂ×ÂÛÆ_ÂÙÂÚàðöÂÖ‚ê‡÷œSÇ’‹E‘—‹Ä@´KÎFÂb¾]Ý†Ûiä—öMˆÀ¥¶—œÓÕ“†í´ˆ" },
{ "l","luo","ÞÛ†ªÂäîb‡ÓÂÞÂÜÂßâ¤ëáÄTé¡ÂàÂâÂáïÝÂÝÁ_ÓTæ ò…ÓZó»ƒ¬ß‰Ì}«M”{™åòŸúŸ»jèŒð”‡Þ„sÙÀÉzÂãÜsñ§ÙùÅI•ï°eãøÂå¿©ÂæRÜýÂçÀÓ› çóíÑ³Š½jõÈ¹JÔ›öÃ ÎÞûäðñ˜ùBõižTÀzõu" },

{ "m","m","ß¼…ÞÄ·" },
{ "m","mai","ÂñËhö²ÂòÝ¤ÙI‡Xú”Û½ÂõÂóÏ‰ÓÂôÂöÃ}ûœÐ]„êÙuß~ì@ìAÊ{" },
{ "m","ma","}ÂèŒIÄ¨ÂìÂé‹Œ‹°Ä¦Âð†á¯q¯rÊh Ðó¡ÂíáïÂêÂëñRªwœÔ¬”´aÎ›æ‹úiö‡è¿µlÂîéUßé‚Ø²K‡O¶M˜qÁRñˆôK†xÂïôÏW" },
{ "m","man","Âñ‹ ò©î”ŽÂùÃ¡ÂûÂø“¶‘`˜ÑÂ÷²m÷´Ö™ðz÷©ôNôMö ÐUŠÒŒÌœºÂúMòýÏ\æž²–Âüà„ƒKÊAá£ªƒÂþçÏÜ¬Âýì×˜´ïÜÙ¿zçNÒZ" },
{ "m","mang","Úø ¯Ã¢…¹šûÃ¦Œ´–x–nÃ¥Ã¤±Z¸ˆ}Ã£……Ží†WŠÁªK›À ½âIèšíË¯gÍ{ä€ñ ÌMÃ§Çƒ³‰ÆŸ‰ÜäÝòþÏ‘" },
{ "m","mao","Ã¨ØˆþYÃ«Ã¬–‰ÜâÃ©êóì¸ÁEÜšáFœ~ˆé—ûÃª÷ÖãwòúšÓóå^ó±ùšƒÓ‰îÃ®‘ùá¹ã÷êÄÃ­¹FãTÉ‹ƒÐÆd°pÃ¯ƒØÃ°Ã³–µ±gë£Ò‘ÙóÙQà|ÈrÃ±‹ušÊ•§è£ØàŽÃ²î¦Îcí®š¸" },
{ "m","mei","Ã»›]ˆbÆ€Ã¶Ãµ–ÏÃ¼ÃzÝ®àdÃŠÃ·¬C±ŒˆõäØœŽÉBÃ½â­áÒÄP¬s¶Cé¹˜MÃºÃ¸˜ŽïÑðÌ‰räYÃ¹æ[ÛÃÓ”uúBüqš°Ã¿ÃÀƒñ’¯ä¼Áo±œ„‹Z‹‰Ã¾‹Ê BÜzæVüeÃÃ’{›iñÇÃÁµ|±tÃÕÃÂÃÄÚ›ôm¯cŸ¢÷Èíi²SÎn¹Ÿ" },
{ "m","me","WÃ´„õ’CŽÛ‡¡žQ‡ª‡¼" },
{ "m","men","ÃÆÃÅÃÇÞÑãë«jîÍéTéY‚ƒÇ–’Ð­J·`å{ÌŠìËž•¹ Fí¯‘¿—È" },
{ "m","meng","’úÃÉ”BŒ´®mÃ¥òµÇmÃÈœÉÃËà‘ÝùÎ{à–ƒÊpÞ«˜ýŽÌ÷‘ºÃÊ•äšÙëüûsíæõ’²‰ô¿²“ðìWìXîŸûLö¼ÛÂƒáÃÍÃÌòìô»åi«BãÂó·öQü€ÃÏÃÎ‰ô‰õ‘¸ìD" },
{ "m","mi","ßäÃÐ²[ÃÖìòÃÔâ¨ÃÕÉoÔ™ÖiÃÑÃÓ÷ã÷çû†üOËz›”C¶[ÃÒû”ž…«JÌjéSÞÂ‘Û”}­Œ †á‚áƒûJáˆÃ×ØÂÁdñ›m›¦åôôÍëßœ}ÈŽÊUãðŒBž§Ú¢ôéãè›^ÃÚ\åµÃÙµzaŒsÃØÒ“Ò’ÃÜœPÃÝÚ×ÉqŽ¶Òš‰QÃÛ˜aü†ÊZDeà×ŸÇƒç˜ÆŽÈóÖkº€™—Á]ü“ÑA»…ÑQ—Ò‡Ã™ë" },
{ "m","mian","å²ÆP–uÃßÃàŠå‹iÃÞ¾dÅXÎe¾‚‹î™†™¡²Š²Œ²DšóãæÃâÃã‚aííÃääÅ‚Á„ÒÃáÈx†»äÏ±”ÃåÒëï¾’Æìtõ|ìrÃæû ü@¼EüMüI" },
{ "m","miao","ß÷Ãç‹bÃèÃéðÅ¾ˆ‹·ù‘„¹èÂÃëíðÃìç¿íµ¾˜ºFÃêåãÃîÃí¸k«QŽøçÑR" },
{ "m","min","ÃñçäÜåŠ“áºB•F•G±a³RçëÁF‰’ÏçÅ¬Y¬\¬z´C¯xâŒ¾r¾‡ä øsæFÃóƒí„bìãÉö¼Ãòãýë”•„ÇÃöÃõÃô¸œéhüwÇœ¡”°•¡íªé}ƒo˜‘‘‘Oº‡÷ªÏŸöšˆ„¹I" },
{ "m","mie","Ø¿…¸ßã†_ŒPÃðžû“}œçÃïËIøpŽÏóúžf‘Ì™­µTóºÐ`èf÷x”æ" },
{ "m","ming","ÃûÃ÷Ãù±b›³ÜøÚ¤±…–LÃúàpÉqäé‹“ªuÔšã‘øQ˜iêÔî¨ÃøÓKâŠ±ƒü‘Dõ¤Ãü’ø" },
{ "m","miu","ÃýçÑÖ‡" },
{ "m","mo","Ãþ‡±ÎÞŒ­ÚÓæÆâÉÄ£Ä¡Ä¤÷áüNÄ¦˜íÄ¥¼UÖƒÖ„æÖ‹ß”VðxÄ¢órÄ§„¯ð‘ÍòÄ¨‘½Ä©ˆ\Ã»Ä­Ä°Š‹ÜÔŽ’éâšzš{–£•bÂöŽ”Ã°ÄªÇe°tï÷³]±u±‹Íà½Q±‰Ø{Íˆõö‰sÝë†ùÄ®Ä¯ª…ã€ì…ôŽüa‹ººÙÄ«²a²hñ¢ïÒÄ¬õøÏ_æŸË j°Zò‡ÀgµcñòC„õiÑQáJôž‡Ý" },
{ "m","mou","ßèÄ²„ÀÙ°…ÞcÄ±íøòÖçÑÛ_Ö\öÊüEøœ¿ŠÄ³" },
{ "m","mu","ë¤šÒÄ£Ä¸ÄµÄ¶Ä·®oÄ´®r®yÀÑ\ ¸Ãk³c®€®®ŽãaÛ[Ä¾Ä¿ØïÄ² ñãåÛéÜÙÄÁžÑš»ÄªÇ€Í]îâë‚Ä¼‘HÄ»Ž¿Ä¹ãfÄÀ—úÄ½Äº•½ÅëŽ¿}ÄÂíJ…ž˜V" },

{ "n","na","ÄÇÄÏ’‚ÄÃ†ò“ïÕæ“pÄÄë~ÄÚÄÅ…ÈŠ{ÄÉëÇàGÄÈÄÆñÄÐœ¼{¸™Ü˜ØvÞàØyâcì„Éiô›„Mô‡" },
{ "n","nai","ÄGŒYÄËÜµÄÌÄÊ¯GiÞ•ÄÄ‚™á‹èÙ¦ÄÎèÍÄÍÝÁœ‡Ø¾Ñ”Î—år" },
{ "n","nan","àîàïÄÐ’o––¹‚OÄÏÇ~®~ÄÑŠÉà«éª•¨ÖQëyôöÈl“Dœ¯Ÿ²ëîòï‘Ú‹Rßa" },
{ "n","nao","Ø«ßÎFÄÓpîóíÐòÍÔiâ®´L“ÏŽH‘Ïu«D×D‰ëçt«LŽjÛñÄÕ˜ÄÔÃ—…DˆßÀè§‹šÄX´ZÄÖÄ×émô[Äž" },
{ "n","nang","ÄÒàìe‡°ÐLâÎ™òð–“îêÙß­ž²ƒ²ýQ" },
{ "n","ne","ÄÄðÚÄÇÚ«ÄÅ’f±„ÔGC„õü“¿L" },
{ "n","nei","ÄÄŠÌÄÙÃ•ÄFðHõƒõÄÚƒÈÄÇšßšàåM" },
{ "n","nen","í¥ÄÛ‹¯" },
{ "n","neng","ÄÜ" },
{ "n","ng","àÅßí" },
{ "n","ni","ÄÝÄáÄàƒºÄØÛèâõ»u¶vîêà\ÄßŒÉœNŠöâ¥ÍeˆÐ—´ÛCâ‰ñDÎUÂ‰ÝrÓrØƒöòÄÞûŒöFýuÅMÄâÄãÙ£ÃÆsŠ… ù’v–«’íì»•ŒTëWƒŒƒ“Ëo”MÂžŒÛšîÄæÃfêÇÄä±zˆÓ©ÄåîÄç‹¤íþ•¿¿QÕyÄ‹òáÚ™†RøM" },
{ "n","nian","ÄéÄèÄêýž¶j†PŠ¨¶|Õ³öÓöóõRð¤öT›ÝœVÄíéýÕ·ÄëÝ‚Äì“ÓºvÛ…”fÛœÜT…`Ø¥Äî†ˆÛþ¶ÅˆŸˆ" },
{ "n","niang","Äï‹Ý‹úÄðá|á„" },
{ "n","niao","ÄñÜàôÁøB‹–ÑUÊ\˜ÒÑ™‹ØæÕÄòëåÄç" },
{ "n","nie","ÄóÄí“IÆ}Ø¿Ž‹ˆ[–¨ÚíÄùÄô¯[ô«êŸÇŒÄöœ¸”¤Ôà¿ÛWÛfÛh“µÄ÷Äø‡y˜®ŽLºQÅYåRò¨õæÂ™‡§æ‡êEÄõŒZ™ÇÞÁ»H‡ËýmèXŽqÐA¼b¼f‡ÜÜb×‘è‡ïDè" },
{ "n","nin","‡áÄú’ŒÃ€" },
{ "n","ning","ÄþÆrßÌÄüÅ¡Äûñ÷å¸Œ|Œ‚Œ„Œ‰ŒŽÄýƒ‘™F”QªŸ‡“Ëf‹Þ™ŽÂœè_ôVûH²…Øú‚AÅ¢‚žÃô" },
{ "n","niu","æ¤Å£ «›SáðÅ¤Å¦âîžÈ–ƒÅ¥¼~ÇyâoìÞÖ" },
{ "n","nou","Á…˜‰ññ«Aæe™“çõ–" },
{ "n","nong","Å©Ù¯Å¨ßæÅ§¶ŒÞrÞsƒzÊâ‡Ä“ \™`¶Z·vÒa×aáx™×ôTÀYÅª’˜’°°JýP" },
{ "n","nu","Å«ÂæåæÛ¹@ñwÅ¬åóßÎ³eæÀÅ­‚Õ“xÇ‚" },
{ "n","nv","Å®îÏ»sâS›\ÐZí¤–Hô¬" },
{ "n","nuan","ŠfœqŸÅ¯ð`" },
{ "n","nun","üQ" },
{ "n","nve","Å±Å°" },
{ "n","nuo","ÄÇÄÈÅ²—jÙÐ™Dƒ®ÅµßSßö’ýÞÞùï»˜`·LÖZÛåŸ¼K‘ÂÅ³¼X·zÅ´" },

{ "o","ou","ÇøÚ©Å½Å·Å¹ê±Å¸‰pŸàšWøk®TÄpšªÖŽËš™¯æ–útÅ»…¾Å¼ÄU‡IÊqñîÅºâæ‘Ya" },
{ "o","o","àÞÅ¶C˜jÞ‘ªe³€”ñ¹pøM¿L·iÀq" },

{ "p","pa","°ÈšñŠrÆtÅÉ°qÅ¿ÅuÅ¾Ýâ°ÇèËÅÀ°Ò’öÅÃóáþxŽÅÁÅÂÐ’Ž‡" },
{ "p","pai","ÅÄÙ½ÅÇªTÅÅ—“ÅÆ¹uÝ‡º’º”ÆÈ›fÅÉßßœkÅÈÝåæWêC" },
{ "p","pan","°â°è±eÈ_·¬ÅËÅÊãÜãÝ›–®ÅÖ°ãÅÌÛAÉgŽ´‹Š˜„“„±PÅÍ¿T´‘õçÛ˜æoó´žbíQˆmƒëÅÐ°é›cãúÞÕžÎ žÅÎÅÑÅÏñÈÔjœãîGäƒùbñáè‹" },
{ "p","pang","ÅÒÃpë„äè°òÄtìQ·ÂáÝ…€ÅÓåÌÅÔÅ}‹˜Ï°õó¦÷›ý‰ý‹ö„†çÅÕÓIóožÐÃTÅÖ±~" },
{ "p","pao","Å×’ÅÝëãÈaÅÙâÒÅØáóˆƒžäÅÚ ÅÛÞËÐˆÝNÅÜìŽûûƒŠEðå°’³hìsüBµPµ^†ÔÑŒ" },
{ "p","pei","ÅÞCÃSÅßÐ[õ¬êkÅãÅàÅâšÅïÂÅáÑpÙräž‚_¬ éÅæÅåàúŠ³”äì·«˜Åä›ÖàÎñ]ö¬Þ\É„" },
{ "p","pen","Åç‡Šåš\­›ÅèÈ†äÔ…ÜÂM†Ï" },
{ "p","pi","Ø§¶ÉÅúç¢ÚüÅ÷žÌ–ŠÅû’y ò øBÅø¼„±»¶u¶yîë”èÂ\Á‘ØwâtâWãYãó‹ñy´iÅüàèäšõBåC‘šæqµFµGÅùÆ¤êoÚéÜÅÃYèÁÅþš³Û¯ÚðÆ£ò·ÍoÍnØuÛýÆ¡šÅýŸÆ¢ÄM—ÀñÔâ”÷‰òçî¼ÄmëRô“õQ‰ªºfÏKùdõùÁ`Ü±ÐKÆ¥âÏØòÛÜÆkßÁ·ñÃ˜Æ¦ã›øaÕ|ïß¨‡ñ±‡ºÆ¨äÄ“FæÇ‹œî¢±Ù·K‡Æ§Ýê¶þž¯@Æ©êVûGúÞ‘" },
{ "p","peng","„úÅê›€âñyÅé³yÅë—ZÝJéo„™pàØñs´yÆMÅó¸†Çl‚‡’¸Ü¡‹ÑHÅíÅï—Ä“s‰X‰k‚õÅî·@ÅôÅð˜ÕŸÔÅì‘uÝ~åAÅñºUÅòíŠó—óŸó²ÏeÀeÌXíŽùiôJòuèmÅõœA°v’ü—ÕÅö˜¨ÛsÝƒ" },
{ "p","pian","Æ¬‡æ±âÆ«‹xêúôæÆªú@±ãæéëÝÄAçÂ—è˜FÙXÛMñÛójñ‰õäòNÚÒÒÙGÕ›Æ­ò_ò]" },
{ "p","piao","Æ±Øâ„ÜàÑ®Æ¯çÎÆ®”ôóªÂH ÜïhïgôwÆÓæÎÆ°ËiêQÝ³éèî©¿~ºgáoî’°ŽƒGÒæô‘GòŠ÷B" },
{ "p","pie","ë­Ò”Æ²•È“ÅÆ³Ø¯ÜÖçv‹±" },
{ "p","ping","Æ¹®jÙ·æ³›Ú³fÂ†ÆEîZ·ëÆ½ÆÀÆ»àZÆ¾…çÆºèÒ«rÃgÆÁ›¯Ž—ÇLÆ¿ÍgÆ¼Ž£œKŽ±É‘ÍƒÀ®J‰BŸvÔuöÒÝZ¸z„R¹’‘k‘{õG™qºqŒÎJ" },
{ "p","pin","ÞÕÆ´æ°³WµI·|ñPóDÆ¶«nŠÐØš¬VæÉÆµ‹åËdÌO‡¹²‹ò­ïAÆ·é¯êòšýæ³Æ¸–W" },
{ "p","po","ÆÓîÇÚéŒû²´ÆÃÆÂá•þ‡ÆÄáNîHŠáeáwçkÆÅÛ¶ÊX‡Mð«·±™‡¶ØÏŒžîÞóÍãO¹ñpgÆÈF›¨”’•^çêÆÆ³kŸBÆÉœ”ÉbÆÇn†R—K" },
{ "p","pou","ÆÊŠË’g’h’½ˆ¡ÞåÙö¹r…ð†VŠç Á" },
{ "p","pu","ÆÍë¶ê·ÆË’pžÊê†ÆÌ¯jäàÛ“äªõ‹ˆOÙéÆÎÆÐ¸¬ÆÏÇŽÉhÆÑƒWáT‰ªŽè±·oïä²rå§ÙŸçhÀbÆÓÆÖÆÒÆÔŸMÆÕ‡þäßÆ×•®ÖE˜ã“òë«™kïè×Võëç’±¤ÅmÅn±©ÆÙÆØŽ}†R" },

{ "q","qi","ÆßÞ€ÆãÆÞÆâÆÜèçÆààV‚ˆŠÝ’ÝœD¢ÝÂÆÝ—R—«”ªÆÛì¥ÆÚ”Œ¼–¼©‚úƒ[àÒ‰xÆá‘i¾e˜‘hÛpë’ôtõèçKù†Ø¢ØÁÆîÆëÛßôÜÎáªŒóÆæÆä…Æíµo”ÅÃXÆç¯OÙ¹Üù„~ê‹”çêÈÍTÍVÍ[Æê”Æ¸gñýÆèÜ™Ú–âHˆÎÝ½ÈWŽ©æëÆïªXÆé’åä¿Æå—Žì÷òÓç÷çùèŸÑw´J³žôoí æþDýRÆì¾L»žôëòàÎB­D¶QÞ­åW÷’Ësàœù‘¼™‡™–÷¢òUòTÄšùuù}õšÌI÷èôGÅ Ï“ò€ö’«Oû˜ÆòßŒÆóÜ»Æñá¨è½«^°žÆô…Ñ†uØMÆð†™†¢†šŠíç²—¤•’ôì¾_»üÖHêMÆøÆýÆùãàšÝÆûÆZÆú³H…æÆüžÅØ½±[Æõ…ýÆöÓ™–Öšâ™û†ƒÝÝœŒœ—‰‰óÔœë“ •´®P´\‘séÊ‡rÆ÷í¬íÓ´w´ƒ´„Ë~Ï„À™çƒÃÑzÏBº‘º“»K" },
{ "q","qia","ÆþñÊÝÖ“ü’‰¿¨gáMÚžì—ˆXƒîŽ˜Ç¢Ç¡Ãm³sš÷Ä" },
{ "q","qian","Ç§ÚäÇªÜ·Ç¨Ç¤ŠdšþˆTˆU›Fá©–eÇ@ÙÝ™÷Ç¥ÅOÇ£’Šã¥ÍOÇ¦Ø@âTŠú ¿ŒR’çÇ«â`ãUûeÇ©í©ƒL†éå¹“Ãåº‘aßw…•Õå½Ötîv™Œ™¥”o”pºžùkòq”q»RôRôS»`ía¤Œò’Rø’ƒqÇ°Ý¡îÔÇ®Ç¯ò¯škÜÇ¬‚¡Þç“bx‹`È“âjìyêùãQäE‰‰˜póéÊnÇ±“Á{Ç­™NåXübòcò`žKžö‘Ç³ëÉœ\Ç²ÄdÎS˜Ç´ç×À`×lÇ·„X½ÏËÜÍÜç‚]Ù»ŒÇµèý—‚ßÇ¶°|É`ã»‰qÊg¾PÇ¸ºGƒŽ˜ ºRÝ€¿y‰µ‹ì¸d»xæZçc" },
{ "q","qing","þfìiÇàÇáÇâàWÇäÇãŒxÇåœ[ˆ½àõšäÝXƒAòßÝpäöëõ›è[‰ð®_„…„Í†¦Çéš„—³ÈþƒÇèÇç•¦þ‚“÷˜½éÑÇæ÷ôÜÜÇêÇëí•ŽöFNÕˆö¥™”ÇìÇ×ƒõÙ»’áš ³ ôìóäìm‘cíàóÀžDƒ ³|™¼" },
{ "q","qie","ÇÐ°mÙ¤ÇÑÂÇÒæªÇÓ…‚ÆöÇÔ…L‰êü›­ã«›ù¸›Í‰ôòÜã»–AïÆóæºDÛoå›·lö@¸`" },
{ "q","qin","ÇÖÇ×ÇÕôÀóV‹]ÂšJ½ÒÕWôÓHîzñŸõŒ˜ÇÛÜËŽÜÃQñæÇØÍZÇ›ˆ²«Âl’ÍÈBÇÝñûâsâ†ëdÇÙ¬läÚÇÚì€‹ŽàºâÛ‘[ûÇÜàßøV”ÜàéÕ‘¦òû¯‘¥Ïˆùjˆa•T¸Úc—vŒ€ï·ÇÞŒ‹äuÏOßÄ…Â’aÇß†wÇ™Þì“l“åÌCžp" },
{ "q","qiao","ÇÄàbíÍÈ¸õÎàƒà…„äÛ^ÇÃš¨ÇÂØäófîN‰Œ‰§ŸòÇÁŽÉçØ´“å æ@¿”ÀRÚ‰ÜEèAÇÇÇÈÜñÇJá½ÇÅÇŸ³~†ÌÇÌƒSÚÛ˜“‰”ã¾½¶Êw‡a‹´÷³ ÖŸ÷éÔ˜òÇÆ¯ ´™ÂN×SÚˆ™ËË–çyíXî˜ÇÉá ã¸ó~¿Çê~ÇÎÚ½ŽÇÍÇÏÕVó|ƒsÇË“êímÇÊíI¸[ÜN" },
{ "q","qiang","Ç¼ÇºÇÀ”ÖÇ¹ê¨ãÞ«oÁm½«ª]†“õÄÇ»œÙ†óª}—¾òÞïºïÏÁz˜Œ ›¬š‘êè“¬º[ÖmïêÛ„Û–æjçIŠÇ¿Ç¾æÍÇ½éÉÊ@\ËN™Z‰¦‹Ô™{ ÅšÌbôÇÁu“Œ‰‚ñß¿‹ÀHçjìÁ†…†ÜŸÍÁ†" },
{ "q","qiu","ÇðH¹êÇñˆwnÇï¶k|òÇ‹päÐÈcé±œ©É’ûjÎ~¾ºEÚ‚·höúíFíGÏbù”öpöqÐ@ý•³ð…´ÆL’@Çôáì«U–_ÃFšüò°ÇóÍAÇöÙ´ÓˆÓ‰ÇõÓaá–†pÇiåÏÞ›½¼zšÂÇò—Wêäš‚âUí–œrœªåÙÛÏ¦±H°“½‡ÍŸªôÃÓpŽ€Ùgòø­GäMáb÷üõFþ•õ‰÷A“zôÜÌUþI" },
{ "q","qu","ÇøÇú…JêrÒÇÚ°Çýá«EÇü’|ˆo›µÃlìîÐ Çù¼ Çû…^ŸaŸŠÔxÇ÷¹LòÐ»–Úmñl‘tç”·ñnÕoüLõ@ó”üDÚ…Ü|ÓNôðùŠ÷ñòŒö÷OÚÛ¾”×ëÔÃaÇ†ð¶½PÁ”ÇþœTÈÝ@Þ¡­SøzíáÏJÏgè³öÄüšÞ¾ßž›‘ó „ÅJë¬™á»cñ³ÐRáé™êÜdèŠó½ûYÜÄÈ¡¸lÈ¢Ôs¸yÎƒÈ£ýxÈ¥…„`…íÂ^ãÖêïÈ¤é‰üCüzé˜ÓUÓYÐd" },
{ "q","que","È²È±ÀŽÉUãÚÈ³ÉÖÈ´…s‚ˆ«¬jí¨È¸È·³‚— ã×‰U“nÈµ°”´FÈ¶â‘U´`´_Ú|é  PêIµCùoµ]" },
{ "q","qiong","öÆÚö…oŒ^Çîñ·Üä–÷þ{óÌ¹HÚ^ÄŸwŸzÇíòËÍ‹Å|õ¼±žŸ¦ŸÅ²`¸F‘w™K­Wƒ’Ë}Ë•­‚¸\­Ž‹Ö" },
{ "q","quan","ŠIƒãªÈ¦‡ü—¨—Ñ¹ˆçzÈ«È¨¾íÚ¹çŠºÜõZ›§wÈª »éúÈ­îýÈ¬³o³ˆ»Š÷†­È›œ²½hóÜ Å¬†ÝbÓjÔ“‘ÛIãŒòé˜ØÛmñÈ©÷™÷ÜògöeŽk™àýjÈ§ÐSïEáëÈ® ãî°žïç¹¾JÌ†È°È¯ º„áíj¿X„ñ˜TêB" },
{ "q","qun","‰æ‡ïåÒŽ ŒlnÈ¹ÈºÁtÑd÷å" },

{ "r","rao","Üéæ¬ÈÄèã‹ÆÊ˜ïÒYðˆÈÅëN”_ÈÆßvÀ@" },
{ "r","rang","ÈÂ·y„ðƒ¨ÌZ«KžìüÈ¿ð¦Ü`ôX‰´ÈÀÈÁ }ÈÃ‘Ó×j×Œ" },
{ "r","ran","…ßÃVÐ€Ð…Ð™ÍcòÅÈ»ó†÷×‡YÈ¼¿‘ƒÑÈ½ÜÛŠ˜È¾«z‹v™L" },
{ "r","re","ÈôßöÈÇÈÈŸá" },
{ "r","reng","ÈÓÈÔÞwµiÆeê—Üµ" },
{ "r","ren","ÈËØéÈÊÈÉ–ZáÈÎÆ\ä¶eôã…øžÈÌÜóÇY–ß–á¶‰ïþÜrÈÐ„UÈÏ×šØð¡ÈÒŒãâ¿ ®Àéí–kÈÑÈÍÃMµsŠžñÅ¼x¼ŒÜÓ•ÑG—eÝØÄH½Vâmïƒìzì~ígïšÕJ" },
{ "r","rong","ÈÖëÀ–ÑÈ×ÈÙÆŽáõÈÞš¿tÈÝŸV‹†áÉ“r‚æ½qÁs“mÈÜÊ‹’ÈØ˜xéÅ˜sÈÛ·Z¬Œ¿^éFÑ’òî˜ŸÈÚÎñŒ‹æŽV hægžq•íÏ”ÈßŒ]ˆc‚ÔÝPšÕ·\" },
{ "r","ri","ÈÕóR‡ðÐzâJâVâ~ñ_agfihnutr’£Å–ècÌƒ" },
{ "r","rou","…œ¶bÈá»€Ã…È|‹YÈàœn˜Q¬yÄ\Ÿ§ÎjôÛÝŠõååˆ÷·òk­~ù’ökíqÈâŒ`×k" },
{ "r","ru","ßÈçûŽšÈã’–ôï¨ÑMœx¹TÉSãœÎpÊ‡Èåønø›àéÞ¸å¦Èæ‹ç•ãñàÈäò¬á}îž÷pÈêÃNÈéÈèàr”JÈëä²äáçÈÝê†ä‹‡Èì¿d’C–dŽ]" },
{ "r","rui","®c¾qÞ¨—MÈïÊt™GÀBÌGÌH‰ÇÜÇ›IèÄò¸ÈñÎTÈðî£ä„äJ…±" },
{ "r","ruan","ˆë“É‰¼ÈîÈíëÃÂXÜ›‚¢‹\¬}ÄQ´M¾Ý‰­wµO" },
{ "r","run","ÈòÈóécét™˜ôÄŒ" },
{ "r","ruo","’µ’Ú…ªÈôàeÙ¼Èõ‹SœcŸx—íÉmóèºO kö}ö”úU×" },

{ "s","sang","É¥–øÉ£†Ê˜šÉ¤ÞúíßÑ˜òªærî‹" },
{ "s","san","Èýq²ÎÈþë§šÉ…xšÐ ÑôLÉ¡‚ãÉ¢ôÖâÌ¼R¼V¼W¿™çDçoð€‚^éd‰Ð" },
{ "s","sai","Ë¼šºà“HÈûÈùšË‡TàçÈúî|öwÈüƒwÙº›†ð" },
{ "s","sa","ØíÈöÈ÷ÔQìƒ¥ž¢ÜaØ¦è•ìªëÛÈøâlñ`“—Ê”ïSË_™¨’PÆjo–ÓëMÌƒ" },
{ "s","sao","’ûÉ¦œÐÉ§ýçÒÏA¿‰öþïbòXò}ö…÷fÉ¨’ßÉ©Ü£ðþÔïš×ëý²„ór" },
{ "s","seng","É®ôO" },
{ "s","sen","É­—Ø˜¦ÒI" },
{ "s","se","é~É«››É¬–ÜØÄœiï¤ëšm†ÝÉªÈû“ºšoäC®æí“ö‘­¯™ð£­i­ži·wÀNÞQ·†çmÖ ïo¿L÷n" },
{ "s","sha","É±É¼É³É´É²É°š¢É¯†~ªQ»}¼†êýï¡—Eðð³“—É·ÊeôÄ˜f˜×Ò­öèô‹éŒóšõõæ|À\ÉÝÉ¶Éµƒƒ‚ÈSŽ¨†—ßþ†ÃÏÃBàÄì¦ÁœÁ ¹€é„ö®" },
{ "s","shai","É¸õ§ºYºkº»iÉ«É¹•ñ" },
{ "s","shang","ÌÀÉËéäÉÌõü¶@‚ûÊKCgÉÊ‘^š‘ìØÏDÓxÖ…ôlÉÏÛð‘ûÉÎÉÍ˜¾Ùpä–çLÚJèlAÉÐŒ¬vç´¾yì " },
{ "s","shan","É½áêßÉ¾„hÜÏÉ¼îÌÉÀÉ»æ©Š™ªG’´ô®ÉºÕ¤–ÅÃˆ¯ZÉÈÜ‘²ô¸–áŸ‚ÞõÇ„š“É¿Ž»‡Aäú¿õŠ¿„ëþ™cÁÁƒÉÁÉÂê„žèéW•±˜ŸšŸÄÓ@Ú¨ÉÇðÞµ¥Ó˜ØßÚ]µ§’ïÉÆ—ÖìøãˆæóÛ·ƒRÉÉ‰‰Žþˆþ…˜è”»š`ÉÃæÓ¶UÉÅ´ŠÉÄÖb¿˜óµÏ€ç—ðƒ÷­ò~Ù ×iž¨÷W÷XˆZ" },
{ "s","she","ÉÝâ¦ÉÞ®Œî´®ÝfÙhÙd™ÉàÙÜÕÛÍFÉßê^ÞéÍ…Éá’ÎÒ¶ØÇÉèÉçÅh…‡Ê°ÉæÉäÉâÔOœh›õäÜÉåÉã“”ÊJ‘bì¨Ï‡ísòM÷ê‘Øž—”z™Ý" },
{ "s","shao","Çz„ÉÓÉÕÉÒÉÔŸ†Èp”ïòÙô¹óâÝiÇÊŸýó™õ}É×ÉÖè¼Üæ–¶«xÉØÉÙÉÛ…pÛ¿ÉÜÐŒÉÚŠ¾½B±¾KäûÊ–" },
{ "s","shei","Ë­" },
{ "s","shen","Éê’JŒæÉìÉí»pê²ÎÚ·ƒßÁAÉëŠÉð–¸šá·Œ«|Š·»rÉïvÝ·±m®`ÉéÉî¼”žƒÂÔY—ªÑ[ÈÉ†ÁKÔ–ôÖ®eÊQ¼B÷“ñ‘ËMŸö•Üù_õ˜öYöŸÊ²ÉñÉõãhö•ß•zÉò² ÉóßÓïòÚÅ×ŸÉôÔBäÉÕ”ŒîTô•Ö²sžc‹ð×}Ó\ÉöëÏ‚L•Y›Ø±sÃŒÉøµŠÝØÄI¯}É÷õé©ò×Í–Bäv¯”ˆÞ˜Y»]" },
{ "s","shou","…§ÊÕÊìÞÐÊÖÊØÊ×ˆ–ô¼ÊÙÊÜá÷ÊÞÊÛÊÚ›ìç·¯lÄf‰Û‰ÞÊÝ¾Rª•«Fæ" },
{ "s","shi","Ê¬Ê§Ê¦…ÚßŸÊ«û\Ê­þ˜Ê¨Ê©ŒÆ›¸ŽŸ½JâPÈžÊªœ¢œáœÛÉNÝéãAÔŠª{¬‹õ§øOÐêø[¹•ÎtÑ öõåœñöXö‰úPÒ|á‡Ê®â»Ê²Ê¯Ê±Ê¶ÊµŒg•EïzÊ³µuìÂÊ´Ê°Š¸]ÛõÝª•rßYŒœ›œÒ‰PãJŒ˜tÎgöåüœü×RöˆÊ·Ê¸dõ¹Ê¹Ê»Ê¼ÊºŒjƒ½¹Eâñ‚Ê¿ÊÏìêÊ¾ÊÐÊÀFÊËËÆ…bçÊ½‘÷~ÊÂÊÌÊÆÊÔ…áÊÎÊÓ–ÉÊÁ–§•gÊÇêÛÊÑ^±cÖÅÊÃƒàÊÒÊÊÊÅ±i±xîæóÂéøžø–ò¶ƒá‹Ò•ÊÍÙBß±ÚÖÊ“J«ÊÈÉP„ÝsÝYóß±ÓlÔ‡â‹âžï—ãvÊÄÅkßmŠ]ðSðOäKÕžÕœÌÊÉ‹Òß}ó§ÖuºáŒÒnWÞyÛ¸bÖŸ³õZº ö|»]÷t" },
{ "s","sheng","ÉýÉúêj…ÖÉù”Î–™•N›ˆ õÆê…«{Éüš}ê’óÏœ¤Ÿ„ÉûãHå•Â•ü›ù|äÅÉþ‘™¿I¿ŒÀK×WÊ¡íò‚¯œƒÊ¥Ê¤êÉ•…³Ë„Ê¢ÙKÊ£„ÙáÓ¬]Â}‰˜˜|ÊoÙ‹¸i•úþJ™T" },
{ "s","shu","Êéì¯Êãç£êxÊåÊà–€æ­Ý±Ù¿‚‚Êâ¼‚•øŸYÊáàgÝÄŠì’æÜ“ÊçÊè¯EÊæ¬`½ˆë¨šÌÞóÊäÛSÛ\Êß˜ÐÝ”õ_™]ƒ©”dùeŒ«ïøÊëÊêÛÓÊì­qÚHÊôÊî•¤ÊòÊóÊñÊýÊð©ÊíË\Êï°PËŸÒeÒlŒÙÊõ–XÊùÊøãðÊö‚JÇO†CÊ÷XÊúË¡’¿ÊüŽõÉD½RÐgÑVŒ¥ã_ëò¸wÊûÊþäø”µØQåfë—ò˜äùŽçTÌ ž‚¼^ÐO" },
{ "s","shua","Ë¢à§Ë£ÕX" },
{ "s","shuang","Ë«ãñË¬ËªëpóZæ×‹þò‚™Üú{ûtµdÆCóLûUw‘S¿Y‰už“þBç`" },
{ "s","shuan","ãÅË©éVË¨äÌÄY" },
{ "s","shuai","Ë¥Ë¤Ë¦Ë§Ž›ÂÊó°…i" },
{ "s","shui","Ë­ÃŸÕlãßË®šìËµŽœ›ä›çµˆË°¶ÑcË¯" },
{ "s","shun","˜JË±Ë³í˜Ë´ÊŠ˜ù²i²pË²ôB" },
{ "s","song","âìËÉ–…–œ–·Š»Ú¡‚‘Ý¿ŽôáÂäÁ—s³—áÔë‘¡™€ó þeËËã¤ËÊñµè˜B‚öØ‘ZÂ–ñžþdËÏËÎËÐËÍÔAËÌížÕbæðm" },
{ "s","shuo","ËµÕhÕfåùË¸Ë·îåË¶šF²ÝôÞ÷ª“éÃ´T¹›æl qèp" },
{ "s","si","þSÛÌæùË¿Ë¾¼iË½›qßÐ‚hË¼lð¸ÌŒ‚ÆçÁ‹wòÏË¹½zãj—ö¶Dït„@ØË¶LÎEïÈäFÁQäl¾Œ´fäùË»‡zËºÊ‘PŸùÎ‡æJï\ÏaÏzòlçrúƒýDËÀËÈËÄËÆËÂãá›…æ¦ÙîËÅËìëŒK–yýæáËÇãô›£ŠÙÙ¹–Ÿ–Æ µÊ³ï~ÃB›å›—ñêÂ]—tóÓâLÒ–¸rËÁËÃØ|â‘â–ï•˜{¶Tñ†Êœƒž[…†x”ñõ•ù‹" },
{ "s","sou","ÛÅƒð’ÈànËÑÉLÉrŽùCà²ªvâÈäÑì¬“–“¡ïËòôËÒágæ}ðtï`òp…®‚ÏàÕî¤ËÓÞ´Ë’™¸»PËÔ¯˜”\" },
{ "s","su","ËÕ®dËÖ¸@öÕ·dõ‡ÌVÌK™Å‡ÕË×«TÙíËß›ƒËà›«ä³ÇxËÙ«ŽËØ»šƒ—VóXËÞÚÕ‚ÑËÚÔVÃCûhãºËÜ‰Oßi‹•à¼ËÝœßËõßpÝøËÛ˜jåÄhÚxö¢ä_ðM´c˜Â˜É‘ˆš’¿ióùÖqË‚˜þ­XÛ‘ò“ú‰÷TÆj" },
{ "s","suan","â¡¯iËá…Wµ{¸Œ¹gËâËã" },
{ "s","sui","‰åÆVÄòËä›ÔÇ]†a‚‹Ëåíõî¡œñŸÕìšå¡ëmËçËæËìßU½—ëSól­…ÄŽžvËè‚Ëê³ZËîÚÇˆ¼ÀŸ«šqšrËé²B´âËíÜ·[‹ÓÙwÕrìÝ™p¶X­jËë·uåäÒ`¿…¿“ÀZ”ø×\çwç›í}Ý´" },
{ "s","sun","ËïáøÝ¥ŒOâ¸ïŠªs“qÉp˜ƒÊ˜ËVËñËðöÀ¹S“pé¾¹º‹æ{úZ–" },
{ "s","suo","É¯ÇjËôæ¶’­èøËóêý‚éíüàÊËòôÈ“™ËõÚtºwºz¿sõ€ËùßïË÷Ëö»Ëø†îœÅ•­Ñ–¬­Fæiææaæ•ßCœàÎR¬RàÂ÷_" },

{ "t","ta","ËüËý ­µkîèõÁãBäâËú˜d¶NÑÌ¤œÍËþ‰‡Ì¡õ]÷£«HöÍØí³þjÌ¢ãËªH»†„›ø‚èàªßeê`“‚äðšÏé½ß“éÕwåJ™\‡–ìŸÌ£êíOêFÜDêY‡Å×nÜc‚@ÈZåÝ [ÒkùŒ÷m" },
{ "t","tan","Ì®Ì°Z¯a†®ÅjØÌ²Ì¯‡cÌ± ”Z”‚ž©°cÌ³ê¼Û°‚„Ì¸µ¯ŠòˆÅ´ñûïÄÌµ˜WÌ·Ì¶‘…‰›‰ Õ„á]•ÒåU‰¯Ÿï™Aå£Ì´îtÀ—Ë“‰Â×TávØ×ZÀìþÌ¹îãÌ»ÈIÌºƒNãg†ú‘˜‘Ÿáa•Æ­fÌ¾Ì¿Ì½œž‡@Ì¼ÅlšU" },
{ "t","tai","Ì¨‡òŒLÌ¦Ì¥Û¢•@ˆrææÌ§ìÆžåÇ õÌöØïUÅ_¹xñ~õTƒˆÞ·”E‹ê™…»Fß¾Ì«‰ûƒèšùÌ­›LöëÄÌ¬îÑÅvÌ©ÌªâœÌ‘B M" },
{ "t","tao","‰úß¶|ÌÎÌÐÌÍìâ½dÔ|þ“†ÌÏŽµ‹—˜…¬•èºï‘¿_¿lÝýÖzíNíw÷ÒÞ„üä¬ÌÓ†GÌÕÌÒ—ƒÌÑÌÔÀ‡ßûµŽÑiÎI¾TìŠì’á[ä•ñŠòPðuØ»ÌÖÓ‘Ì×" },
{ "t","tang","ÌÀï¦œ«‡RôÊ„¨ÎvÌËËTïÛÛçMíUü‘ˆnÌÆÌÃÌÄ†°ào‚ÚÉyëGÌÂäçÌÁŸ¶˜yf¶Kè©ÄgÌÅ´g¼CéÌ˜üÌÇó¥ºLÛ}ÚZõ±ó«¼QæhðnðyêOúS¹àûÌÈ‚«ÌÊã®ÙÎñíÌÉéEæ†ƒ¯‘Ü ‡•ò²˜è’ÌÌ“­ Cç|" },
{ "t","te","ìýß¯ÌØï«í«äˆÏc–Y’PÃŽÀ’" },
{ "t","teng","Ä†ü’ÌÛ¯\Ž¸ÌÚÌÜbëøß‚ñÎŸ¿gÖ`þ—ƒ£ÌÙòvöŒ»L»TÌ„óIìL" },
{ "t","tiao","”þÙ¬ŽçÌôfìöÂwÆKÌõÜæÌöŒýGµx—lµ÷ÈVóÔÉ‚ÉŠö¶˜Ôòèäpöæì›÷ØõæxýföœŒi•q–IÃxñ»ÕA¸I”Ó‹àÌ÷ôÐ½rÒ›ÚqÌø¼g" },
{ "t","tian","ÌìƒÌŠõÌíáLìjüVìpÌïµè›pŒÄÌñÃbî±®x®ƒîäÌð®\ÈJœÌî‰\àÁãÙ“´[¾g¸K´k­kêDúcúlãÃéå‚†ŠœL¤Ó`•‹¬_Ìó±™¯tÌòï›¬™ÙqÓCå`ÞÝÅqø‰" },
{ "t","ti","ÌåÌÞÌÝÌàÌßäRþ”`úfúe…†Üèç°‚¨‹q¨Ìáœvç¾ÉßXÌä¶”ðÃÁHÌâ¬v½†Ù²VÑ|´YzÊƒÓ¾Ÿõ®Ú„ÌãÛ‡å÷–Öpõ{î}ùYòfù•ù—ö[¶_ú‚’«ÜnóeÜƒów‘øÌë›¢Ìê‚mÙÃåÑÌéã©ÌèŒÏ’óßP†—¹GŠµÌæ“WñÓÑ{šYóšËSÌçó›óž­ƒ‡¢»GÚŒ" },
{ "t","tie","ÌûGÌùÝÆÂzÙNÌúÍuâŸãŽƒcç“èFò…ãï”÷Ñ" },
{ "t","tou","Íµ‚Ê‹‹UäWæBÙïÍ·Í¶÷»î^Š‡¼}”«üWÌeÍ¸" },
{ "t","tu","Í¹Œ_Íº¶dLÍ»›Þ’Øœ£ˆàÈ‹¯fáäŒùWýC‡íÍ¼ƒòÝ±Í½Í¾Žêx’¼Í¿„—^ÍÀÝË“\¶•¯…¹\âŠÄ‰TÉ\Ä]O¤¬Ÿõ©ÛTˆDˆEñGòBå„ùIùúhú“ÍÁˆMÍÂîÊ†lâQƒ·ÞƒÍÃÇÜ¢ùr›BœÂ" },
{ "t","tong","¶²žçÍ¨¯]½pàÌÉŒŸ×˜¿ÙÚÍ¬Í®Ù¡¶±ŽäMá¼d†LªIÜíÛížú•zÍ©›ÏíÅÍU¶‚Í­±Í¯»ÚUÔ˜ÍªãPã~ãnï ÷‹„çÙ×äüª‘™H Õ•Ó–SÄ€ŸüšÔ·rÍ«õjÍ³Í±Í°½yÍ²¹c½ŠâúÍ´Ðh‘Q‘q" },
{ "t","ting","ÌüŽØÍ¡î®ÌýÂ[Ìþ…ˆŸN—H½–ì˜Â—ÂŸaÂ dß‹Í¢ÜðÍ¥Í¤Í£ÝãæÃµœsòÑ¹j—þ˜wéƒöªÎbÂŠÖFüžˆN®k‚KŠÇÍ¦›àŸPèè¬EÃ‰îúÍ§ïFÕPäbîc" },
{ "t","tuan","ªlÍÄˆCŸ™Ø‡ÍÅ‡âÞÒ„–“»`ˆF‘_˜¤ºi™ˆæ˜¼aúoú™®™‰’î¶åèœ¨Ñ‰" },
{ "t","tun","ÍÌ…×•H›âŸl–N‡pêÕÍÍˆd¶Ú÷ÆXÍvÜ”ëàØZï‚÷ƒôü`ë˜ÍÎÄ™ÙÛÍÊâ½" },
{ "t","tui","ß¯ÍÆÉ—Ë”wÍÇëPŒ¾˜úîjîkînôsÌL·~Û‚QÍÈƒUÛƒóh‚MÍËŠÑìÕÍÉÍ‘ÍÊòD [" },
{ "t","tuo","Ø±š×™ð˜ÍÐ’Lšú–lÙ¢ë…ú…ï›kÍÏ’„Ëµ‚MÇh’É’¨Ð›Óšï€›ñÍÑÃ“ñXô…õyêeÍÔêuÍÓÍÕ öAãûÛçèÞÍÒíÈ³aÐ†½FÔqõ¢õÉˆ÷ñW´P˜’ñjñ„ñ…éÒørõDü˜ùKònö¾ò™óCüƒ±Í×âÕÍÖ—ø‹µ™EözÍØèØš¼È[ÍÙÚ—šÍóêüÆÇÌE»XùD" },

{ "w","wa","ŒÜ°¼·Š„¾ÍÝÍÛÍÚæ´·“®|·˜‹z†œ†å®HÍÜ“‰œÎj¸Dü|íc”…ÍÞÍßßœØô…÷³[ÍàÂv†ìëðÄeÒmí€®B®M" },
{ "w","wai","†JÍáþZ†·¸áËÍâî“" },
{ "w","wei","…yÎ£Î¯ÍþžùÚñêžÙËåÔ†ÒÝÚÈ–‹náË½“f“GÌœÕ—Ü˜LÔ•ìÐÎ¢ÎOÎkÓA¿JÞ± V÷˜°LögöhÎ¡ìSàíÎªÎ¤Û×Î§‡ìãÇÎ¥àøãí›”_ežéífÎ¦ä¶á¡Î¨Î¬Î©¬^áÍ‹W‡ú†ÂŽ®ß`œ‘œ¿ ‘¾SÎ«àŒÉ–¬‘áWå…éõdžH‰Ã²‚ÓW à™ÞÎ°Î±Î­ÆYÎ²Î³ì¿çâä¢›¾æ¸ÇUÚÃÚó‚Î‚¥Î®™—|¯_³uó[ó]ó\Îâ«œwÉJÈ”Î@—Û•¥Ÿ˜ôºðô¬|è¸Ä^öÛ“ãéƒ^ŒÊlîQ¾•Õ†ÛcílËeƒ¤žSå—õnï]ítžwí|”ÍÎÀÎ´Î»Æ„Î¶Î¸Î·ê¦…°Ç‹Î½³}Î¾ÒÅÎ¹‹yâ¬Î¼Ÿ£Îµ´SÎVÎo´o ÒÎ¿¾“ŸÝÐlÐoð]õK‘£Ö^ÁWÏGÒEÎºðjÞEË—çA÷ìGÌvðŠ×~ÜZÜ^×ˆ’Ë‰ŠŽU" },
{ "w","wang","ÞÌŒ²Œ¶ÍôŒ·Œµ“ƒÇÍöÍõ©ÇwÍ^À ÀŸÍø´Íù¸ØèÍ÷ã¯ÈDéþ—Ÿ•™Í‡Î\¾WÝyÕs÷Íž_ÍýÞ‚ÍüÍúºÍû–R" },
{ "w","wen","•jÎÂœØÞdš˜X¬ÎÁ˜v¿AÊ•ØnÝ˜Ýœ÷—íMö€ö“ÎÄÆ[¨ÎÆžÉÎÅÎÃÍP¼yãÓ«œö©ñmñbÂ„¯‡øYøjô•Îé”ééšÏRü•ÀIêZØØ°ÎÇ…Ð’^…ÝÃWÎÉ—SÃ‚ÎÈ·g·€ÎÊŠpÃâãëÇ|†–œb“h“‹½ƒî‚è·‰eæ’ðw" },
{ "w","wan","›ðÍäØàŽ¦ŠþÍå‰G±›òêÍãŸ‰Ïž³Íè„\Ü¹š÷æýÍêŒñ’eÍæ¼w’ÂÍçØ™ÍéîBÂDÍð‚{Ý¸Íì±D†nçºˆ¾Íï—iÝÒÈXÍñëäÍí•ˆ•Š•–çþÍî—µÍëîµ¾U¾OÝnÛläjÍò…e…dñŠ€’ÌÃÍóÈfÂûÝkÏä[åsËH²oÏTÙ–æ~Ú@^–v¸Š¬T" },
{ "w","weng","ÎÌÎËœåûlÎŠÂæfúO„ØŠTÇÝî‰R•²²\”wÎÍÞ³®YÀšýN" },
{ "w","wo","ÎÎÎÐÙÁÝ«Èn†ªiœu›óÎÑà¸¸CÎÏÎÛbÎÒŠñŠð’Ó¥ÎÖë¿–†ÎÔÅP’Ü›ð‚¬á¢‹_ä×ÎÕŸsíÒ—çÄOÎÓ²Yö»ÄŸ­xüý}ßj" },
{ "w","wu","Ø£ÎÚÚùvÎÛ›@›AÛØÎØÎ×–gì¶ÎÝ›´ÎÜÎÙ¶ñžõ„·—àw†èÕGÕ_šT¹™ÎøŒæuöƒÍöÎÞÎãÎßÎáÎâ…Ç…ÒàNÆ•Ç`ßíŠÓ}ä´›žÎàµ¬@èžûcŸoòÚäoÊ‰˜î­NùMÏwõˆ×O÷ùú~þRÎåÎçÎéØõåÃåüâÐâäâè«bÎäÎê‚—ßAê‚ÎæŠÃŠÕêõ†•« ðÄ´I““ŸÊ¬Îè‘“ŽT‹³ƒ®W²yù^ÜRþ@ÎðÚãÎñÎì’NŒäŒíÜÌÎëè»Îïí•J³J…t”–‚WÎó„ÕÎòš’»|ÎîìÉðíæÄëFæð¶ì}Îíë‰ÎŠVœ×‰]ðÍŸ½å»Õ`öÈ¸PëœýHýIìFò\ÌFúF…ž–YöV" },

{ "x","xi","Ï¦ÙâßÎüÏ«èÎ÷’VÏ£…kÎöÎôñ¶ÃZÃ[ÎùYðœjÛ­Üç‚`¹ÇbÞÉŠÖßñä»ªLŒÊÆÜÎþšãÏ¢Ï¤Îø¬NÚTâRì¤•„—NÏ§Ï©ŸXŸ_äÀœl†ŒÝ¾‚ÝàqŸmŸyÏ¬Îú•‘ôâÁ—ô¸ôÑÏ¡±–¦À°ÎýðªñÓŸ›…wÐÉYÏªÆÙÒÎõŸÁÏ¨˜~òá¾kðFÒ Øg¯Œ´mÏ¥”Îû‡qæÒ‹Ä„DéØ˜é•Êì¨ŸçŸèìäó£Î‰¸OôËåaØ‰õèØló¬ØGØH²q O ×Ž`ÀG¼YùT×@õµÓ}ç^ç{ë^á@Žd‡½ ÞêØ xð„Ó‚÷ûú ÐPÓ„è„Ï°àEÏ¯êêÁ•Ï®†ÕÏ±ÉtÉj—áídÚv˜›ñÞË@ÚôÏ­Öæˆ÷žìIïeòwò„÷@ÒuóNÏ´– çôÏ³áãÏ²ÝßÈ}â|ãbãcÝûSåï‘‚š]ìû‘ƒÖLÖl¿u‰¸ÏkÛ’­t÷^²—‡ÖÜh…[…cÏ·â¾ŒÁÏµ…äÏ¸Û§Oï±__àS‚S†AŒÈÀ…š@ãÒ¼šâMÚiôªÅb‰IÏ¶—ÌìùøëK½”ÚVŸ¼‰€ Ì·G•À‘ïÊ“ÓB¿]ü_‘ñ‘ò´ŽÌŸðqô]ÀMêSìUÐaŒÚŽ|„LŽ‡‰ñÇ‚†{ÑQ³’†ÔÂˆ‡™S´—õ•" },
{ "x","xia","ßÈÏºØBéi‚ÒïPŸÏ¹ÎröyÏ»áòÏÀ‚bÏÁêƒÏ¿žÙèÔžþ{ˆ®ªMµ„«”íÌÁŽÅ{ê˜¼ÙÝç³ˆåÚ¹dè¦År”¯Ï¾Ï½´W´lÊ›¿[ÚYô Ï¼å’Ý æ_÷ïòhúTépBÏÂÏÅ¯KÏÄ»£ÏÃ²LÕ’‘³óÁ‰ìæç]ˆY—" },
{ "x","xian","™ÏÉŒÝÏËÏÈŠhüÙë¯–}¶iÆxìì–žôÌÝ²«ˆÏÆèÏÇõ£õÑƒMƒmã”ÏÊ‡Jí„äTåßËW‘œ‹Íåví†õrÒD¿ÛŸñM‹ü”s`ÀoúNÜ]ÒvÀw÷€ÏÐÁÏÒ…îŠˆÏÍÃjÏÑ±]ÏÌ’¦æµŠÞ‹MÍp½LÏÎÏÏéeéfÍ€ðÂðïœ¶†¥†éÏÓ®Qã•ÕtÙtÁ{·S½‘‹¹‹¸“ÍÖPá_Ý°B°G²vËµUûyû’ÚDúšú‘ú’ÙþªAÏÕÏ´ÏÔžóšÀò¹ê“áýÚ`Ï³óÚÍ˜õÐµ “{Œ°Œ¯ãŠ¹‘ëUªŽMªžÞºå‚ìÞî‡ŽÒ”gÌ\™Ì×]«Ní`ï@ž¶¼ûÏØÜÈá­ÏÞÏÖÏßÅ`±hêˆÏÜŠ«Š½sÏÝÇ{†Z›×ˆŸˆÉ¬F•ÏÚÏÛÀ‰±•½mÏÙ»˜‰dÏ×ÁwƒgƒnÕ^¾Q¾€ä}“È‘—™Z˜óåDðW¿hØR‰·üGÅ@žn«I¼`ö±ýE…ûÐjèv" },
{ "x","xiang","ÏçÜ¼ÏàÏãà_àlàmÏáŽûÏæç½àxÝÙÈeËGÏä¾|ÄÏåû‘Ýæø™Ö­ÏâÀvè‚óJ­˜½µßÏêâÔ–ÙÏé½|ÏèÔ”ÛKÏí‰ÏìâÃÍJ•}÷ÏÏëã}ðAößõaÏ†õœí‘ð‹ð“÷zþWÏòŠ¢ÏïÏî«“Ïóí—À‘Ði„âÏññÏð•ÚÒVó­‡»ç}÷P" },
{ "x","xiao","ž¼ž½Ð¤èÉ…ëßØÏ÷‚PæçèÕç¯ŽéžñÏüŒnåÐÏûû^ÌŠëªVÏô—nŸ^Ïú¯e¯hÁ›Ïõ³‡·›òÙ½‹“`óï‡EäìÛXšRäNÏöª”“ß‡^‘‹Ä…Ê’–ïY÷Ìø{ø“º}Ï]ÏSËr·nÏùžtÏvºón™Ï‡Ì‡Æóuújò”ÐDš®Ì‡›©àUáÅÏýÔFš¥ÕqÐ¡Ïþ•šóã¹q°~ºSÖj•Ô°†Ð¢„¿k†DÏø›ß‚jÐ¦Ð£Ð§Ð¥‚å”¬Ô‰Õ[‡V‡C‡[Ÿêš^”Ã”ÂþM" },
{ "x","xing","ÐË õÐÇˆžóUÐÉÐÊŸ“¬wÐÈÓq¹ž¹“õSÅdÓwòH•Û°‹ö]ÐÌÐÏâ¼ÐÐÚêÐÎéàDê€Üþ›™ÐÍè—ŠÈè™íÊâ]Íœîã‹ãoätðhÊ¡²MÐÑß©ÐÓÐÔÐÒÐÕÜôÇn‚†Šüã¬›ëÈŠ¾mþN‹ñÅB†QÖ_" },
{ "x","xin","âàÐÄß”þ€ÐÁÐ¾Š|ÐÃžÔ–‚ÐÀê¿±^Ý·‚r¹ÔDâdÐ¿ì§ÐÂQä\‡Œ‹×Ð½Ü°öÎñQ–“ïâÒWç†²êc¿Ø¶ŒJÐÅÜŒÔMÃ’ÐÆŸ{ñ^îˆÅgá…" },
{ "x","xie","Ð©ŠÀªn“aÐ¨ÐªÐ«ÏÒ¶Ð°„µÐ­”ýÐ²…fŠGˆ•elÐ®’’¶Ã|Ã~Ã{Ð~Ð±Ð³ÙÉ½eÁ–½’¬€ï†àÐ¯Ÿ»ÄnöÙÐ¬Îq¾™çÓß¢“û¿EÛÄÖC X‡¯”XíPÒp”yŒ@×ýšÐ´ÑªƒæŒ‘Ë†ÄžÂç¥Ð¹ÐºµmÀ‹›ªžàžáÆõÐ¶…lÐ¼ŸL¶cÇ‚Ä‚´Ÿc¼œÐµ½X½uÙôÐ»ŒÑ‹räÍ‰fƒD½âìˆé¿éÇÑ€•»¾Š‡ƒŒÔâ³ŽOÊÐ¸âÝåâÞ¯ËZ¼Ií…ÖxÒCÛÆ‰êžaíCý^ÀTÐ·Ï’å¬ yýaýkÀiýKõó" },
{ "x","xiong","„öÐ×ÐÖƒ´ÐÙ×›ÜºúÐÚ›°r†MÐØÃrÔKÔžÙ‚ÐÛÐÜŸÃŸ‚Ÿ‡×œÔw‰é”¸˜U" },
{ "x","xu","ÓõÛ×Ðçíì¯Lí¹™øñãÐëçïÓ’ÔSÑSÐéÌ‚»× ‹€“Tœ•šHÌ“íš½—ìÐèôqÐæÐê‡uÊŒ‹Áš[¿H¾–ÎdÕšš_ ^ÖžôzÀ]òôPè`‚TÐìƒÛµŸÉ[ÐíÚ¼…éŠä°èò«†Ä• Ô‚·Pà†ôÚÖ[õ¯±SÐñ•BÅÆ^Ðò›Tò…rV›UÐô•dÐðäª•vš~ží«—ˆ¦šAÐóÐïŸTÐ÷Ðø”›”¢ÛÃ„ÔäÓÐö‰ÙÂ{Ô[Ðõ•ý¾AÙ[íœœäÐî‘Aìã˜s…ã„Â…¾w±N²W·Vôˆ¾{ªËvË…Àm÷rþCÞ£" },
{ "x","xiu","ÐÝ‚cÐÞâÓßÝÃ‘žòÐßÃƒð¼Å^õ÷âÊó…ã–˜¼÷Ûø æTæ™ð}÷GïqÆvÐàËÞœú€¼NÐãá¶LÐå«‹Ðä³ô¬LÐâ½‘äåÐá­PÑ…Ñ„äPÎ¿‡›ÀCçVçnýMõx" },
{ "x","xue","Ï÷¯TÉHÑ¥Ñ¦ÞjÞmíYÑ¨”ÄlÆ‹NÑ§í´û`Ðõ½ŒWŽG‰®àå KÍÓ{ú›åæÑ©÷¨÷L…É üŒúˆy–ùÚÊÚpÖo²xžy˜ÝÄ}ÞG" },
{ "x","xuan","…ºÐù•RÐû…•tÜŽ—]ÚÎÝæÈkÐú‹lÞï‰HËÐŸœìÓÉ{êÑ¬u²UÎh¶P¹ŽÂAÙØämìœÊž‹Ö‘¤ÕÖXòCæMÂQÏ²ÌTÌB×XÐþÏØ«tðçÐü¬IÐýÍ•‹Ÿäöè¯•Ã™e­v‘Ò†IÑ¡Ÿ@ßxÑ¢°_È¯ãùRìÅ•]Ñ¤Ñ£îçÐž¬K±†ÐfäÖ½ké¸˜CãCíÛÊRïàïX¿¿’æ›ÚK" },
{ "x","xun","ˆ_Ñ«»çÛ÷Ÿ[„×‰_Ñ¬ñ¿„ë„ìË`Þ¹‰¶â´êÖÄ `ÌQ²†Àc o‰Ëõ¸eÑ²Ñ°Ñ®–hÛ¨Ñ¯®pÝ¡Ü÷ä±ä­á¾âþ¼r«‘–Õ—Dš½‚ÅÑ­Œ¤“MÔƒöàà‰‡xÌ¶¡ñ­R” @Ÿñ˜ßÏy÷S÷\žµ…_Ñ¶ÑµÑ¸¾Ñ±Ñ´ùªFÑ·Þ™Ž…áßÑ³ÓÓ–Óœ¿£ŠQš¦Ùã¶ñZßdôÞ¦‡eîšèR‡ " },

{ "y","ya","¨ÚÑ¾ˆRß¹Ñ¹ÑáÑ½ŽâÑº–‘Ñ»ÑÆÑ¼èâŒSè›ÑÅ—¿øfø†åE‰ºùsçŒÑÀØóÑ¿á¬…ƒ«eçðÑÁ¸ŽˆÛªcÑÂŽÑÄâXíýÑÃQý\ñâ…|ŽÞ¯P†s†¡ðé¯{Ê‹„²ˆLÔþÒ‚ÒƒêÑÇÑÈåÂ„ ë†Üˆí¼’¥æ«Ûë‚oë²’éÓ ˆº‹IªmÂyÞëšå¶–ˆB¸Eý…öVècÜ…" },
{ "y","yan","ÑÊâûÑÌÒó«ŠëÙÑÉÑÍ›þãÕÑËáÃäÎëç³šŸŸšPÛ³ƒBæÌvöáZéŽÑà‘Ã‹éºc‘±ÅEüiÚ¥ÑÓãÆåûÜ¾ÑÏÚçÑÔÓ…àIÑÒÑØÑ×žÏ•VªPÛïÇrŠ¶ŠÔÑÐÇ¦ÑÎŠ×ÑÖ†«¬J³xÔPéZÑÑ½žóÛ»¼†Ç‰c“C—ðÔ´NÊBÑÕÌšé…—éÜî†îº™‰ÁŽi‡À™¿ŽrŽs‰Ìû}µhûš‰ü’Z›WÑÙmÙðƒ¼…]mÙ²ÑÜØßÑÛáDÙÈÑÚÛ±ØÉÈTßVëC°“Rœ{œ‘þ—¦Ý••çüî»Ñs—ãÑÝÝÑŠÎi÷Ê‘î‡{Üy¿tüd™•…˜üf®[ùžöoýŒüküjƒ°ŒEî›ýB÷úô|ŽtŽv•óýzüsÑáŠzÓ_ ²ÑâŠ°Ñå©ŸSÑäÑéÑçÑÞêÌÒ‚©ÑèêšŸgÑæìÍÑß†ÍÑã”©ª_³Ž—âøHäÙœÄ‰†ŸÌ…’õ¦•¶øeÚÝ‹Ç÷ÐŸðØÍôeÖVø‘•à‡™àòVòYþÆFÙž‡²‹÷ w•êòzázýdú`ÚIž¥‡ÙúŽòžá€×…ÓƒðÆGá‰óFž ž·×—ØVØWž¹þŸ„‰˜ÜÜ‚" },
{ "y","yao","çÛØ²ßºÔ¼Ñýš|µnÒªÔ@†ºÉ@—êÑüø^ø€áèÑûØ³Ò¢Œ¸ëÈ½ÄÜéÒ¦ié÷ˆž÷ÌÕ‚xçòÒ¤ï¢ˆò“e‚çÒ¥ÝUœøáæÒ£ßb†Ú‹„ªrÒ¡“uç“Á˜l•¬ïuÑþ¬ŽïŸ¸G¸H´tŽAŽCðPôíÖ|Ö{æc÷¥ï_Ìißˆî–öŽ÷]¦ŒaŒë’qèÃ–” úÆwÒ§–Ì±l·ñºÒ¨‚¶‹QáÊœÈÉ|˜eé™ò[ýoúrÅ±·ŽÒ©Ô¿Ð‰·šÈ™¹OÔoì‰ÒŸÆðÎª’ýGËaËŽ dê×Å—²‡Ò«Àfú_×Š" },
{ "y","yang","ÑëŠš’tãóÑêÃoÑí±jÑìãZë‡÷±ø„å}ÑôêgÑïÑòþtïrì¾Ñî•Dè–ÑñšÞ„½ÑðáàÑóˆ”•[Áf«ŒìÈê–±ˆòÕ“P¤§Ÿ¬—î”®¬„•ª¯ƒÝŒÖUåø—ï^öuìRûF…nÑöÖ…óŒ÷ˆtžæ–³ÑøÑõÑ÷½DÝI˜D‚êûšçï…Î^ðBñ‘Ä”ažY°Wâóí¦ÑùÁkÔhÑú˜”˜ÓµS" },
{ "y","ye","…½Ò®‚œÒ´Ò¬•¢šS£Ò­”IÐJÐ°Ò¯’ÀÞÞîô ”¬ˆäyæU¨ÝÒ²Ò±Ò°ˆ¸‡Sc‰­ÒµÒ¶Ò·Ò³•öÚþ’wÒ¹–¥×§‹ÑÊí“’Å–¦ìÇêÊÒºÚËÈ~Ò¸š‡˜IŸ¤ñ@‰¢­LƒpŸî•Ð•Ï°‡²w”@à’ØÌðYÖ]ŽIŽJÖ”L²|•âæEædðv”KµB {ùwèHìvóBûECˆ" },
{ "y","yi","Ò»oñÂÒÁÒÂÒ½…À‰ÒÒÀµt›¥ßÞàcœjÒ¿â¢Í~Ò¼Ò¾ÒÎ¶Bäô·Fãž‹¡‹Â“Ì‰ßàæ­Cûp¿ˆ™}™átš­÷ð×búsüpUÒå…FÒÇÒÄÛÝŒbÚ±ƒÞ–sÒÊ›nîåÆÒË ôâùâÂ’ÒÌqêÝ[Þ–Üè®A«}ß×Ó”Ø—ÒÈ–Ø–õŽƒíôÐ‘Œh‘üÈUÉßðêÒÆ—×Í†ÙOÔrÁrÒÅ‹fÒÃïí›ÕBÛD—à•ÒÉŸÛßzƒx£¤ŽKÎ’îUîVî{ø˜õkºmáÚŒ–ÒÍ¥Ö–çF»JÓ~×‚ÒÒÒÑÒÔÞ~îÆ”ÒÓÜÓÌÎ²ÆqÞŽåô¯ÒÏá¸”ôý‘ýÞ ÒÐ‚Ã”î©ârãiøCÑv¶êì½ÛpÝ}Î•”¹‹ÚµEÏÅœî‰ÞTýtVÒÚß®Ø×ÒÕÒä°¬êdØîÒéÃE±ÆNÒàÒìæÒÙÒÖˆ`ß½„·ÒÛÆiØýÒëÂk–pÒØ–žËÒ×Ðt¶hÒèÙ«…ê…åæä›uâø@Òïá»›¶Ž•Ž–‚XÞÄÞÈÒßôà•i«péó–¤Ê³–å™ýÐšÒæÒê†j›Å›ÎÞÚã¨ˆ£ÛüˆËÒÝ„ÖÈ^š¡ñ´Òî–Ø[Ø\®ÔTÔUëcâNÁpâzÝWó`Ú˜Ôm•””§š…—©Ÿ|Í‚àvœ™Ž¯àÉÒççËƒÏÁx{²Gª~¸v¯mÒâÔ„ÒÞÒáÑ`ñk˜]ðùÄjòæÉš„ãM‹ƒ|ûkûoÒãï×¯Ž˜¯ìÚŸÖŸéºIÕxü]Å’ D•Ëéì¯–²e·jÎœÒA¿OØæÞ²Û‹ÎŽF‰©ˆI‘«‘›Œ•ôèÒíÒÜ”¾šc•Ù J W™jÙŒØŠõlæ„Ù“ïîñ¯Ë‡Ë„À[ÀXØsìJöGù€ùð†á{áy×g×hÌ[ž‹‡ÒèOúgú^Ü²Ò~ú…óAúœû@Ìˆý~×”Þv„ù„J‚‰ñ®Šù‹ùŒ" },
{ "y","yin","‡àÒòÒõêfðÒðóSÒöä¦ˆŠÒô–ðë³ÒóêŽê›ê”ƒø¶†î÷ÑP½s¹NÜ§Öà³‹AœÞÊaÉMµš‘@¯ŠãŸì´€¾žÖNë–ñ—ë éž‡‘ž@ý]íƒÜZÒ÷ ìÛßžô”Õ›ŽÛó‡ôáþ|ÇZ«ÓÓ—ÔCÒøÒùÒú‹H•Ÿâwý‡œô´HÛ´Ê_â¹ãyö¸Õz­Kš’‡w‡¨Ïr™ƒö¯ýlúÛÈÒýÒüÒûßÅò¾ÒþÚ_âiï‹œ^ëLï‡ì‚Ýl–@Úyñ«™aë[Ž\þÏP™’Ìa™Ó°a×Ó¡ÜáÒñ›Ø·ˆ¤ˆøœšªZJþ“ñ¿áS°E‘\‘€‘õg‘¶Œè»ƒ" },
{ "y","ying","Ó¦êÓ¢Ýº«›‚Ÿœ€À†Ó¤‹kçøŸ––PéA´Q‹”àÓÓ§Þü®O¾xÎsó¿ÙaÓ£è¬ðÐ‡|ë›À”ÑšøŠíŒ‹ëâß‘ªÓ¥®ZùúDÀ›×G‹ý‡Â”tÌcŒ[ž‰™Ñ­‹µ_×súLè]úˆÐNÀtú—ûKûWÓ­°ŸÜãÜþÓ«Ó¯Ó¨Ó©ÓªÝÓÍw†ÓÈtœ»œÁäÞÝö‰LéºƒOÓ±ŸÉÓ¬äëÎ„¶H¬“Îž IÙø¿MÓLÖhÓ®õöžLËpž]Ï‰ævŽc”lå­ž„žuÚA™Õž¡»Yž­»kÛ«³A›Æ—wò£ïI“²Ó°}·fñ¨îeç_Žg°`Ó³•£Ó²ëôÄ{÷j–Ó—@áêC" },
{ "y","yo","ÓýÓ´à¡†ÑÀ’" },
{ "y","yong","Ó¶ÓµçßÓ¸Ó¹‚ò†Þà{Óº‹£KÜ­ã¼ œÛÕÑ“í‡‡ïÞàaÓ·°Mët÷«çOžœb÷Óúx÷I°bà¯ïJî„öÓÀð®Ó½Ó¾ÓÂ„ÊÙ¸–Ô–º~Ó¿ˆ¬ÓÁ¾Óœ¥Ô³‹Ó¼‰MÓ­òúÓ»÷‘Ûxõ—ÓÃÆoÉKák[³l" },
{ "y","you","ÓÅÓÇØüQßÏ›|ÓÄr›ÁÞœÓÆû~ÁyH‘nà›ƒžžX‡¦‘É™¢ÂiÀlÞÌÓÈÓÉ®h›YÓÊÓÌÓÍJÃUMðàèÖŽîà]Ý¯Ýµ¶xÓËòÄÔI‚ºßKß[ªqÓÎöÏ÷†â™˜AéàÝjñfôœòøòöÊ~õOÝ’ôíþQÓÑÓÐÓÏJØÕÆhÁhÝ¬–ë—XîðÂuœ±Íœµ™äB˜©ë» ¨÷îÓÖÓÒÓ×ÓÓÙ§ ûfàó ¶µvÞ”†Nå¶ŠµÓÕ†eòÊŒÓÔØzáRÕTÑ„÷ø™ÔŒM" },
{ "y","yue","Ô»•õÔ¼¼s¹–³EßÜ‡‚ÔÂÀÖ‘àë¾ŠxŒé’`µj«h›‡ÔÀËµxèÝÔ¿îáÍRÍQÔÄÜ‹ÔÃ‚’ÕÔ¾Ú”â_Ô½ÔÁ»›ãXé‡é†ºMéÐ‹íŽ[Ùß»CÌgå®ügÜS ~¶^»aè€ûN»lûV" },
{ "y","yuan","‡äÃOð°„uÔ©Ô§íóŒw›ðÔ¨œaœeœmœYÉA­Éd—¥ûgÑrÍ›óîøSñrÎQøxùt‹õž”üŒüÔªƒÒß–ÚOãäÔ°Ü¾Ô±ÆŠ–zÔ«ë¼Ø’¸ÍWÔ¬Ô²Ô­†T…ŒæÂªjÔ®‡ûœ®ö½ÔµâƒÔ´œÆˆ@ˆAÜ«Ô³‹‹…ÉVÔ¯˜g˜r¾‰ô’¿FÑ“ÎzÎmó¢üxÁ~ËQéÚà÷Þ@Öwæ…™´ß‡ò{ù úM…™Ô¶±\ßRßhä‘‰íÔ·Š†ÔºÔ¹ÐcÛù‚ÓÞòµžè¥Ô¸ÑjÑ†‡…îŠ" },
{ "y","yu","ÞzÓØÞ}Óõ’H’Gæúì¶·‹ê|¼u±EÝÎÓÙ†‰ðö¹zÓëÓÚ€ÓèßŽ­Óàæ¥’T–fì£«_«]ÓÛÐsô§Óãô¨óÄÍGØ®ÆœÓáƒÊÚÄÓéŠÊŠØâÅáü–üáCö§ô~ÓæÝÇÓçêœÈhÓåœŸÞíˆèˆï·áÎ£Óâà¯˜KÓäëé®Œó^ÓÝÅ„êìÓÞè¤šQÓÜ˜@ ¢Óßñ¾²IÑˆOÊvòõšuëkðNÕ˜Á|ÛuÓD‹äÄ­mšeÏLÝ›å“Ö~ókõ‚òe»B”ùÞXÌ]öiþeú}ûCý{ÓìÓîØñÓðåýÓêÙ¶‚RÓï’§Óíàôµ€àö” …Pàh‚¦â×Èg”Ñèžðõ—åÅc¬r‚øŒ†ÕZñÁîYö¹Ø…‘µ‡‰ŽZ”Ë·{û‡ýrí±Ô¦Óñí²ÓóÆRˆSâÀãéó¹È™öÓýÓôÆ‘Óü¶rêÅÔ¡Óøª‚qÔ¤îÚ³_»ŠÑ@ÚÍßNÝÒÎ¾ãÐœUœM±ƒÓûÓòˆÖ—§—™—š¬ZŸ~Ô¢‹VÓ÷†³†ÉŽ÷ÓùÓöñSï„ÖàðÁ³‘³†²œÔ£â•ÓþÁNîAÝ÷ÉfìÏœùÓú·C‘íÎµƒhëTîªz‹ž¾sòâÎCØ¹¯ãƒÝhÔ¥ä`ø\ßyÊ É™ìÙˆ·U‘jËìÛŸúÊšøƒøˆø…å[ÖIé“´›¶RðÖôrƒ™ùOµN°Káqºhð|™ÈÌPìM×uçŸëzå÷ò™äú–÷N»ZûO™óý›ôcôd»nžº Œþ’µHÜ†" },
{ "y","yun","ÔÎÉCÀˆÉQŸ±ëµšèŸ¾Š[Î‚ÚSñNÙšÔÈ„òÔÆ»Ü¿Ô±Šu›Vç¡‡çêÀ¶n±d®sÔÇ›éÂmÔÅ¼‹ë…àyÉlœÝäóÞ¹oŸÂ·Ê|ä]ºJ¿a˜øÔÊêmáñ’dŠ@ÔÉÇ\éæëE†½âqñašŒ´pÙ„ìBýqýyÔÐÔËÛ©–—ã¢ÔÍài‚Öß\ã³Á‘C•žè¹ÄZÔÏÑŽìÙÔÌÊŸ¿ZádájðaíyírËœÌNí’l" },

{ "z","za","Ž‰ÔúÔÑ›eßÆÞÙ–ýãNô˜ÅHÅNÔÓ›jÔÒíˆëjÒSës‡Í‡Ôë{Õ¦u™U" },
{ "z","zan","ƒ³ôØ™Vºdô¢ºùaç‘ç‡ÔÛ‚Ì†¹ÞÙêÃŒv“S“Ë‡kƒ›”eÔÜƒ­”€ôõÚŽÔÝ•ºÙmÔÞöÉà™àŸžUÛŠçYÙ­è¶áA‡Ôž£×{­‘¶`Ò{×“ð•" },
{ "z","zao","‚óÔâÔãásÛ›ÔäèÔçÔæÔé——Ôè­bËkÔåÔîÔí°oÔìßð†r—_‘VŸ¯†×ÅºrÔëÔï¸Y¸^×YÚ‹Ôê–Ò" },
{ "z","zang","…MÔß ™ÔàÁnÙ_Ùjê°ÚEóvÚNæàñzÞÊn‰ZÔáÊiäQ²ØÄ ÅK™â" },
{ "z","zai","ÔÖžÄçÞÔÕžüÔÔœ…œÖ²PÙ†×ÐÔ×ÔØáÌÔÙ’DÔÚ›’‚îÝdáPƒ„¿fK" },
{ "z","ze","Ôò›gÔó›zÔðåÅÕ¦Ôñ„tàýßõ†¨ô·óÐØŸ²žœõœÚóå‡K‹¨Ž¾ÊjØÓ˜ÁštÕ‹“ñ²c°ƒºjÙ‘´ŸÒ]Ö‰Ïý`ývûBØÆŽÙšòê¾•W²à’¾¡’k³’" },
{ "z","zeng","•ûÔø‰ˆà‹çÕÔöÔ÷™I­Q´Œ³DîÀ¿•ÖŸ×Ûï­ä{ÔùŸåêµôgÙ›‡×" },
{ "z","zen","ÔõÚÚ×P" },
{ "z","zei","Ôô‘åÙ\÷ŒÏŒöf÷e" },
{ "z","zha","Ôúß¸Õ¦’s’Ÿ²é–¼ŠL¼’ßî‚¼¼™ÔüœÑÔûâªÞêé«„ž“«°•Óu˜Ï°š×A÷þýOÔþÔýÕ¢Õ¨Õ¡Ílà© £él¹†ÂdåŽ×Q…~Æz’€Õ£íÄ÷‡÷õWõ~Õ§Õ©žÁßåÕ¤×õðäŒoòÆÔp“’é¶Õ¥À¯ëámÉ" },
{ "z","zhai","²à‰ã’ÆÕ«”ÈÕª˜zýSÕ¬ÔñµÔ™yÕ­ãSÔð²ñÕ®íÎ¼À‚ùÕ¯»yñ©" },
{ "z","zhan","Õ¼Õ´–Õ±ì¹–îÍtÕ³ïÚjÔa¬Õ²énÚÞËUß‡~ŽEë•šØšÖÕ°ûr”ö×dðŒø@ô}ò ûD÷g×–Õ¶ïsÕµÕ¹Õ¸”Ø¬W±KÞøÕ·äã˜^ïQá\‹¶˜öÝšür×Õ½Õ»—CÕ¾ÕÀ‚·Ç•Õ¿—£‘é¾`Ýuø‘ðÌ›ÌœÒfÓOÞJ×`ò–Õº" },
{ "z","zhao","ÔîÈŠ„ÕÐŽ‚ÕÑá“×Åßú³¯ãDü…ñq³°å™°œ ×¦ÕÒÕÓ¬ÕÙÕ×Ú¯––žÝªDˆÕÔóÉÃAèþ”íÔtÕÖÕÕÕØÃD¹|Úw•× Yõe²™˜Á^À’" },
{ "z","zhang","ØëÕÅˆÕÂÛµƒ@ÉŸßl» æÑâ¯ÕÃÕÄ‘PÕÁ•Àè°ð\ó¯ò†û–÷J³¤ÕÇÕÆq´˜ÕÉÕÌ’EÕÊÕÈÕÍÕË›îŽ¤Ã›ÕÏ¯oá¤áÖ‰zÙ~ÕÎ¯“²d»wŽÇçb" },
{ "z","zhe","ÕÛòØÕÚ†ø‹«ó§…zšy³K³YÍE»qÐŸˆ³ÕÜ†£éü•†•‡††´Ô€ÕÝÚØß¡ÝmÝtäOíÝÕÞÏUõ„Ö†Ö•‡¬ÞH×y×„ÕßÕàñÒô÷ÛzæNñÞÒxÕâèÏß@ÕãœJÕá˜ÎðÑÏVúp»„" },
{ "z","zhei","Õâ" },
{ "z","zhong","ÖÐ«›O³„dâìŠqžÆÖÒ›wÖÕÖÓ–°ÖÑÐxô±ÖÔ½Kâ{Î@ïñŽºÊWäVø‚Î ó®æRü™Û çŠ»bÖ×ÖÖÚ£†ÁŒ»ŸŽÄ[šp‰V·N¯~×õàÖÚÖÙŠt ðµrÐ{ÖØÆ Í\±Š‚£ˆú‹g¹WÐ\ÖA" },
{ "z","zheng","¶¡ÕýÕùÍÚºÕ÷Š’Õú Ž¼lˆÁžÚÕþÕõÕøá¿ŸAÃwîÛ±kÖ¢ÂtÕöï£’ê”˜ªb“@‹oóÝÛtã`± ÑÕôåP¹~ºPöëô@°Yçdšé’cÕü’ð•“ñ“ÕÕûÖ¤Ö£þÔ^Ž­‰^ÕŠìkàþøg×C" },
{ "z","zhi","Ö®ÊÏÖ§Ö»Ø´Ö­Ö¥›E›DÖ¨ŽÖªÖ«›‚Ö¯Ö¦èÙìóëÕÃe¶oÐ¯UëbÖ¬µ…–ñ‚u—d—ÐÅ]½¶A¶ž“wñ\Ö©˜u‘pøTø¿—ü~ÌuÖ´Ö¶Š‰Ö±Š©Öµ‚ŽÂpá™Ö°œFÛúˆÌÖ³‘çÖ² Ãµ•õÅôê­•ñcÞýž‹ÀZ‘eõÜÄˆ˜à¿{Û—Û•ÂšÏdÜÜUâºÖ¹ên„¶Ö¼ŽŽÜÆ’W›bÖ½Ö·ˆ^ˆp’nÆ‡ìí¶qdéòè×³UÐ}åëÖ¸›œœ]Æ¼ˆ¯WÔJÖºíéÝTõ¥Õ‰~áçËŒÒjÆWÖÁõô’XÊÊ¶âåÖ¾ÖËÖÊÖÎˆ€Û¤ÞŒ…„ÖÆÖÄàù’”ŽæŽèÚìÖÅ›±èÎ–»µwÖ¿èä•yšlÖÈêÞéù¼ŠÍªOÖÂÐ—¼•®‡ÖÏÖÌ¯bèœðºØ Á“ÓdÐ˜ªaÃÖÀv„Œ‚À¶ˆ—„ÖÇÖÍª‚ÐæïðëåéòÎÖÃé@ÛNÝe¹eïôŒ…“ˆDœíÖÉœþ‰yã‡ÑuÒžÕI¯€¯Fö£õÙÙ|äkŸÜ·Wëù“´“¯ŽÃ”Të\­M”òž\øvñ‹¿@ÏH‘Á™±·aƒœ„¬”`”S‘ÆÙ—ÓzòsöS™£­}ØTµYòòŽúvÜWèeØU‚f†" },
{ "z","zhou","ÖÝÖÛÖßúÖÜÖÞ×žžëžö«‰µ÷àXÞb‹Bœ@ßúßLÅûb³BÖà†µÚQÝcã{ÝqÙkë“ù@Öa±T‡œòL×pæ¨ÖáÝSÖâ¯JÖãÈF•Ž²H¹öBæûÆþVÖä…âç§Öæþ`ƒÙ×£Öç†BÝ§¼qëÐÖåôü»‹ô¶•ƒÈ’ÔkþUþ_®Lƒuñt°™¿U‡€Öèôíô¦»Q»NóEíØñ™" },
{ "z","zhua","×¥ÎÎ“ë™tÄºœó˜×¦" },
{ "z","zhu","ÖìÛ¥ÙªÖïÜïä¨ÖîÖéÖêÖí¶‹îù³pÑNÖë½ZÕDÛHãéÆÎwäóÊxéÍÖTØiñ–ø–õfü}Ë žzö^™Á™½ÐEÊõÖñþqóÃ¸‰èÖÇAžÛÖòÖð·”¸˜ßIÉðñºa TÏŽõî÷E„±ŒFž¯ ‰”á™î•ôÐWè“Ø¼Ö÷„¸ŒeÖôÖùÁCê•Žªä¾ÖóŸ—ÊôÔ}ñÒîÖö G÷æÖõ‡Úúž²šÄþØù×¡ÐÆ^ÜÑÖúÀ‚ˆ|Öü×¤ÞŽèÌ’}×¢×£–ÇìÄšŸ‰ÔÇdµ‚¸m±vðæ³dÖû¼Ÿ½AÖøÊüÁqÖýÖþÙAÝOÔ]ÚŸ­ãL¹hïŒñ[óçôã˜ÖäŠñvû„ºBºZº|èT‰£" },
{ "z","zhen","ÕêÕëÕìÖ¡ä¥ëÓÕä«‚Ø‘á˜ìõèåÕæ±wÕèŽž‚ÉáIÈœŽ¬ŒzœßZÕåäÚ‹ª€“ŽÝèÉRÕçé©˜Eµâœ¶G¬‘é»´Uš‹›óðÕé˜çØËmågÝŸæP»E÷yÕïÕí’réô•_ŠªŒÇ±pÕîî³ÐÂr½GÑ]ÝFÒ˜Ô\çÇñ}ð¡¿b¿jÞtôIümÕóÛÚÀƒ®lð²ê‡‚E’™Õñ–ÚëÞ¼…±‡êâ‰`“L½„ÙcÕgÕòÕðøcææ‚ä‹" },
{ "z","zhuai","×§×ªÛJ" },
{ "z","zhui","ö¿×·æí×µ×¶åFòKùx›d×¹¸ŠÜ×ºçÄ®IÄJã·®•Äi³›‰‹¾Y×¸¿PÕ…á^åY´œÙ˜èV" },
{ "z","zhuang","×¯×±ŠyŽáÇPÇfŠÏ×®—[»’×°œ³Ñb˜¶¼PÞÊ×³‰Ñ×´ î‰ÕŸ`Ù×´±×²í°" },
{ "z","zhuan","×¨…¡ŒŸ×©þzŒ£à‹§‰t®U­AÄx´sò§´uÖKî…Ïm÷H×ªŒN¸|ÞD´«ãçžÀßùÜžˆæÉE¬ƒÄR×¬ƒQâÍ×«×­ºeÒN¿xÙ×Nð‚»M‡Ê" },
{ "z","zhun","ÍÍÞ„ŒdëÆñ¸×»†”ÕÐq×¼ˆÍƒýœÊ¾MÔR¶›" },
{ "z","zhuo","×¾žã×½Ù¾×À—‡—zäÃ—¬ìÌ˜‘þ‰·qßªè@·‡° æšõˆV×ÆŠƒ×¿…¬×Â×Çí½ŸOä·ÚÂQ×ÃŠß×Ä†×Å—Á•Œ”Ù”Ú×Á¬k³˜ÁM·Ÿìú”Û“â“ð„ŸÕŽÕ}ärºW½Éáåª”Þ”½Ö‘ïí™·ùhõîÏ—ž•èCú|»SÐX»m¸B" },
{ "z","zou","×ÞæãÚîàYÚÁÇˆ’ô—¯—°àu¾j¹tÕŒöíÛ¸üPöOò|ýwýÚ[×ß×à×á" },
{ "z","zong","×ÚèÈ‚óW×ÛˆîÈëêÈ ªf¸¾×Ø—Þ–Q·OÙƒ¾C¾hÂC×ÙÛr¾›ŸÙÎx´†¿å†××òRÛ™òiöRôAôiö`èQ×Ü‚~ÙÌ’Ö“K“i¼Ÿt‚ôÉ~“¨¾t¿G¾‘ Q¿‚×Ý•f¯Sª`³ŸôÕ¼F¯—¿k¿vØq¼_" },
{ "z","zi","×ÐŒI×ÎÖ¨çÞÆ†Æ×È×ËŠœ×Éêß×Ê«R–ã¼|Úaç»¶‡ ×ÍÚÑÇÈŒàt×Ìœ¹áÑ—ÂôÒê¢†êæÜŒUïÅµ›ôôõþö¤ÙYÙD¾l¾zö·âˆ·TéCÝwüˆöö÷ÚÝ–åOÖJÚƒÐæSætîoîpýUùƒõ™ö‹ÀdýbÉ›×Ó…»–jæ¢Š—Ãc¶f³IÍIñè×Ñïö…èÜëóÊâBè÷†×Ï×ÒÔ`˜h×ÖÆT×ÔÇSÆ“„‚• ¼í§íö±{×ÕÃuÃhn†ïôõ–" },
{ "z","zu","ÜÚ×âÝÏÈ{Éa…a×ãþ„×ä†XŒœ×å—½¹ŒÛnïßæ—×è×ç×é×æ«~ •ÙÞ†€½MÔ{ì†ü“t" },
{ "z","zun","×ðý×ñé×À–¿Ÿç÷®ú•÷VƒV‡gß¤×J’Äã†" },
{ "z","zui","¾×…‰Ã†÷˜áÏ`Àxõþê×ì‡’­r–èƒâ½SáE•µ‘×î·B×ïÞfáU˜—×íÞ©ŽTäŽå@™d™i" },
{ "z","zuan","×êã@„®èjõòÜgèºeÀFçÚ×ëÀjÀy»g×¬ß¬" },
{ "z","zuo","×÷àÜ·s×òÇg¶}óÐ’Û×Á¹iâ—¶š×ó×ô´é¿–Úè×øâôŒöŒõ‚FìñëÑÐŠ×ùßò×öÈyÈzïŽ¼d…ø" }

};








int getComPingyinForStr(const QString & inStr, QString & outFrist_py, QString & outFull_py)
{
	// --- Ìõ¼þ·µ»Ø
	outFrist_py.clear();
	outFull_py.clear();
	if (inStr.isEmpty())
	{
		return -1;
	}


	// --- »ñÈ¡Ã¿¸ö×ÖµÄËùÓÐ¶ÁÒô
	int numOfWord = inStr.size();
	QVector<QStringList> fristPys;
	QVector<QStringList> fullPys;
	for (int i_word = 0; i_word < numOfWord; i_word++)
	{
		QStringList fristPy;
		QStringList fullPy;
		getAllPingyinForWord(inStr.at(i_word), fristPy, fullPy);

		fristPys.push_back(fristPy);
		fullPys.push_back(fullPy);
	}


	// --- ¿ªÊ¼ÅÅÁÐ×éºÏ
	QVector<int> nowIndexList;
	QVector<int> maxIndexList;
	int sum_maxIndexList = 0;
	for (size_t i = 0; i < numOfWord; i++)
	{
		nowIndexList.push_back(0);
		maxIndexList.push_back(fullPys[i].size() - 1);
		sum_maxIndexList += maxIndexList[i];
	}


	// --- µÚÒ»´Î×éºÏ£¨ËùÓÐ²ÉÓÃµÚÒ»¸ö£©
	bool mustCombination = sum_maxIndexList > 0 ? true : false;
	for (size_t i = 0; i < numOfWord; i++)
	{
		outFrist_py += fristPys[i][0];
		outFull_py += fullPys[i][0];
	}


	// --- Ñ­»·±éÀú
	while (mustCombination)
	{
		// --- ×éºÏÅÅÁÐ
		bool alreadyRunOnce = false;
		for (size_t i = 0; i < numOfWord; i++)
		{
			if (alreadyRunOnce)
			{
				break;
			}

			if (maxIndexList[i] != 0)
			{
				if (nowIndexList[i] < maxIndexList[i])
				{
					alreadyRunOnce = true;
					nowIndexList[i]++;
				}
				else if (nowIndexList[i] == maxIndexList[i])
				{
					nowIndexList[i] = 0;
				}
			}
		}

		// --- ×éºÏÊä³ö×Ö·û
		outFrist_py += " ";
		outFull_py += " ";
		for (size_t i = 0; i < numOfWord; i++)
		{
			outFrist_py += fristPys[i][nowIndexList[i]];
			outFull_py += fullPys[i][nowIndexList[i]];
		}

		// --- ÍË³öÌõ¼þ
		bool canOut = true;
		for (size_t i = 0; i < numOfWord; i++)
		{
			if (nowIndexList[i] != maxIndexList[i])
			{
				canOut = false;
				break;
			}
		}
		if (canOut)
		{
			break;
		}
	}


	// --- ·µ»Ø
	return 0;
}

QString getNamePingyin(const QString & inStr, bool isLastName)
{
	QString outStr;

	// ----- ÐÕÊÏ
	if (isLastName)
	{
		// --- ÔÚ°Ù¼ÒÐÕÖÐ²éÕÒ
		for (size_t i = 0; i < g_length_lastNameTable; i++)
		{
			if (inStr == lastNameTable[i].hanzi)
			{
				outStr = lastNameTable[i].pinyi;
				break;
			}
		}
	}

	// --- Ö±½Óºº×Ö¿â²éÕÒ
	if (outStr.isEmpty())
	{
		for (int i = 0; i < inStr.size(); i++)
		{
			outStr += getNoRepeatPingyinForWord(inStr[i]);
		}
	}


	return outStr;
}

void myNameSplit(const QString & inFullName, QString & outLastName, QString & outFirstName)
{
	const int doubleLastNameLength = 90;
	static QString doubleLastName[doubleLastNameLength] =
	{
		"Å·Ñô" , "Ì«Ê·" , "¶ËÄ¾" , "ÉÏ¹Ù" , "Ë¾Âí" , "¶«·½" , "¶À¹Â" , "ÄÏ¹¬" , "ÍòÙ¹" , "ÎÅÈË" ,
		"ÏÄºî" , "Öî¸ð" , "Î¾³Ù" , "¹«Ñò" , "ºÕÁ¬" , "å£Ì¨" , "»Ê¸¦" , "×ÚÕþ" , "å§Ñô" , "¹«Ò±" ,
		"Ì«Êå" , "ÉêÍÀ" , "¹«Ëï" , "Ä½ÈÝ" , "ÖÙËï" , "ÖÓÀë" , "³¤Ëï" , "ÓîÎÄ" , "Ë¾Í½" , "ÏÊÓÚ" ,
		"Ë¾¿Õ" , "ãÌÇð" , "×Ó³µ" , "ØÁ¹Ù" , "Ë¾¿Ü" , "Î×Âí" , "¹«Î÷" , "ò§Ëï" , "ÈÀæá" , "¹«Á¼" ,
		"Æáµñ" , "ÀÖÕý" , "Ô×¸¸" , "¹ÈÁº" , "ÍØ°Ï" , "¼Ð¹È" , "ÐùÔ¯" , "Áîºü" , "¶Î¸É" , "°ÙÀï" ,
		"ºôÑÓ" , "¶«¹ù" , "ÄÏÃÅ" , "ÑòÉà" , "Î¢Éú" , "¹«»§" , "¹«Óñ" , "¹«ÒÇ" , "ÁºÇð" , "¹«ÖÙ" ,
		"¹«ÉÏ" , "¹«ÃÅ" , "¹«É½" , "¹«¼á" , "×óÇð" , "¹«²®" , "Î÷ÃÅ" , "¹«×æ" , "µÚÎå" , "¹«³Ë" ,
		"¹áÇð" , "¹«ðª" , "ÄÏÈÙ" , "¶«Àï" , "¶«¹¬" , "ÖÙ³¤" , "×ÓÊé" , "×ÓÉ£" , "¼´Ä«" , "´ïÞÉ" ,
		"ñÒÊ¦" , "ÎâÃú" , "ÄÉÀ¼" , "¹éº£" , "¶«»Ê" , "ÔóÎÌ" , "°¢Ôú" , "ÔóÀÊ" , "Ë÷ÀÊ" , "µËÕæ"
	};

	// --- Èç¹ûÓÐ·Çºº×Ö×Ö·û£¬Ö±½Ó·µ»Ø
	for (size_t i = 0; i < inFullName.length(); i++)
	{
		ushort uni = inFullName.at(i).unicode();
		if (uni < 0x4E00 || uni > 0x9FA5)
		{
			outLastName = "";
			outFirstName = inFullName;
			return;
		}
	}


	//
	outLastName = "";
	outFirstName = "";

	if (inFullName.isEmpty())
	{
	}
	else if (inFullName.length() == 1)
	{
		outFirstName = inFullName;
	}
	else if (inFullName.length() == 2)
	{
		outLastName = inFullName.at(0);
		outFirstName = inFullName.at(1);
	}
	else
	{
		QString guessLastName = inFullName.mid(0,2);
		for (int i = 0; i < doubleLastNameLength; i++)
		{
			if (guessLastName == doubleLastName[i])
			{
				outLastName = doubleLastName[i];
				outFirstName = inFullName.mid(2);
				break;
			}
		}

		if (outLastName.isEmpty())
		{
			if (inFullName.length() == 4)
			{
				outLastName = inFullName.mid(0,2);
				outFirstName = inFullName.mid(2);
			}
			else
			{
				outLastName = inFullName.at(0);
				outFirstName = inFullName.mid(1);
			}			
		}

	}

}



int getAllPingyinForWord(const QString& inWord, QStringList& outFrist_py, QStringList& outFull_py)
{
	// 
	static Qt::CaseSensitivity cs = Qt::CaseSensitive;

	// Ö»ÄÜÊäÈëÒ»¸ö×Ö·û
	if (inWord.size() > 1)
	{
		return -1;
	}


	//
	outFrist_py.clear();
	outFull_py.clear();

	ushort uni = inWord[0].unicode();
	if (uni >= 0x4E00 && uni <= 0x9FA5)
	{
		for (int index_table = 0; index_table < g_length_hanziTables; index_table++)
		{
			if (hanziTables[index_table].hanzis.indexOf(uni, 0, cs) != -1)
			{
				outFrist_py.append(hanziTables[index_table].first_py);
				outFull_py.append(hanziTables[index_table].full_py);
			}
		}
	}

	if (outFrist_py.isEmpty())
	{
		outFrist_py.append(inWord);
	}
	if (outFull_py.isEmpty())
	{
		outFull_py.append(inWord);
	}

	return 0;
}

QString getNoRepeatPingyinForWord(const QString& inWord)
{
	QString outPingyin;

	// Ö»ÄÜÊäÈëÒ»¸ö×Ö·û
	if (inWord.size() > 1)
	{
		return inWord;
	}


	// ----- ÏÈÔÚ¶àÒô×ÖÀïÃæ²éÑ¯
	for (int i = 0; i < g_length_multiToneWordTable; i++)
	{
		if (inWord == multiToneWordTable[i].hanzi)
		{
			outPingyin = multiToneWordTable[i].pinyi;
			break;
		}
	}

	// ----- ¼ÌÐø²éÑ¯
	if (!outPingyin.isEmpty())
	{
		return outPingyin;
	}

	// ----- ÔÚÈ«×Ö¿â²éÕÒ
	static Qt::CaseSensitivity cs = Qt::CaseSensitive;
	ushort uni = inWord[0].unicode();
	if (uni >= 0x4E00 && uni <= 0x9FA5)
	{
		for (int index_table = 0; index_table < g_length_hanziTables; index_table++)
		{
			if (hanziTables[index_table].hanzis.indexOf(uni, 0, cs) != -1)   // QString.contains() ÄÚ²¿µ÷ÓÃindexOf(),  ËùÒÔÕâÀïÖ±½ÓÊ¹ÓÃindexOf()
			{
				outPingyin = hanziTables[index_table].full_py;
				break;
			}
		}
	}

	//
	if (outPingyin.isEmpty())
	{
		outPingyin = inWord;
	}

	// ----- ·µ»Ø½á¹û
	return outPingyin;
}

